<!DOCTYPE html>
<!--[if IE 8]> <html lang="ja" class="ie8 no-js"> <![endif]-->
<!--[if IE 9]> <html lang="ja" class="ie9 no-js"> <![endif]-->
<!--[if !IE]><!-->
<html lang="ja">
<!--<![endif]-->
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>IoT/M2M展へ「Future IoT」出展してきました！ | Future Tech Blog - フューチャーアーキテクト</title>

  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

  
  <meta name="description" content="&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3001;Future&amp;#x682A;&amp;#x5F0F;&amp;#x4F1A;&amp;#x793E;&amp;#x3001;IoT/DX&amp;#x30E6;&amp;#x30CB;&amp;#x30C3;&amp;#x30C8;&amp;#x306E;&amp;#x5343;&amp;#x8449;&amp;#x3067;&amp;#x3059;&amp;#x3002;IoT/DX&amp;#x30E6;&amp;#x30C">
<meta name="keywords" content="Conference,IoT">
<meta property="og:type" content="article">
<meta property="og:title" content="IoT&#x2F;M2M展へ「Future IoT」出展してきました！">
<meta property="og:url" content="https://future-architect.github.io/articles/20190509/index.html">
<meta property="og:site_name" content="Future Tech Blog - フューチャーアーキテクト">
<meta property="og:description" content="&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3001;Future&amp;#x682A;&amp;#x5F0F;&amp;#x4F1A;&amp;#x793E;&amp;#x3001;IoT/DX&amp;#x30E6;&amp;#x30CB;&amp;#x30C3;&amp;#x30C8;&amp;#x306E;&amp;#x5343;&amp;#x8449;&amp;#x3067;&amp;#x3059;&amp;#x3002;IoT/DX&amp;#x30E6;&amp;#x30C">
<meta property="og:locale" content="ja">
<meta property="og:image" content="https://future-architect.github.io/images/20190509/top.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190509/chirashi1.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190509/chirashi2.png">
<meta property="og:image" content="https://future-architect.github.io/images/20190509/desc.png">
<meta property="og:updated_time" content="2019-05-15T02:32:58.325Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="IoT&#x2F;M2M展へ「Future IoT」出展してきました！">
<meta name="twitter:description" content="&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3001;Future&amp;#x682A;&amp;#x5F0F;&amp;#x4F1A;&amp;#x793E;&amp;#x3001;IoT/DX&amp;#x30E6;&amp;#x30CB;&amp;#x30C3;&amp;#x30C8;&amp;#x306E;&amp;#x5343;&amp;#x8449;&amp;#x3067;&amp;#x3059;&amp;#x3002;IoT/DX&amp;#x30E6;&amp;#x30C">
<meta name="twitter:image" content="https://future-architect.github.io/images/20190509/top.jpg">
  
    <link rel="alternative" href="/atom.xml" title="Future Tech Blog - フューチャーアーキテクト" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  

  <meta content="IoT/M2M展へ「Future IoT」出展してきました！ | Future Tech Blog - フューチャーアーキテクト" name="description">
  <meta content="IoT/M2M展へ「Future IoT」出展してきました！,Future Tech Blog - フューチャーアーキテクト,フューチャーアーキテクト,Future Architect,フューチャー,Future,Tech Blog,技術ブログ,技術,ブログ" name="keywords">
  <meta content="Future Architect Consultant" name="author">

  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700|Audiowide|PT+Sans+Narrow|Source+Sans+Pro:200,300,400,600,700,900&amp;subset=all" rel="stylesheet" type="text/css">

  <!-- Global styles START -->
  <link rel="stylesheet" href="/metronic/assets/plugins/font-awesome/css/font-awesome.min.css">
  <link rel="stylesheet" href="/metronic/assets/plugins/bootstrap/css/bootstrap.min.css">
  <!-- Global styles END -->

  <!-- Theme styles START -->
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style-responsive.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/themes/custom.css">
  <link rel="stylesheet" href="/css/theme-styles.css">
  <!-- Theme styles END --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>
</html>
<body class="corporate">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- BEGIN HEADER -->
<div class="header">
	<div class="header-overlay">
		<!--<a class="site-logo" href="/" id="logo">Future Tech Blog - フューチャーアーキテクト</a>-->
		<div class="header-menu">
			<a class="site-logo" href="/">
				<img src="/metronic/assets/corporate/img/site_logo.png" alt="logo" class="logo-img">
			</a>
			<a href="javascript:void(0);" class="mobi-toggler"><i class="fa fa-bars"></i></a>
			<!-- BEGIN NAVIGATION -->
			<div class="header-navigation pull-right font-transform-inherit">
				<ul>
					
					<li class>
						<a href="/"><i class="fa fa-home"></i>Home</a>
					</li>
					
					<li class>
						<a href="/articles/"><i class="fa fa-newspaper-o"></i>Blog</a>
					</li>
					
					<li class>
						<a href="https://github.com/future-architect"><i class="fa fa-github"></i>GitHub</a>
					</li>
					
					<li class>
						<a href="http://qiita.com/organizations/future"><i class="fa fa-users"></i>Qiita</a>
					</li>
					
					<!-- BEGIN TOP SEARCH -->
					<li class="menu-search">
						<span class="sep"></span>
						<i class="fa fa-search search-btn"></i>
						<div class="search-box">
							<form action="#" class="googleSearch" onsubmit="googleSearch();">
								<div class="input-group">
									<input type="text" placeholder="Search" class="form-control">
									<span class="input-group-btn">
										<button class="btn btn-primary" type="submit">Search</button>
									</span>
								</div>
							</form>
						</div>
					</li>
					<!-- END TOP SEARCH -->
				</ul>
			</div>
		</div>
		<!-- END NAVIGATION -->
		<div class="header-title">Tech Blog</div>
        <div class="header-title-sub">フューチャーアーキテクト開発者ブログ</div>
	</div>
</div>
<!-- Header END -->

  <div class="container">
  <ul class="breadcrumb">
    <li><a href="/">Home</a></li>
    <li><a href="/articles/">Blog</a></li>
    <li class="active">Post</li>
  </ul>
  <section id="main">
    
    <h2 itemprop="name">
      <a class="article-title" href="/articles/20190509/">IoT/M2M展へ「Future IoT」出展してきました！</a>
    </h2>


    <div class="row">
<div class="col-md-9 col-sm-9 blog-posts">
<article id="post-20190509-iot-m2m" class="article article-type-post blog-item" itemscope itemprop="blogPost">
  <div class="article-meta">
  </div>
  <div class="article-inner">
    
    <header class="article-header">
      <ul class="blog-info">
	<li><i class="fa fa-user"></i> 千葉駿</li>
	<li><i class="fa fa-calendar"></i>
	  <time datetime="2019-05-09T01:00:00.000Z" itemprop="datePublished">2019/05/09</time>

	</li>

    <li class="hidden-xs"><i class="fa fa-tags"></i>
	  
  
    <a href="/tags/Conference/" title="Conference">Conference</a>,
  
    <a href="/tags/IoT/" title="IoT">IoT</a>
  


	</li>
      </ul>
      
  <div class="article-category">
    
    Category: 
    
    Categories:
    <a class="article-category-link" href="/categories/Culture/">Culture</a>
  </div>
  <br>


    </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x3053;&#x3093;&#x306B;&#x3061;&#x306F;&#x3001;Future&#x682A;&#x5F0F;&#x4F1A;&#x793E;&#x3001;IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x306E;&#x5343;&#x8449;&#x3067;&#x3059;&#x3002;<br>IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x3001;&#x6280;&#x8853;&#x5C55;&#x793A;&#x4F1A;&#x300C;<a href="https://spring.japan-it.jp/ja-jp/about/iot.html" target="_blank" rel="noopener">IoT/M2M EXPO 2019</a>&#x300D;&#x3078;&#x521D;&#x51FA;&#x5C55;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x306E;&#x3067;&#x3001;&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;&#x3084;&#x5C55;&#x793A;&#x7269;&#x3001;&#x51FA;&#x5C55;&#x306E;&#x624B;&#x5FDC;&#x3048;&#x306A;&#x3069;&#x3092;&#x5831;&#x544A;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><img src="/images/20190509/top.jpg" style="border:solid 1px #CFD8DC"></p>
<h2 id="&#x305D;&#x3082;&#x305D;&#x3082;IoT-DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x306F;"><a href="#&#x305D;&#x3082;&#x305D;&#x3082;IoT-DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x306F;" class="headerlink" title="&#x305D;&#x3082;&#x305D;&#x3082;IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x306F;"></a>&#x305D;&#x3082;&#x305D;&#x3082;IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x306F;</h2><p>Future&#x682A;&#x5F0F;&#x4F1A;&#x793E;&#x306F;IT&#x30B3;&#x30F3;&#x30B5;&#x30EB;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x3092;&#x751F;&#x696D;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x4F1A;&#x793E;&#x3067;&#x3059;&#x3002;<br>&#x305D;&#x306E;&#x4E2D;&#x3067;&#x3001;&#x30E2;&#x30D3;&#x30EA;&#x30C6;&#x30A3;&#x3084;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A1;&#x30AF;&#x30C8;&#x30EA;&#x30FC;&#x306A;&#x3069;IoT&#x3092;&#x4E2D;&#x5FC3;&#x306B;&#x6271;&#x3063;&#x3066;&#x3044;&#x308B;&#x30C1;&#x30FC;&#x30E0;&#x304C;&#x4ECA;&#x5E74;&#x304B;&#x3089;IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3068;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x4ECA;&#x5F8C;&#x306F;IoT&#x306B;&#x9650;&#x3089;&#x305A;&#x3001;DX&#xFF08;&#x30C7;&#x30B8;&#x30BF;&#x30EB;&#x30C8;&#x30E9;&#x30F3;&#x30B9;&#x30D5;&#x30A9;&#x30FC;&#x30E1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#xFF09;&#x5168;&#x822C;&#x3092;&#x6271;&#x3063;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3061;&#x306A;&#x307F;&#x306B;&#x3067;&#x3059;&#x304C;&#x3001;IoT/DX&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x306F;2019&#x5E74;1&#x6708;&#x306B;&#x540D;&#x79F0;&#x3092;&#x5909;&#x66F4;&#x3057;&#x305F;&#x3070;&#x304B;&#x308A;&#x306E;&#x65B0;&#x3057;&#x3044;&#x7D44;&#x7E54;&#x3067;&#x3059;&#x3002;&#x534A;&#x3070;&#x81EA;&#x79F0;&#x304B;&#x3089;&#x59CB;&#x307E;&#x3063;&#x305F;&#x90E8;&#x5206;&#x3082;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x6570;&#x30F6;&#x6708;&#x3082;&#x7D4C;&#x305A;&#x306B;&#x793E;&#x5185;&#x306B;&#x5E83;&#x304F;&#x6D78;&#x900F;&#x30FB;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>Future&#x306F;&#x30D5;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x304C;&#x8EFD;&#x3044;&#x4F01;&#x696D;&#x3067;&#x3001;&#x81EA;&#x767A;&#x7684;&#x306B;&#x7D50;&#x6210;&#x3055;&#x308C;&#x305F;&#x7D44;&#x7E54;&#x304C;&#x5F8C;&#x3005;&#x4F1A;&#x793E;&#x306B;&#x516C;&#x8A8D;&#x3055;&#x308C;&#x305F;&#x5B9F;&#x7E3E;&#x304C;&#x3044;&#x304F;&#x3064;&#x3082;&#x3042;&#x308A;&#x3001;&#x3053;&#x3046;&#x3044;&#x3046;&#x3068;&#x3053;&#x308D;&#x304C;&#x9762;&#x767D;&#x3044;&#x3068;&#x3053;&#x308D;&#x3060;&#x306A;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<h2 id="&#x4F55;&#x3092;&#x51FA;&#x5C55;&#x3057;&#x305F;&#x306E;&#x304B;"><a href="#&#x4F55;&#x3092;&#x51FA;&#x5C55;&#x3057;&#x305F;&#x306E;&#x304B;" class="headerlink" title="&#x4F55;&#x3092;&#x51FA;&#x5C55;&#x3057;&#x305F;&#x306E;&#x304B;"></a>&#x4F55;&#x3092;&#x51FA;&#x5C55;&#x3057;&#x305F;&#x306E;&#x304B;</h2><p>&#x4ECA;&#x56DE;&#x306E;IoT/M2M&#x5C55;&#x306F;&#x3001;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x4F1A;&#x793E;&#x306E;YDC&#x3055;&#x3093;&#x3068;&#x5171;&#x540C;&#x51FA;&#x5C55;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;<br>YDC&#x3055;&#x3093;&#x306F;&#x88FD;&#x9020;&#x73FE;&#x5834;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x6D3B;&#x7528;&#x3092;&#x652F;&#x3048;&#x308B;&#x30D7;&#x30ED;&#x30C0;&#x30AF;&#x30C8;&#x300C;<a href="https://www.ydc.co.jp/service/sonar/ydcsonar.html" target="_blank" rel="noopener">YDC SONAR&#xAE;</a>&#x300D;&#x3092;&#x51FA;&#x5C55;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x3055;&#x3066;Future&#x3067;&#x3059;&#x304C;&#x3001;&#x672C;&#x696D;&#x304C;IT&#x30B3;&#x30F3;&#x30B5;&#x30EB;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x306E;&#x305F;&#x3081;&#x7279;&#x5B9A;&#x306E;&#x81EA;&#x793E;&#x30D7;&#x30ED;&#x30C0;&#x30AF;&#x30C8;&#x3092;&#x6301;&#x3061;&#x307E;&#x305B;&#x3093;&#x3002;&#x305D;&#x3053;&#x3067;&#x79C1;&#x305F;&#x3061;&#x306F;&#x3001;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x30B3;&#x30F3;&#x30BB;&#x30D7;&#x30C8;&#x3084;&#x8003;&#x3048;&#x65B9;&#x3001;&#x305D;&#x308C;&#x306B;&#x57FA;&#x3065;&#x304D;&#x5B9F;&#x65BD;&#x3057;&#x3066;&#x304D;&#x305F;&#x4E8B;&#x4F8B;&#x3092;&#x3001;IoT&#x30B3;&#x30F3;&#x30B5;&#x30EB;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x300C;Future IoT&#x300D;&#x3068;&#x3057;&#x3066;&#x5C55;&#x793A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x30B3;&#x30F3;&#x30BB;&#x30D7;&#x30C8;&#x306F;&#x300C; <strong>&#x30C8;&#x30FC;&#x30BF;&#x30EB;&#x30C7;&#x30B6;&#x30A4;&#x30F3;</strong> &#x300D;&#x3067;&#x3059;&#x3002;</p>
<p>&#x300C;&#x4E16;&#x306E;&#x4E2D;&#x306B;&#x512A;&#x308C;&#x305F;&#x6280;&#x8853;&#x304C;&#x63C3;&#x3063;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x518D;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3060;&#x3051;&#x306E;PoC&#x3084;&#x3001;&#x5C0E;&#x5165;&#x3057;&#x3066;&#x6E80;&#x8DB3;&#x3057;&#x73FE;&#x5834;&#x3092;&#x5909;&#x3048;&#x306A;&#x3044;&#x500B;&#x5225;&#x6700;&#x9069;&#x306E;IoT&#x306F;&#x7D42;&#x308F;&#x308A;&#x306B;&#x3057;&#x3066;&#x3001;&#x5730;&#x306B;&#x8DB3;&#x3092;&#x3064;&#x3051;&#x305F;&#x3001;&#x5168;&#x4F53;&#x6700;&#x9069;&#x306E;&#x89B3;&#x70B9;&#x304B;&#x3089;&#x7D4C;&#x55B6;&#x3068;&#x73FE;&#x5834;&#x3092;&#x5909;&#x3048;&#x308B;IoT&#x5C0E;&#x5165;&#x3092;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x300D;&#x3068;&#x3044;&#x3046;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x3001;&#x7D4C;&#x55B6;&#x306B;&#x8FD1;&#x3044;&#x5C64;&#x3092;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x767A;&#x4FE1;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x306F;&#x5B9F;&#x969B;&#x306B;&#x63B2;&#x793A;&#x3057;&#x305F;&#x30DD;&#x30B9;&#x30BF;&#x30FC;&#x3067;&#x3059;&#x3002;<br>&#x6211;&#x3005;&#x304C;&#x76EE;&#x6307;&#x3059;&#x3079;&#x304D;&#x4E16;&#x754C;&#x89B3;&#x3092;&#x8868;&#x73FE;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x6D3B;&#x7528;&#x306E;&#x7BC4;&#x56F2;&#x3092;&#x793E;&#x5185;&#x306B;&#x7559;&#x307E;&#x3089;&#x305B;&#x305A;&#x3001;&#x793E;&#x5916;&#x3001;&#x3072;&#x3044;&#x3066;&#x306F;&#x696D;&#x754C;&#x3092;&#x8D85;&#x3048;&#x3066;&#x6D3B;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x3088;&#x308A;&#x5927;&#x304D;&#x306A;&#x30B7;&#x30CA;&#x30B8;&#x30FC;&#x3092;&#x751F;&#x3080;&#x793E;&#x4F1A;&#x3092;&#x8868;&#x73FE;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><img src="/images/20190509/chirashi1.jpg" style="border:solid 1px #CFD8DC" class="img-small-size"></p>
<p>&#x4EE5;&#x4E0B;&#x306E;3&#x679A;&#x306F;&#x3001;Future&#x3067;&#x6271;&#x3063;&#x3066;&#x304D;&#x305F;&#x6848;&#x4EF6;&#x306E;&#x4E8B;&#x4F8B;&#x7D39;&#x4ECB;&#x3067;&#x3059;&#x3002;&#x5185;&#x5BB9;&#x306F;&#x4E8B;&#x60C5;&#x306B;&#x3088;&#x308A;&#x62BD;&#x8C61;&#x7684;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x3053;&#x308C;&#x307E;&#x3067;&#x53D6;&#x308A;&#x7D44;&#x3093;&#x3067;&#x304D;&#x305F;&#x6848;&#x4EF6;&#x306E;&#x8003;&#x3048;&#x65B9;&#x3084;&#x6982;&#x5FF5;&#x3001;&#x9867;&#x5BA2;&#x306E;&#x76EE;&#x6307;&#x3059;&#x3079;&#x304D;&#x72B6;&#x614B;&#x3092;&#x8868;&#x73FE;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><img src="/images/20190509/chirashi2.png" style="border:solid 1px #CFD8DC"></p>
<h2 id="&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;&#x306F;&#x2026;"><a href="#&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;&#x306F;&#x2026;" class="headerlink" title="&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;&#x306F;&#x2026;"></a>&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;&#x306F;&#x2026;</h2><p>&#x7121;&#x4E8B;&#x3001;&#x76DB;&#x6CC1;&#x3067;&#x7D42;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3057;&#x305F;&#xFF01;!</p>
<p>&#x540D;&#x3060;&#x305F;&#x308B;&#x4F01;&#x696D;&#x306E;&#x7D4C;&#x55B6;&#x6226;&#x7565;&#x5BA4;&#x5BA4;&#x9577;&#x3084;ICT&#x63A8;&#x9032;&#x90E8;&#x90E8;&#x9577;&#x3001;&#x4EE3;&#x8868;&#x53D6;&#x7DE0;&#x5F79;&#x306A;&#x3069;&#x3001;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x3044;&#x305F;&#x7D4C;&#x55B6;&#x306B;&#x8FD1;&#x3044;&#x5C64;&#x306E;&#x65B9;&#x306B;&#x3082;&#x591A;&#x304F;&#x6765;&#x5834;&#x3057;&#x3066;&#x3044;&#x305F;&#x3060;&#x304D;&#x3001;<br>&#x300C;&#x6700;&#x65B0;&#x306E;IoT&#x6A5F;&#x5668;&#x3092;&#x5C0E;&#x5165;&#x3057;&#x3066;&#x307F;&#x305F;&#x304C;&#x73FE;&#x5834;&#x304C;&#x4F7F;&#x3044;&#x3053;&#x306A;&#x305B;&#x305A;&#x3001;&#x7D50;&#x5C40;&#x65E2;&#x5B58;&#x306E;&#x6A5F;&#x5668;&#x3092;&#x4F7F;&#x3044;&#x7D9A;&#x3051;&#x3066;&#x3057;&#x307E;&#x3063;&#x3066;&#x3044;&#x308B;&#x300D;<br>&#x300C;&#x4E0A;&#x304B;&#x3089;IoT&#x5C0E;&#x5165;&#x3092;&#x6307;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x3069;&#x3053;&#x304B;&#x3089;&#x624B;&#x3092;&#x3064;&#x3051;&#x3066;&#x3044;&#x3044;&#x306E;&#x304B;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x300D;<br>&#x300C;&#x591A;&#x304F;&#x306E;&#x696D;&#x614B;&#x306E;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x4F1A;&#x793E;&#x3092;&#x62B1;&#x3048;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x6A2A;&#x306E;&#x9023;&#x643A;&#x304C;&#x53D6;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x305F;&#x3081;&#x306B;&#x30B7;&#x30CA;&#x30B8;&#x30FC;&#x3092;&#x767A;&#x63EE;&#x3067;&#x304D;&#x3066;&#x3044;&#x306A;&#x3044;&#x300D;<br>&#x306A;&#x3069;&#x306A;&#x3069;&#x591A;&#x304F;&#x306E;&#x76F8;&#x8AC7;&#x3092;&#x3044;&#x305F;&#x3060;&#x304D;&#x307E;&#x3057;&#x305F;!</p>
<p>&#x73FE;&#x5728;&#x3001;&#x65B0;&#x898F;&#x6848;&#x4EF6;&#x3078;&#x7E4B;&#x3052;&#x308B;&#x3079;&#x304F;&#x5404;&#x4F01;&#x696D;&#x69D8;&#x3068;&#x500B;&#x5225;&#x306B;&#x3084;&#x308A;&#x53D6;&#x308A;&#x3055;&#x305B;&#x3066;&#x3044;&#x305F;&#x3060;&#x3044;&#x3066;&#x304A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p><img src="/images/20190509/desc.png" style="border:solid 1px #CFD8DC"></p>
<p>&#x6B63;&#x76F4;&#x51FA;&#x5C55;&#x524D;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30C0;&#x30AF;&#x30C8;&#x304C;&#x306A;&#x304F;&#x4ED6;&#x4F01;&#x696D;&#x3088;&#x308A;&#x6D3E;&#x624B;&#x3055;&#x3067;&#x898B;&#x52A3;&#x308A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4E0D;&#x5B89;&#x306B;&#x601D;&#x3046;&#x90E8;&#x5206;&#x3082;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x5F53;&#x65E5;&#x306B;&#x306F;&#x591A;&#x304F;&#x306E;&#x65B9;&#x306B;&#x6765;&#x5834;&#x3044;&#x305F;&#x3060;&#x304F;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;&#x4ECA;&#x56DE;&#x306E;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3067;&#x3001;&#x79C1;&#x305F;&#x3061;&#x304C;&#x767A;&#x4FE1;&#x3057;&#x305F;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3001;&#x63D0;&#x4F9B;&#x3067;&#x304D;&#x308B;&#x4FA1;&#x5024;&#x306F;&#x4E16;&#x306E;&#x4E2D;&#x304B;&#x3089;&#x9700;&#x8981;&#x304C;&#x3042;&#x308A;&#x3001;&#x9AD8;&#x3044;&#x8A34;&#x6C42;&#x529B;&#x3092;&#x6301;&#x3064;&#x3053;&#x3068;&#x3092;&#x518D;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;<br>&#x307E;&#x305F;&#x6280;&#x8853;&#x5C55;&#x793A;&#x4F1A;&#x306E;&#x5834;&#x306F;&#x3001;&#x3055;&#x307E;&#x3056;&#x307E;&#x306A;&#x696D;&#x614B;&#x306E;&#x65B9;&#x3068;&#x4EA4;&#x6D41;&#x3067;&#x304D;&#x308B;&#x3001;&#x65B0;&#x898F;&#x6848;&#x4EF6;&#x3078;&#x7E4B;&#x3052;&#x3089;&#x308C;&#x308B;&#x3001;&#x6700;&#x65B0;&#x6280;&#x8853;&#x306E;&#x60C5;&#x5831;&#x53CE;&#x96C6;&#x304C;&#x3067;&#x304D;&#x308B;&#x306A;&#x3069;&#x591A;&#x304F;&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;&#x304C;&#x3042;&#x308B;&#x305F;&#x3081;&#x3001;&#x4ECA;&#x5F8C;&#x3082;&#x7CBE;&#x529B;&#x7684;&#x306B;&#x51FA;&#x5C55;&#x3057;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#xFF01;</p>
<h2 id="&#x6700;&#x5F8C;&#x306B;"><a href="#&#x6700;&#x5F8C;&#x306B;" class="headerlink" title="&#x6700;&#x5F8C;&#x306B;"></a>&#x6700;&#x5F8C;&#x306B;</h2><p>Future&#x3067;&#x306F;IoT&#x306B;&#x7559;&#x307E;&#x3089;&#x305A;&#x3001;AI EXPO&#x3084;OSS&#x30B5;&#x30DF;&#x30C3;&#x30C8;&#x306A;&#x3069;&#x591A;&#x65B9;&#x9762;&#x3078;&#x51FA;&#x5C55;&#x3057;&#x3066;&#x304A;&#x308A;&#x307E;&#x3059;&#xFF01;<br>&#x3054;&#x8208;&#x5473;&#x306E;&#x3042;&#x308B;&#x65B9;&#x306F;&#x4EE5;&#x4E0B;Qiita Jobs&#x3082;&#x3054;&#x89A7;&#x304F;&#x3060;&#x3055;&#x3044;&#xFF01;</p>
<ul>
<li><a href="https://jobs.qiita.com/employers/future/development_teams/109" target="_blank" rel="noopener">IoT/DX</a></li>
<li><a href="https://jobs.qiita.com/employers/future/development_teams/57" target="_blank" rel="noopener">&#x30B3;&#x30A2;&#x30C6;&#x30AF;&#x30CE;&#x30ED;&#x30B8;&#x30FC;</a></li>
</ul>

      
    </div>
  </div>
    
  <!-- シェアボタン START -->
  <div class="social-area">
  <ul class="social-button">

      <!-- twitter -->
      <li class="sc-tw social-button-twitter">
          <a href="https://twitter.com/share" class="twitter-share-button" data-via="future_techblog" data-lang="ja" data-hashtags="future_architect">ツイート</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
      </li>
      
      <!-- Facebookいいね -->
      <li class="social-button-fb">
          <div id="fb-root"></div>
          <script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v2.8";
              fjs.parentNode.insertBefore(js, fjs);
            }(document, 'script', 'facebook-jssdk'));</script>
          <div class="fb-like" data-href="https://future-architect.github.io/articles/20190509/" data-layout="button_count" data-action="like" data-size="small" data-show-faces="true" data-share="true"></div>
      </li>

      <!-- はてなブックマーク -->
      <li class="social-button-hatebu"><a href="http://b.hatena.ne.jp/entry/https://future-architect.github.io/articles/20190509/" class="hatena-bookmark-button" data-hatena-bookmark-layout="standard-balloon" data-hatena-bookmark-lang="ja" title="このエントリーをはてなブックマークに追加"><img src="https://b.st-hatena.com/images/entry-button/button-only@2x.png" alt="このエントリーをはてなブックマークに追加" width="20" height="20" style="border: none;"></a><script type="text/javascript" src="https://b.st-hatena.com/js/bookmark_button.js" charset="utf-8" async="async"></script></li>

      <!-- pocket -->
      <li class="social-button-pocket"><a data-pocket-label="pocket" data-pocket-count="horizontal" class="pocket-btn" data-lang="en"></a>
          <script type="text/javascript">!function(d,i){if(!d.getElementById(i)){var j=d.createElement("script");j.id=i;j.src="https://widgets.getpocket.com/v1/j/btn.js?v=1";var w=d.getElementById(i);d.body.appendChild(j);}}(document,"pocket-btn-js");</script>
      </li>

  </ul>
  </div>
<!-- シェアボタン END -->


  
    
<nav id="article-nav">
  
    <a href="/articles/20190513/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          第1回PG Battle参戦記
        
      </div>
    </a>
  
  
    <a href="/articles/20190425/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Qiita Jobsを始めました</div>
    </a>
  
</nav>

  
  <br>
</article>

</div>
<div class="col-md-3 col-sm-3 blog-sidebar">
  <!-- CATEGORIES START -->
<h2 class="margin-top-30">Categories</h2>

<div class="widget-wrap">
  <div class="widget">
    <ul class="nav sidebar-categories margin-bottom-40">
      
	<li>
	  <a href="/categories/Culture/">Culture (21)</a>
	</li>
      
	<li>
	  <a href="/categories/IoT/">IoT (6)</a>
	</li>
      
	<li>
	  <a href="/categories/VR/">VR (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Security/">Security (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Design/">Design (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Programming/">Programming (8)</a>
	</li>
      
	<li>
	  <a href="/categories/Management/">Management (4)</a>
	</li>
      
	<li>
	  <a href="/categories/Infrastructure/">Infrastructure (12)</a>
	</li>
      
	<li>
	  <a href="/categories/DB/">DB (5)</a>
	</li>
      
	<li>
	  <a href="/categories/DataScience/">DataScience (14)</a>
	</li>
      
    </ul>
  </div>
</div>


<!-- CATEGORIES END -->

<!-- BEGIN FEATURED POSTS -->
<h2>Featured Posts</h2>
<div class="recent-news margin-bottom-10">
  
  
    
      
        <a href="https://future-architect.github.io/articles/20190625/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                Amazon Redshiftの仕様を調べてみた
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190620/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                RedmineからGoogle Hangouts Chat へ連携するプラグインを作成しました！
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190612/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                TypeScript教育用コンテンツ公開のお知らせ
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190610/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                ソースコードを綺麗にするためにまず心がけたい３点
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190604/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                OpenCensus(OpenTelemetry)とは
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
</div>
<!-- END FEATURED POSTS -->

<!-- START ADVENT CALENDAR -->
<div class="margin-bottom-20">
  <h2>Advent Calendar</h2>
  <div class="widget-wrap">
  <div class="widget">
    <ul class="nav">
      <li>
        <a href="http://qiita.com/advent-calendar/2018/future" target="_blank">2018年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2017/future" target="_blank">2017年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2016/future" target="_blank">2016年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2015/future" target="_blank">2015年</a>
      </li>
    </ul>
  </div>
</div>

</div>
<!-- END ADVENT CALENDAR -->


</div>
</div>

  </section>
</div>

    <!-- BEGIN PRE-FOOTER -->
    <div class="pre-footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN BOTTOM ABOUT BLOCK -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>About Us</h2>
            <p>経営とITをデザインする、フューチャーアーキテクトの技術ブログです。IoTやAI(MachineLearning)・Security・VR・Cloud・BigDataといった内容の記事を中心に、業務で利用する幅広い技術について紹介します。また、OSSへの貢献やカンファレンスなどへの登壇など、フューチャーへのエンジニア文化についてもドシドシ紹介していきますのでぜひウォッチ下さい！<br><br><a href="http://www.future.co.jp/">http://www.future.co.jp/</a></p>
          </div>
          <!-- END BOTTOM ABOUT BLOCK -->

          <!-- BEGIN BOTTOM CONTACTS -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>Contact</h2>
            <address class="margin-bottom-40">
              東京都品川区大崎1-2-2<br>
              アートヴィレッジ大崎セントラルタワー<br><br>
              Email: <a href="mailto:techblog@future.co.jp">techblog@future.co.jp</a><br>
            </address>
          </div>
          <!-- END BOTTOM CONTACTS -->

	
          <!-- BEGIN TWITTER BLOCK -->
    <div class="col-md-4 col-sm-6 pre-footer-col">

    <!-- Twitterフォローボタン -->
    <a href="https://twitter.com/future_techblog" class="twitter-follow-button" data-show-count="false" data-lang="ja">/future_techblogさんをフォロー</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>

	  <a data-tweet-limit="1" class="twitter-timeline" href="https://twitter.com/future_techblog" data-widget-id="732749663766372354">Tweets by @future_techblog</a>

	  <script>!function(d,s,id){var
	  js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+"://platform.twitter.com/widgets.js";fjs.parentNode.insertBefore(js,fjs);}}(document,"script","twitter-wjs");</script>

          </div>
          <!-- END TWITTER BLOCK -->
	
        </div>
      </div>
    </div>
    <!-- END PRE-FOOTER -->

    <!-- BEGIN FOOTER -->
    <div class="footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN COPYRIGHT -->
          <div class="col-md-6 col-sm-6 padding-top-10">
                  &copy; 2019 Future Tech Blog - フューチャーアーキテクト<br>
 <!-- <a href="javascript:;">Privacy Policy</a> | <a href="javascript:;">Terms of Service</a> -->
          </div>
          <!-- END COPYRIGHT -->
	  <!-- BEGIN SOCIAL -->
<div class="col-md-6 col-sm-6">
  <ul class="social-footer list-unstyled list-inline pull-right">
    
      
      <li><a href="https://github.com/future-architect"><i class="fa fa-github"></i></a></li>
      
  
      
      <li><a href="https://twitter.com/future_techblog"><i class="fa fa-twitter"></i></a></li>
      
  
      
      <li><a href="https://www.facebook.com/future.saiyo"><i class="fa fa-facebook"></i></a></li>
      
  
      
      <li>
        <a href="http://qiita.com/organizations/future">
            <i class="fa fa-pencil-square-o"></i>
        </a>
      </li>
      
  
      
      <li><a href="/atom.xml"><i class="fa fa-rss"></i></a></li>
      
  
  </ul>
</div>
<!-- END SOCIAL -->

        </div>
      </div>
    </div>
    <!-- END FOOTER -->

  <!-- BEGIN CORE PLUGINS (REQUIRED FOR ALL PAGES) -->
<!--[if lt IE 9]>
<script src="/metronic/assets/plugins/respond.min.js"></script>
<![endif]-->
<script src="/metronic/assets/plugins/jquery.min.js"></script>
<script src="/metronic/assets/plugins/jquery-migrate.min.js"></script>
<script src="/metronic/assets/plugins/bootstrap/js/bootstrap.min.js"></script>
<script src="/metronic/assets/corporate/scripts/back-to-top.js"></script>
<script src="/metronic/assets/corporate/scripts/layout.js"></script>
<script src="/js/script.js"></script>

<script type="text/javascript">
    jQuery(document).ready(function() {
        Layout.init();
        Layout.initTwitter();
        Layout.initFixHeaderWithPreHeader(); /* Switch On Header Fixing (only if you have pre-header) */
        Layout.initNavScrolling();
    });
</script>
<!-- END CORE PLUGINS -->
<!-- START INTEGRATIONS -->

<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74047147-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


<!-- END INTEGRATIONS --><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</body>
</html>
