<!DOCTYPE html>
<!--[if IE 8]> <html lang="ja" class="ie8 no-js"> <![endif]-->
<!--[if IE 9]> <html lang="ja" class="ie9 no-js"> <![endif]-->
<!--[if !IE]><!-->
<html lang="ja">
<!--<![endif]-->
<head><meta name="generator" content="Hexo 3.9.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>ビッグデータ対談でニコ生登壇しました | Future Tech Blog - フューチャーアーキテクト</title>

  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

  
  <meta name="description" content="&amp;#x80CC;&amp;#x666F; 2016/11/02(&amp;#x6C34;)&amp;#x306B;&amp;#x958B;&amp;#x50AC;&amp;#x3055;&amp;#x308C;&amp;#x305F;&amp;#x30A2;&amp;#x30AB;&amp;#x30EA;&amp;#x30AF;TechTalk&amp;#xFF08;vol.4&amp;#xFF1A;&amp;#x30D3;&amp;#x30C3;&amp;#x30B0;&amp;#x30C7;&amp;#x30FC;&amp;#x30BF;&amp;#xF">
<meta name="keywords" content="Conference">
<meta property="og:type" content="article">
<meta property="og:title" content="ビッグデータ対談でニコ生登壇しました">
<meta property="og:url" content="https://future-architect.github.io/articles/20161109/index.html">
<meta property="og:site_name" content="Future Tech Blog - フューチャーアーキテクト">
<meta property="og:description" content="&amp;#x80CC;&amp;#x666F; 2016/11/02(&amp;#x6C34;)&amp;#x306B;&amp;#x958B;&amp;#x50AC;&amp;#x3055;&amp;#x308C;&amp;#x305F;&amp;#x30A2;&amp;#x30AB;&amp;#x30EA;&amp;#x30AF;TechTalk&amp;#xFF08;vol.4&amp;#xFF1A;&amp;#x30D3;&amp;#x30C3;&amp;#x30B0;&amp;#x30C7;&amp;#x30FC;&amp;#x30BF;&amp;#xF">
<meta property="og:locale" content="ja">
<meta property="og:image" content="https://future-architect.github.io/images/20161109/photo_20161109_01.png">
<meta property="og:image" content="https://future-architect.github.io/images/20161109/photo_20161109_02.png">
<meta property="og:image" content="https://future-architect.github.io/images/20161109/photo_20161109_03.jpeg">
<meta property="og:updated_time" content="2019-06-07T00:33:56.976Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="ビッグデータ対談でニコ生登壇しました">
<meta name="twitter:description" content="&amp;#x80CC;&amp;#x666F; 2016/11/02(&amp;#x6C34;)&amp;#x306B;&amp;#x958B;&amp;#x50AC;&amp;#x3055;&amp;#x308C;&amp;#x305F;&amp;#x30A2;&amp;#x30AB;&amp;#x30EA;&amp;#x30AF;TechTalk&amp;#xFF08;vol.4&amp;#xFF1A;&amp;#x30D3;&amp;#x30C3;&amp;#x30B0;&amp;#x30C7;&amp;#x30FC;&amp;#x30BF;&amp;#xF">
<meta name="twitter:image" content="https://future-architect.github.io/images/20161109/photo_20161109_01.png">
  
    <link rel="alternative" href="/atom.xml" title="Future Tech Blog - フューチャーアーキテクト" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  

  <meta content="ビッグデータ対談でニコ生登壇しました | Future Tech Blog - フューチャーアーキテクト" name="description">
  <meta content="ビッグデータ対談でニコ生登壇しました,Future Tech Blog - フューチャーアーキテクト,フューチャーアーキテクト,Future Architect,フューチャー,Future,Tech Blog,技術ブログ,技術,ブログ" name="keywords">
  <meta content="Future Architect Consultant" name="author">

  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700|Audiowide|PT+Sans+Narrow|Source+Sans+Pro:200,300,400,600,700,900&amp;subset=all" rel="stylesheet" type="text/css">

  <!-- Global styles START -->
  <link rel="stylesheet" href="/metronic/assets/plugins/font-awesome/css/font-awesome.min.css">
  <link rel="stylesheet" href="/metronic/assets/plugins/bootstrap/css/bootstrap.min.css">
  <!-- Global styles END -->

  <!-- Theme styles START -->
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style-responsive.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/themes/custom.css">
  <link rel="stylesheet" href="/css/theme-styles.css">
  <!-- Theme styles END --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>
</html>
<body class="corporate">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- BEGIN HEADER -->
<div class="header">
	<div class="header-overlay">
		<!--<a class="site-logo" href="/" id="logo">Future Tech Blog - フューチャーアーキテクト</a>-->
		<div class="header-menu">
			<a class="site-logo" href="/">
				<img src="/metronic/assets/corporate/img/site_logo.png" alt="logo" class="logo-img">
			</a>
			<a href="javascript:void(0);" class="mobi-toggler"><i class="fa fa-bars"></i></a>
			<!-- BEGIN NAVIGATION -->
			<div class="header-navigation pull-right font-transform-inherit">
				<ul>
					
					<li class="">
						<a href="/"><i class="fa fa-home"></i>Home</a>
					</li>
					
					<li class="">
						<a href="/articles/"><i class="fa fa-newspaper-o"></i>Blog</a>
					</li>
					
					<li class="">
						<a href="https://github.com/future-architect"><i class="fa fa-github"></i>GitHub</a>
					</li>
					
					<li class="">
						<a href="http://qiita.com/organizations/future"><i class="fa fa-users"></i>Qiita</a>
					</li>
					
					<!-- BEGIN TOP SEARCH -->
					<li class="menu-search">
						<span class="sep"></span>
						<i class="fa fa-search search-btn"></i>
						<div class="search-box">
							<form action="#" class="googleSearch" onsubmit="googleSearch();">
								<div class="input-group">
									<input type="text" placeholder="Search" class="form-control">
									<span class="input-group-btn">
										<button class="btn btn-primary" type="submit">Search</button>
									</span>
								</div>
							</form>
						</div>
					</li>
					<!-- END TOP SEARCH -->
				</ul>
			</div>
		</div>
		<!-- END NAVIGATION -->
		<div class="header-title">Tech Blog</div>
        <div class="header-title-sub">フューチャーアーキテクト開発者ブログ</div>
	</div>
</div>
<!-- Header END -->

  <div class="container">
  <ul class="breadcrumb">
    <li><a href="/">Home</a></li>
    <li><a href="/articles/">Blog</a></li>
    <li class="active">Post</li>
  </ul>
  <section id="main">
    
    <h2 itemprop="name">
      <a class="article-title" href="/articles/20161109/">ビッグデータ対談でニコ生登壇しました</a>
    </h2>


    <div class="row">
<div class="col-md-9 col-sm-9 blog-posts">
<article id="post-20161109-niconico" class="article article-type-post blog-item" itemscope itemprop="blogPost">
  <div class="article-meta">
  </div>
  <div class="article-inner">
    
    <header class="article-header">
      <ul class="blog-info">
	<li><i class="fa fa-user"></i> 真野隼記</li>
	<li><i class="fa fa-calendar"></i>
	  <time datetime="2016-11-09T05:14:24.000Z" itemprop="datePublished">2016/11/09</time>

	</li>

    <li class="hidden-xs"><i class="fa fa-tags"></i>
	  
  
    <a href="/tags/Conference/" title="Conference">Conference</a>
  


	</li>
      </ul>
      
  <div class="article-category">
    
    Category: 
    
    Categories:
    <a class="article-category-link" href="/categories/Infrastructure/">Infrastructure</a>
  </div>
  <br>


    </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <img src="/images/20161109/photo_20161109_01.png">

<h1 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a><strong>&#x80CC;&#x666F;</strong></h1><ul>
<li>2016/11/02(&#x6C34;)&#x306B;&#x958B;&#x50AC;&#x3055;&#x308C;&#x305F;<a href="http://live.nicovideo.jp/watch/lv279990477" target="_blank" rel="noopener">&#x30A2;&#x30AB;&#x30EA;&#x30AF;TechTalk&#xFF08;vol.4&#xFF1A;&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#xFF09;</a>&#x306B;&#x5F0A;&#x793E;&#x306E;&#x30A4;&#x30F3;&#x30D5;&#x30E9;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;<a href="http://qiita.com/keigodasu" target="_blank" rel="noopener">@keigosuda</a> &#x304C;&#x51FA;&#x6F14;&#x81F4;&#x3057;&#x307E;&#x3057;&#x305F;</li>
<li>&#x5185;&#x5BB9;&#x304C;<a href="https://plaid.co.jp/" target="_blank" rel="noopener">&#x682A;&#x5F0F;&#x4F1A;&#x793E;&#x30D7;&#x30EC;&#x30A4;&#x30C9;</a>&#x3055;&#x3093;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30B5;&#x30A4;&#x30A8;&#x30F3;&#x30C6;&#x30A3;&#x30B9;&#x30C8;&#x3068;&#x5BFE;&#x8AC7;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x3001;&#x9762;&#x767D;&#x3044;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3060;&#x3063;&#x305F;&#x306E;&#x3067;&#x3053;&#x306E;&#x5834;&#x3092;&#x304A;&#x501F;&#x308A;&#x3057;&#x3066;&#x3054;&#x5831;&#x544A;&#x81F4;&#x3057;&#x307E;&#x3059;</li>
</ul>
<br>

<p><strong>&#x30A2;&#x30AB;&#x30EA;&#x30AF;TechTalk&#x3068;&#x306F;&#x2026;&#xFF1F;</strong></p>
<blockquote>
<p>&#x9031;&#x6BCE;&#x306B;&#x69D8;&#x3005;&#x306A;&#x6280;&#x8853;&#x30C8;&#x30D4;&#x30C3;&#x30AF;&#x3084;&#x696D;&#x754C;&#x3001;&#x8077;&#x7A2E;&#x306B;&#x3064;&#x3044;&#x3066;&#x30C6;&#x30FC;&#x30DE;&#x3092;&#x8A2D;&#x5B9A;&#x3057;&#x3001;&#x73FE;&#x5834;&#x3067;&#x50CD;&#x3044;&#x3066;&#x3044;&#x308B;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3055;&#x3093;&#x304B;&#x3089;&#x300C;&#x5B9F;&#x969B;&#x306E;&#x3068;&#x3053;&#x308D;&#x300D;&#x3092;&#x30C8;&#x30FC;&#x30AF;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x5F62;&#x5F0F;&#x3067;&#x805E;&#x3051;&#x308B;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
</blockquote>
<br>


<p><strong>&#x300C;vol4&#xFF1A;&#x30D3;&#x30C3;&#x30AF;&#x30C7;&#x30FC;&#x30BF;&#x300D;&#x306E;&#x30C6;&#x30FC;&#x30DE;&#x306B;&#x3064;&#x3044;&#x3066;</strong></p>
<blockquote>
<p>&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x3068;&#x306F;&#x306A;&#x3093;&#x3067;&#x3057;&#x3087;&#x3046;&#xFF1F;<br>&#x30D0;&#x30BA;&#x30EF;&#x30FC;&#x30C9;&#x5316;&#x3057;&#x3066;&#x6570;&#x5E74;&#x304C;&#x7D4C;&#x3061;&#x307E;&#x3059;&#x304C;&#x3001;&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x6F20;&#x7136;&#x3068;&#x300C;&#x5927;&#x91CF;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x300D;&#x3060;&#x3051;&#x3092;&#x6307;&#x3059;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x308B;&#x4EBA;&#x3082;&#x591A;&#x3044;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#x3002;<br>&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x306F;&#x5358;&#x7D14;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x91CF;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x7A2E;&#x985E;&#x306E;&#x591A;&#x69D8;&#x6027;&#x3084;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x5909;&#x5316;&#x3059;&#x308B;&#x983B;&#x5EA6;&#x306E;&#x9AD8;&#x3055;&#xFF08;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x6027;&#xFF09;&#x3082;&#x305D;&#x306E;&#x7279;&#x6027;&#x306E;1&#x3064;&#x3067;&#x3059;&#x3002;<br>&#x6642;&#x306B;&#x306F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x6271;&#x3046;&#x6280;&#x8853;&#x305D;&#x306E;&#x3082;&#x306E;&#x3084;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x30B5;&#x30A4;&#x30A8;&#x30F3;&#x30C6;&#x30A3;&#x30B9;&#x30C8;&#x3068;&#x3044;&#x3063;&#x305F;&#x5C02;&#x9580;&#x8077;&#x3001;&#x5C02;&#x9580;&#x7D44;&#x7E54;&#x306A;&#x3069;&#x3082;&#x542B;&#x3080;&#x5E83;&#x7FA9;&#x306A;&#x8A00;&#x8449;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x3053;&#x3068;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x305D;&#x3093;&#x306A;&#x3001;&#x300C;&#x306A;&#x3093;&#x3068;&#x306A;&#x304F;&#x3059;&#x3054;&#x3044;&#x611F;&#x3058;&#x306E;&#x3059;&#x308B;&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x300D;&#x306B;&#x3064;&#x3044;&#x3066;&#x4F01;&#x696D;&#x304C;&#x3069;&#x306E;&#x3088;&#x3046;&#x306B;&#x6D3B;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3092;&#x805E;&#x3044;&#x3066;&#x307F;&#x307E;&#x305B;&#x3093;&#x304B;&#xFF1F;</p>
</blockquote>
<p>&#x8A73;&#x7D30;&#x306F;<a href="https://acaric.jp/special/event/2016-acaric-techtalk" target="_blank" rel="noopener">&#x3053;&#x3061;&#x3089;</a>&#x3092;&#x53C2;&#x7167;&#x4E0B;&#x3055;&#x3044;&#x3002;</p>
<br>

<p>&#x591A;&#x304F;&#x306E;&#x5B66;&#x751F;&#x3055;&#x3093;&#x306B;&#x3068;&#x3063;&#x3066;&#x3001;&#x666E;&#x6BB5;&#x4E2D;&#x3005;&#x8A71;&#x3059;&#x6A5F;&#x4F1A;&#x304C;&#x7121;&#x3044;&#x3067;&#x3042;&#x308D;&#x3046;&#x793E;&#x4F1A;&#x4EBA;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x306E;&#x65B9;&#x3068;&#x30AB;&#x30B8;&#x30E5;&#x30A2;&#x30EB;&#x306B;&#x8A71;&#x305B;&#x308B;&#x3053;&#x3068;&#x304C;&#x918D;&#x9190;&#x5473;&#x306A;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306E;&#x3088;&#x3046;&#x3067;&#x3059;&#x3002;<br>&#x3068;&#x306F;&#x3044;&#x3048;&#x3001;&#x500B;&#x4EBA;&#x7684;&#x306B;&#x306F;&#x4F55;&#x3068;&#x8A00;&#x3063;&#x3066;&#x3082;<strong>&#x30CB;&#x30B3;&#x751F;&#x653E;&#x9001;</strong>&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x304C;&#x6700;&#x5927;&#x306E;&#x30A6;&#x30EA;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li><strong>&#x5BFE;&#x8AC7;&#x304C;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x306B;&#x30CB;&#x30B3;&#x751F;&#x653E;&#x6620;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#xFF01;</strong></li>
<li><strong>&#x5F53;&#x7136;&#x306A;&#x304C;&#x3089;&#x65E5;&#x672C;&#x4E2D;&#xFF08;&#x4E16;&#x754C;&#x4E2D;&#xFF09;&#x304B;&#x3089;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3067;&#x5373;&#x6642;&#x306B;&#x30D5;&#x30A3;&#x30FC;&#x30C9;&#x30D0;&#x30C3;&#x30AF;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;</strong></li>
</ul>
<p>&#x2026;&#x306F;&#x901A;&#x5E38;&#x306E;&#x5C31;&#x6D3B;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3067;&#x306F;&#x307E;&#x305A;&#x7121;&#x3044;&#x306E;&#x3067;&#x3001;&#x975E;&#x5E38;&#x306B;&#x8CB4;&#x91CD;&#x306A;&#x7D4C;&#x9A13;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<p>&#x307E;&#x3055;&#x304B;&#x540C;&#x50DA;&#x304C;&#x696D;&#x52D9;&#x6642;&#x9593;&#x4E2D;&#x306B;&#x30CB;&#x30B3;&#x751F;&#x653E;&#x9001;&#x3057;&#x3066;&#x3044;&#x308B;&#x98A8;&#x666F;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x51FA;&#x6765;&#x308B;&#x3068;&#x306F;&#x2026;&#x3001;&#x4E16;&#x306E;&#x4E2D;&#x4F55;&#x304C;&#x3042;&#x308B;&#x304B;&#x308F;&#x304B;&#x308A;&#x307E;&#x305B;&#x3093;&#x306D;&#x3002;<br>&#x3061;&#x306A;&#x307F;&#x306B;&#x3001;&#x753B;&#x50CF;&#x3067;&#x306F;&#x51C4;&#x304F;&#x697D;&#x3057;&#x305D;&#x3046;&#x3067;&#x3059;&#x304C;&#x5B9F;&#x306F;&#x76F8;&#x5F53;&#x7DCA;&#x5F35;&#x3057;&#x3066;&#x3044;&#x305F;&#x3068;&#x306E;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;</p>
<img src="/images/20161109/photo_20161109_02.png">


<h1 id="&#x767B;&#x58C7;&#x7D50;&#x679C;"><a href="#&#x767B;&#x58C7;&#x7D50;&#x679C;" class="headerlink" title="&#x767B;&#x58C7;&#x7D50;&#x679C;"></a><strong>&#x767B;&#x58C7;&#x7D50;&#x679C;</strong></h1><ul>
<li><p>&#x7D50;&#x679C;&#x7684;&#x306B;&#x306F;&#x5927;&#x597D;&#x8A55;&#x3060;&#x3063;&#x305F;&#x3088;&#x3046;&#x3067;&#x3001;&#x666E;&#x6BB5;&#x3088;&#x308A;&#x591A;&#x304F;&#x306E;&#x8996;&#x8074;&#x8005;&#x306E;&#x65B9;&#x306B;&#x898B;&#x3066;&#x9802;&#x3051;&#x3001;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3082;&#x591A;&#x304B;&#x3063;&#x305F;&#x305D;&#x3046;&#x3067;&#x3059;&#xFF01;</p>
<ul>
<li>&#x300C;&#x30A2;&#x30EB;&#x30B4;&#x30EA;&#x30BA;&#x30E0;&#x306E;&#x6C17;&#x6301;&#x3061;ww&#x300D;&#x3084;&#x300C;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x6C17;&#x6301;&#x3061;&#x306B;&#x306A;&#x308B;www&#x300D;&#x306A;&#x3069;&#x3001;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x96F0;&#x56F2;&#x6C17;&#x3067;&#x5BDF;&#x3059;&#x308B;&#x3053;&#x3068;&#x3057;&#x304B;&#x51FA;&#x6765;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;<a href="http://qiita.com/keigodasu" target="_blank" rel="noopener">@keigosuda</a>&#x6C0F;&#x306E;&#x30C8;&#x30FC;&#x30AF;&#x529B;&#x304C;&#x9AD8;&#x304B;&#x3063;&#x305F;&#x3053;&#x3068;&#x306F;&#x9593;&#x9055;&#x3044;&#x7121;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;&#x7B11;</li>
</ul>
</li>
<li><p>&#x7D42;&#x308F;&#x3063;&#x305F;&#x5F8C;&#x306B;&#x3001;&#x5BFE;&#x8AC7;&#x8005;&#x3067;&#x3042;&#x3063;&#x305F;&#x30D7;&#x30EC;&#x30A4;&#x30C9;&#x793E;&#x306E;&#x65B9;&#x3005;&#x3068;&#x3001;&#x4F1A;&#x5834;&#x306B;&#x6765;&#x3066;&#x3044;&#x305F;&#x3060;&#x3044;&#x305F;&#x5B66;&#x751F;&#x3055;&#x3093;&#x3068;&#x3082;&#x304A;&#x8A71;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<ul>
<li>&#x30D4;&#x30B6;&#x3092;&#x3064;&#x307E;&#x307F;&#x306A;&#x304C;&#x3089;&#x3001;&#x5168;&#x529B;&#x3067;&#x8CEA;&#x554F;&#x306B;&#x7B54;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x51FA;&#x6765;&#x305F;&#x306E;&#x3067;&#x304A;&#x4E92;&#x3044;&#x306B;&#x3068;&#x3063;&#x3066;&#x3082;&#x6709;&#x76CA;&#x306A;&#x6642;&#x9593;&#x304C;&#x904E;&#x3054;&#x305B;&#x305F;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;</li>
</ul>
</li>
</ul>
<h1 id="&#x8CEA;&#x554F;&#x56DE;&#x7B54;"><a href="#&#x8CEA;&#x554F;&#x56DE;&#x7B54;" class="headerlink" title="&#x8CEA;&#x554F;&#x56DE;&#x7B54;"></a><strong>&#x8CEA;&#x554F;&#x56DE;&#x7B54;</strong></h1><img src="/images/20161109/photo_20161109_03.jpeg">


<p>&#x3055;&#x3066;&#x3001;&#x30CB;&#x30B3;&#x751F;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3001;&#x5BFE;&#x8AC7;&#x4E2D;&#x306B;&#x3044;&#x304F;&#x3064;&#x304B;&#x8CEA;&#x554F;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x9802;&#x304D;&#x307E;&#x3057;&#x305F;&#x304C;&#x5168;&#x3066;&#x306B;&#x304A;&#x7B54;&#x3048;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x51FA;&#x6765;&#x307E;&#x305B;&#x3093;&#x3067;&#x3057;&#x305F;&#x3002;<br>&#x767B;&#x58C7;&#x8005;&#x306E;<a href="http://qiita.com/keigodasu" target="_blank" rel="noopener">@keigosuda</a>&#x306B;&#x304A;&#x9858;&#x3044;&#x3057;&#x3066;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x8CEA;&#x554F;&#x306B;&#x56DE;&#x7B54;&#x3057;&#x3066;&#x9802;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;<br>&#x5C11;&#x3057;&#x3067;&#x3082;&#x5B66;&#x751F;&#x306E;&#x7686;&#x3055;&#x307E;&#x306E;&#x304A;&#x5F79;&#x306B;&#x7ACB;&#x3066;&#x308C;&#x3070;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<table>
<thead>
<tr>
<th>#</th>
<th>&#x8CEA;&#x554F;&#x4E8B;&#x9805;</th>
<th>&#x56DE;&#x7B54;</th>
</tr>
</thead>
<tbody><tr>
<td>1</td>
<td>&#x4ED5;&#x4E8B;&#x306E;&#x3084;&#x308A;&#x304C;&#x3044;&#x3068;&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x95A2;&#x308F;&#x308B;&#x697D;&#x3057;&#x3055;&#x306F;&#xFF1F;</td>
<td>&#x3053;&#x3068;&#x30D3;&#x30C3;&#x30B0;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x6271;&#x3046;&#x4ED5;&#x4E8B;&#x306E;&#x697D;&#x3057;&#x3055;&#x30FB;&#x3084;&#x308A;&#x304C;&#x3044;&#x306F;&#x3001;&#x307E;&#x3055;&#x3057;&#x304F;&#x305D;&#x3046;&#x3044;&#x3063;&#x305F;&#x5DE8;&#x5927;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x3069;&#x3046;&#x6271;&#x3046;&#x304B;&#x3092;&#x8003;&#x3048;&#x3001;&#x5B9F;&#x88C5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;<br>&#x4F55;&#x3082;&#x8003;&#x3048;&#x305A;&#x300C;&#x52D5;&#x304F;&#x300D;&#x30A4;&#x30F3;&#x30D5;&#x30E9;&#x30FB;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x4F5C;&#x308B;&#x3060;&#x3051;&#x3067;&#x306F;&#x305D;&#x3046;&#x3044;&#x3063;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x634C;&#x304D;&#x5207;&#x308B;&#x3053;&#x3068;&#x306F;&#x51FA;&#x6765;&#x307E;&#x305B;&#x3093;&#x3002;<br>&#x3069;&#x3046;&#x51E6;&#x7406;&#x3092;&#x5206;&#x5272;&#x30FB;&#x7D71;&#x5408;&#x3059;&#x308B;&#x304B;&#x3001;&#x3069;&#x3046;&#x51E6;&#x7406;&#x3092;&#x30AA;&#x30D5;&#x30ED;&#x30FC;&#x30C9;&#x3055;&#x305B;&#x308B;&#x304B;&#x306A;&#x3069;&#x3042;&#x3089;&#x3086;&#x308B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x7684;&#x306A;&#x89B3;&#x70B9;&#x3067;&#x8003;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x6C42;&#x3081;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x81EA;&#x305A;&#x3068;&#x69D8;&#x3005;&#x306A;&#x3053;&#x3068;&#x3092;&#x52C9;&#x5F37;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x304F;&#x306A;&#x308B;&#x3057;&#x3001;&#x305D;&#x306E;&#x5206;&#x5E83;&#x7BC4;&#x56F2;&#x306A;&#x6280;&#x8853;&#x8981;&#x7D20;&#x304C;&#x8EAB;&#x306B;&#x7740;&#x3051;&#x3066;&#x3044;&#x3051;&#x308B;&#x3068;&#x3053;&#x308D;&#x3082;&#x9B45;&#x529B;&#x3067;&#x3059;&#x3002;</td>
</tr>
<tr>
<td>2</td>
<td>&#x65B0;&#x5352;&#x3067;&#x5165;&#x793E;&#x3057;&#x3066;&#x7814;&#x7A76;&#x3084;&#x958B;&#x767A;&#x306B;&#x643A;&#x308F;&#x308C;&#x308B;&#x306E;&#x304B;</td>
<td>&#x306F;&#x3044;&#x3001;&#x643A;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;&#x79C1;&#x306F;&#x3082;&#x3068;&#x3082;&#x3068;&#x6587;&#x5352;&#x3067;&#x60C5;&#x5831;&#x7CFB;&#x306F;&#x672A;&#x7D4C;&#x9A13;&#x3067;&#x5165;&#x793E;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x73FE;&#x5728;&#x306F;&#x7814;&#x7A76;&#x958B;&#x767A;&#x306E;&#x90E8;&#x9580;&#x3067;&#x3001;&#x65B0;&#x3057;&#x3044;&#x6280;&#x8853;&#x8981;&#x7D20;&#x3092;&#x5B9F;&#x52D9;&#x306B;&#x5C0E;&#x5165;&#x3057;&#x3066;&#x3044;&#x304F;&#x4ED5;&#x4E8B;&#x3092;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</td>
</tr>
<tr>
<td>3</td>
<td>&#x958B;&#x767A;&#x90E8;&#x9580;&#x3068;&#x904B;&#x55B6;&#x90E8;&#x9580;(&#x8981;&#x4EF6;&#x5B9A;&#x7FA9;&#x30FB;&#x8A2D;&#x8A08;)&#x306F;&#x540C;&#x3058;&#xFF1F;&#x5206;&#x3051;&#x3089;&#x308C;&#x3066;&#x308B;&#xFF1F;</td>
<td>&#x5225;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x3067;&#x3059;&#x3002;&#x9867;&#x5BA2;&#x3068;&#x306E;&#x8981;&#x4EF6;&#x5B9A;&#x7FA9;&#x304B;&#x3089;&#x3001;&#x8A2D;&#x8A08;&#x3001;&#x5B9F;&#x88C5;&#x3001;&#x904B;&#x7528;&#x307E;&#x3067;&#x3092;&#x540C;&#x3058;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x304C;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;</td>
</tr>
<tr>
<td>4</td>
<td>&#x30D3;&#x30C3;&#x30AF;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x643A;&#x308F;&#x308B;&#x4ED5;&#x4E8B;&#x306B;&#x5C31;&#x304F;&#x3072;&#x3068;&#x306B;&#x6C42;&#x3081;&#x3089;&#x308C;&#x308B;&#x7D20;&#x990A;&#x306F;&#x4F55;&#x3067;&#x3059;&#x304B;&#xFF1F;&#x3069;&#x3093;&#x306A;&#x5B66;&#x751F;&#x306B;&#x9762;&#x63A5;&#x306B;&#x6765;&#x3066;&#x307B;&#x3057;&#x3044;&#x3067;&#x3059;&#x304B;&#xFF1F;</td>
<td>&#x6280;&#x8853;&#x9762;&#x3067;&#x3044;&#x3046;&#x3068;&#x69D8;&#x3005;&#x306A;&#x6280;&#x8853;&#x8981;&#x7D20;&#x3078;&#x306E;&#x8208;&#x5473;&#x95A2;&#x5FC3;&#x304C;&#x6301;&#x3066;&#x308B;&#x4EBA;&#x304C;&#x5F37;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x306A;&#x306E;&#x3067;&#x7D4C;&#x9A13;&#x8005;&#x3067;&#x3042;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x5168;&#x304F;&#x306A;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</td>
</tr>
<tr>
<td>5</td>
<td>&#x4ED5;&#x4E8B;&#x4E2D;&#x306B;&#x97F3;&#x697D;&#x304D;&#x304D;&#x306A;&#x304C;&#x3089;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x304B;&#x3044;&#x3066;&#x308B;&#x4EBA;&#x304C;&#x5C45;&#x305F;&#x3089;&#x6012;&#x308B;&#xFF1F;</td>
<td>&#x4ED6;&#x306E;&#x4F1A;&#x793E;&#x306F;&#x77E5;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x4ED5;&#x4E8B;&#x3092;&#x3061;&#x3083;&#x3093;&#x3068;&#x3084;&#x3063;&#x3066;&#x3044;&#x308C;&#x3070;&#x6012;&#x3089;&#x308C;&#x307E;&#x305B;&#x3093;&#x7B11;<br>&#x79C1;&#x306F;&#x30D8;&#x30C3;&#x30C9;&#x30DB;&#x30F3;&#x7740;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x6642;&#x9593;&#x306E;&#x65B9;&#x304C;&#x306F;&#x308B;&#x304B;&#x306B;&#x9577;&#x3044;&#x3067;&#x3059;&#x3002;</td>
</tr>
</tbody></table>
<h1 id="&#x6700;&#x5F8C;&#x306B;"><a href="#&#x6700;&#x5F8C;&#x306B;" class="headerlink" title="&#x6700;&#x5F8C;&#x306B;"></a><strong>&#x6700;&#x5F8C;&#x306B;</strong></h1><ul>
<li>&#x5F0A;&#x793E;&#x3067;&#x306F;&#x30A2;&#x30AB;&#x30EA;&#x30AF;TechTalk&#x306E;&#x3088;&#x3046;&#x306A;&#x3001;<strong>&#x30AA;&#x30FC;&#x30D7;&#x30F3;</strong>&#x3067;<strong>&#x30B9;&#x30D4;&#x30FC;&#x30C9;&#x611F;</strong>&#x304C;&#x3042;&#x308A;&#x3001;<strong>&#x697D;&#x3057;&#x305D;&#x3046;</strong>&#x306A;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306B;&#x30C9;&#x30F3;&#x30C9;&#x30F3;&#x53C2;&#x52A0;&#x3057;&#x3001;&#x5B66;&#x751F;&#x306E;&#x7686;&#x3055;&#x307E;&#x306B;&#x6709;&#x7528;&#x3060;&#x3068;&#x611F;&#x3058;&#x3066;&#x9802;&#x3051;&#x308B;&#x3088;&#x3046;&#x306A;&#x60C5;&#x5831;&#x3092;&#x767A;&#x4FE1;&#x3057;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x3068;&#x8003;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#xFF01;</li>
<li>&#x6B21;&#x56DE;&#x306F;&#x30D3;&#x30C3;&#x30AF;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x9650;&#x3089;&#x305A;&#x5225;&#x306E;&#x30C6;&#x30FC;&#x30DE;&#x3067;&#x3082;&#x767A;&#x4FE1;&#x51FA;&#x6765;&#x308C;&#x3070;&#x3068;&#x8003;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x305C;&#x3072;&#x30A6;&#x30A9;&#x30C3;&#x30C1;&#x3057;&#x3066;&#x9802;&#x3051;&#x308C;&#x3070;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#xFF01;</li>
</ul>

      
    </div>
  </div>
    
  <!-- シェアボタン START -->
  <div class="social-area">
  <ul class="social-button">

      <!-- twitter -->
      <li class="sc-tw social-button-twitter">
          <a href="https://twitter.com/share" class="twitter-share-button" data-via="future_techblog" data-lang="ja" data-hashtags="future_architect">ツイート</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
      </li>
      
      <!-- Facebookいいね -->
      <li class="social-button-fb">
          <div id="fb-root"></div>
          <script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v2.8";
              fjs.parentNode.insertBefore(js, fjs);
            }(document, 'script', 'facebook-jssdk'));</script>
          <div class="fb-like" data-href="https://future-architect.github.io/articles/20161109/" data-layout="button_count" data-action="like" data-size="small" data-show-faces="true" data-share="true"></div>
      </li>

      <!-- はてなブックマーク -->
      <li class="social-button-hatebu"><a href="http://b.hatena.ne.jp/entry/https://future-architect.github.io/articles/20161109/" class="hatena-bookmark-button" data-hatena-bookmark-layout="standard-balloon" data-hatena-bookmark-lang="ja" title="このエントリーをはてなブックマークに追加"><img src="https://b.st-hatena.com/images/entry-button/button-only@2x.png" alt="このエントリーをはてなブックマークに追加" width="20" height="20" style="border: none;" /></a><script type="text/javascript" src="https://b.st-hatena.com/js/bookmark_button.js" charset="utf-8" async="async"></script></li>

      <!-- pocket -->
      <li class="social-button-pocket"><a data-pocket-label="pocket" data-pocket-count="horizontal" class="pocket-btn" data-lang="en"></a>
          <script type="text/javascript">!function(d,i){if(!d.getElementById(i)){var j=d.createElement("script");j.id=i;j.src="https://widgets.getpocket.com/v1/j/btn.js?v=1";var w=d.getElementById(i);d.body.appendChild(j);}}(document,"pocket-btn-js");</script>
      </li>

  </ul>
  </div>
<!-- シェアボタン END -->


  
    
<nav id="article-nav">
  
    <a href="/articles/20161209/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          たくさんあって混乱しがちなIoT関連の団体とOSSをまとめました
        
      </div>
    </a>
  
  
    <a href="/articles/20161031/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">SQL実行時のブルームフィルタ(Bloom Filter)アルゴリズム</div>
    </a>
  
</nav>

  
  <br>
</article>

</div>
<div class="col-md-3 col-sm-3 blog-sidebar">
  <!-- CATEGORIES START -->
<h2 class="margin-top-30">Categories</h2>

<div class="widget-wrap">
  <div class="widget">
    <ul class="nav sidebar-categories margin-bottom-40">
      
	<li>
	  <a href="/categories/Culture/">Culture (21)</a>
	</li>
      
	<li>
	  <a href="/categories/IoT/">IoT (6)</a>
	</li>
      
	<li>
	  <a href="/categories/VR/">VR (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Security/">Security (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Programming/">Programming (8)</a>
	</li>
      
	<li>
	  <a href="/categories/Design/">Design (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Management/">Management (5)</a>
	</li>
      
	<li>
	  <a href="/categories/DB/">DB (5)</a>
	</li>
      
	<li>
	  <a href="/categories/Infrastructure/">Infrastructure (13)</a>
	</li>
      
	<li>
	  <a href="/categories/DataScience/">DataScience (15)</a>
	</li>
      
    </ul>
  </div>
</div>


<!-- CATEGORIES END -->

<!-- BEGIN FEATURED POSTS -->
<h2>Featured Posts</h2>
<div class="recent-news margin-bottom-10">
  
  
    
      
        <a href="https://future-architect.github.io/articles/20190625/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                Amazon Redshiftの仕様を調べてみた
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190513/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                第1回PG Battle参戦記
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190703/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                マネージャーがうれしいRedmineデータのグラフ表示方法を公開します！！（Metabase編） 
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190702/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                AWS Datalake Hands-on(2019 May)メモ
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190627/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                人工知能学会（JSAI2019） 参加報告
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
</div>
<!-- END FEATURED POSTS -->

<!-- START ADVENT CALENDAR -->
<div class="margin-bottom-20">
  <h2>Advent Calendar</h2>
  <div class="widget-wrap">
  <div class="widget">
    <ul class="nav">
      <li>
        <a href="http://qiita.com/advent-calendar/2018/future" target="_blank">2018年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2017/future" target="_blank">2017年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2016/future" target="_blank">2016年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2015/future" target="_blank">2015年</a>
      </li>
    </ul>
  </div>
</div>

</div>
<!-- END ADVENT CALENDAR -->


</div>
</div>

  </section>
</div>

    <!-- BEGIN PRE-FOOTER -->
    <div class="pre-footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN BOTTOM ABOUT BLOCK -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>About Us</h2>
            <p>経営とITをデザインする、フューチャーアーキテクトの技術ブログです。IoTやAI(MachineLearning)・Security・VR・Cloud・BigDataといった内容の記事を中心に、業務で利用する幅広い技術について紹介します。また、OSSへの貢献やカンファレンスなどへの登壇など、フューチャーへのエンジニア文化についてもドシドシ紹介していきますのでぜひウォッチ下さい！<br /><br /><a href="http://www.future.co.jp/">http://www.future.co.jp/</a></p>
          </div>
          <!-- END BOTTOM ABOUT BLOCK -->

          <!-- BEGIN BOTTOM CONTACTS -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>Contact</h2>
            <address class="margin-bottom-40">
              東京都品川区大崎1-2-2<br>
              アートヴィレッジ大崎セントラルタワー<br><br>
              Email: <a href="mailto:techblog@future.co.jp">techblog@future.co.jp</a><br>
            </address>
          </div>
          <!-- END BOTTOM CONTACTS -->

	
          <!-- BEGIN TWITTER BLOCK -->
    <div class="col-md-4 col-sm-6 pre-footer-col">

    <!-- Twitterフォローボタン -->
    <a href="https://twitter.com/future_techblog" class="twitter-follow-button" data-show-count="false" data-lang="ja">/future_techblogさんをフォロー</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>

	  <a data-tweet-limit="1" class="twitter-timeline"
	  href="https://twitter.com/future_techblog"
	  data-widget-id="732749663766372354">Tweets by @future_techblog</a>

	  <script>!function(d,s,id){var
	  js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+"://platform.twitter.com/widgets.js";fjs.parentNode.insertBefore(js,fjs);}}(document,"script","twitter-wjs");</script>

          </div>
          <!-- END TWITTER BLOCK -->
	
        </div>
      </div>
    </div>
    <!-- END PRE-FOOTER -->

    <!-- BEGIN FOOTER -->
    <div class="footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN COPYRIGHT -->
          <div class="col-md-6 col-sm-6 padding-top-10">
                  &copy; 2019 Future Tech Blog - フューチャーアーキテクト<br>
 <!-- <a href="javascript:;">Privacy Policy</a> | <a href="javascript:;">Terms of Service</a> -->
          </div>
          <!-- END COPYRIGHT -->
	  <!-- BEGIN SOCIAL -->
<div class="col-md-6 col-sm-6">
  <ul class="social-footer list-unstyled list-inline pull-right">
    
      
      <li><a href="https://github.com/future-architect"><i class="fa fa-github"></i></a></li>
      
  
      
      <li><a href="https://twitter.com/future_techblog"><i class="fa fa-twitter"></i></a></li>
      
  
      
      <li><a href="https://www.facebook.com/future.saiyo"><i class="fa fa-facebook"></i></a></li>
      
  
      
      <li>
        <a href="http://qiita.com/organizations/future">
            <i class="fa fa-pencil-square-o"></i>
        </a>
      </li>
      
  
      
      <li><a href="/atom.xml"><i class="fa fa-rss"></i></a></li>
      
  
  </ul>
</div>
<!-- END SOCIAL -->

        </div>
      </div>
    </div>
    <!-- END FOOTER -->

  <!-- BEGIN CORE PLUGINS (REQUIRED FOR ALL PAGES) -->
<!--[if lt IE 9]>
<script src="/metronic/assets/plugins/respond.min.js"></script>
<![endif]-->
<script src="/metronic/assets/plugins/jquery.min.js"></script>
<script src="/metronic/assets/plugins/jquery-migrate.min.js"></script>
<script src="/metronic/assets/plugins/bootstrap/js/bootstrap.min.js"></script>
<script src="/metronic/assets/corporate/scripts/back-to-top.js"></script>
<script src="/metronic/assets/corporate/scripts/layout.js"></script>
<script src="/js/script.js"></script>

<script type="text/javascript">
    jQuery(document).ready(function() {
        Layout.init();
        Layout.initTwitter();
        Layout.initFixHeaderWithPreHeader(); /* Switch On Header Fixing (only if you have pre-header) */
        Layout.initNavScrolling();
    });
</script>
<!-- END CORE PLUGINS -->
<!-- START INTEGRATIONS -->

<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74047147-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


<!-- END INTEGRATIONS --><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</body>
</html>
