<!DOCTYPE html>
<!--[if IE 8]> <html lang="ja" class="ie8 no-js"> <![endif]-->
<!--[if IE 9]> <html lang="ja" class="ie9 no-js"> <![endif]-->
<!--[if !IE]><!-->
<html lang="ja">
<!--<![endif]-->
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>人工知能学会（JSAI2018）参加報告 | Future Tech Blog - フューチャーアーキテクト</title>

  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

  
  <meta name="description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3002;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x5C0F;&amp;#x6C60;&amp;#x3067;&amp;#x3059;&amp;#x3002;&amp;#x524D;&amp;#x56DE;">
<meta name="keywords" content="MachineLearning">
<meta property="og:type" content="article">
<meta property="og:title" content="人工知能学会（JSAI2018）参加報告">
<meta property="og:url" content="https://future-architect.github.io/articles/20180723/index.html">
<meta property="og:site_name" content="Future Tech Blog - フューチャーアーキテクト">
<meta property="og:description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3002;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x5C0F;&amp;#x6C60;&amp;#x3067;&amp;#x3059;&amp;#x3002;&amp;#x524D;&amp;#x56DE;">
<meta property="og:locale" content="ja">
<meta property="og:image" content="https://future-architect.github.io/images/20180723/photo_20180723_01.png">
<meta property="og:image" content="https://future-architect.github.io/images/20180723/photo_20180723_02.png">
<meta property="og:image" content="https://future-architect.github.io/images/20180723/photo_20180723_03.png">
<meta property="og:image" content="https://future-architect.github.io/images/20180723/photo_20180723_04.jpeg">
<meta property="og:updated_time" content="2019-06-07T00:35:24.453Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人工知能学会（JSAI2018）参加報告">
<meta name="twitter:description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#x3002;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x5C0F;&amp;#x6C60;&amp;#x3067;&amp;#x3059;&amp;#x3002;&amp;#x524D;&amp;#x56DE;">
<meta name="twitter:image" content="https://future-architect.github.io/images/20180723/photo_20180723_01.png">
  
    <link rel="alternative" href="/atom.xml" title="Future Tech Blog - フューチャーアーキテクト" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  

  <meta content="人工知能学会（JSAI2018）参加報告 | Future Tech Blog - フューチャーアーキテクト" name="description">
  <meta content="人工知能学会（JSAI2018）参加報告,Future Tech Blog - フューチャーアーキテクト,フューチャーアーキテクト,Future Architect,フューチャー,Future,Tech Blog,技術ブログ,技術,ブログ" name="keywords">
  <meta content="Future Architect Consultant" name="author">

  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700|Audiowide|PT+Sans+Narrow|Source+Sans+Pro:200,300,400,600,700,900&amp;subset=all" rel="stylesheet" type="text/css">

  <!-- Global styles START -->
  <link rel="stylesheet" href="/metronic/assets/plugins/font-awesome/css/font-awesome.min.css">
  <link rel="stylesheet" href="/metronic/assets/plugins/bootstrap/css/bootstrap.min.css">
  <!-- Global styles END -->

  <!-- Theme styles START -->
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style-responsive.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/themes/custom.css">
  <link rel="stylesheet" href="/css/theme-styles.css">
  <!-- Theme styles END --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>
</html>
<body class="corporate">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- BEGIN HEADER -->
<div class="header">
	<div class="header-overlay">
		<!--<a class="site-logo" href="/" id="logo">Future Tech Blog - フューチャーアーキテクト</a>-->
		<div class="header-menu">
			<a class="site-logo" href="/">
				<img src="/metronic/assets/corporate/img/site_logo.png" alt="logo" class="logo-img">
			</a>
			<a href="javascript:void(0);" class="mobi-toggler"><i class="fa fa-bars"></i></a>
			<!-- BEGIN NAVIGATION -->
			<div class="header-navigation pull-right font-transform-inherit">
				<ul>
					
					<li class>
						<a href="/"><i class="fa fa-home"></i>Home</a>
					</li>
					
					<li class>
						<a href="/articles/"><i class="fa fa-newspaper-o"></i>Blog</a>
					</li>
					
					<li class>
						<a href="https://github.com/future-architect"><i class="fa fa-github"></i>GitHub</a>
					</li>
					
					<li class>
						<a href="http://qiita.com/organizations/future"><i class="fa fa-users"></i>Qiita</a>
					</li>
					
					<!-- BEGIN TOP SEARCH -->
					<li class="menu-search">
						<span class="sep"></span>
						<i class="fa fa-search search-btn"></i>
						<div class="search-box">
							<form action="#" class="googleSearch" onsubmit="googleSearch();">
								<div class="input-group">
									<input type="text" placeholder="Search" class="form-control">
									<span class="input-group-btn">
										<button class="btn btn-primary" type="submit">Search</button>
									</span>
								</div>
							</form>
						</div>
					</li>
					<!-- END TOP SEARCH -->
				</ul>
			</div>
		</div>
		<!-- END NAVIGATION -->
		<div class="header-title">Tech Blog</div>
        <div class="header-title-sub">フューチャーアーキテクト開発者ブログ</div>
	</div>
</div>
<!-- Header END -->

  <div class="container">
  <ul class="breadcrumb">
    <li><a href="/">Home</a></li>
    <li><a href="/articles/">Blog</a></li>
    <li class="active">Post</li>
  </ul>
  <section id="main">
    
    <h2 itemprop="name">
      <a class="article-title" href="/articles/20180723/">人工知能学会（JSAI2018）参加報告</a>
    </h2>


    <div class="row">
<div class="col-md-9 col-sm-9 blog-posts">
<article id="post-20180723-jsai2018" class="article article-type-post blog-item" itemscope itemprop="blogPost">
  <div class="article-meta">
  </div>
  <div class="article-inner">
    
    <header class="article-header">
      <ul class="blog-info">
	<li><i class="fa fa-user"></i> 小池優希</li>
	<li><i class="fa fa-calendar"></i>
	  <time datetime="2018-07-23T04:56:36.000Z" itemprop="datePublished">2018/07/23</time>

	</li>

    <li class="hidden-xs"><i class="fa fa-tags"></i>
	  
  
    <a href="/tags/MachineLearning/" title="MachineLearning">MachineLearning</a>
  


	</li>
      </ul>
      
  <div class="article-category">
    
    Category: 
    
    Categories:
    <a class="article-category-link" href="/categories/DataScience/">DataScience</a>
  </div>
  <br>


    </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="&#x306F;&#x3058;&#x3081;&#x306B;"><a href="#&#x306F;&#x3058;&#x3081;&#x306B;" class="headerlink" title="&#x306F;&#x3058;&#x3081;&#x306B;"></a>&#x306F;&#x3058;&#x3081;&#x306B;</h2><p>&#x307F;&#x306A;&#x3055;&#x3093;&#x3053;&#x3093;&#x306B;&#x3061;&#x306F;&#x3002;SAIG(Strategic AI Group)&#x306E;&#x5C0F;&#x6C60;&#x3067;&#x3059;&#x3002;<br>&#x524D;&#x56DE;&#x306E;<a href="https://future-architect.github.io/articles/20180222/">NIPS2017 LT&#x5831;&#x544A;</a>&#x4EE5;&#x6765;&#x306E;&#x767B;&#x5834;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x4ECA;&#x56DE;&#x306F;&#x3001;2018&#x5E74;6&#x6708;5&#x65E5;(&#x706B;)&#x301C;6&#x6708;8&#x65E5;(&#x91D1;)&#x306B;&#x884C;&#x308F;&#x308C;&#x307E;&#x3057;&#x305F;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#xFF08;JSAI2018&#xFF09;&#x306B;SAIG&#x3067;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x6765;&#x307E;&#x3057;&#x305F;&#x306E;&#x3067;&#x3001;&#x3054;&#x5831;&#x544A;&#x3092;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;&#x30D5;&#x30E5;&#x30FC;&#x30C1;&#x30E3;&#x30FC;&#x3067;&#x306F;&#x3001;&#x30D7;&#x30E9;&#x30C1;&#x30CA;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x3068;&#x3057;&#x3066;&#x306E;&#x30D6;&#x30FC;&#x30B9;&#x51FA;&#x5C55;&#x30FB;&#x53E3;&#x982D;&#x767A;&#x8868;&#x30FB;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;&#x3092;&#x884C;&#x3063;&#x3066;&#x307E;&#x3044;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><img src="/images/20180723/photo_20180723_01.png" class="img-middle-size"></p>
<p>&#x5834;&#x6240;&#x306F;&#x9E7F;&#x5150;&#x5CF6;&#x770C;&#x57CE;&#x5C71;&#x30DB;&#x30C6;&#x30EB;&#x9E7F;&#x5150;&#x5CF6;&#x306B;&#x3066;&#x958B;&#x50AC;&#x3055;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;&#x9E7F;&#x5150;&#x5CF6;&#x7A7A;&#x6E2F;&#x304B;&#x3089;&#x9E7F;&#x5150;&#x5CF6;&#x4E2D;&#x592E;&#x99C5;&#x307E;&#x3067;&#x30D0;&#x30B9;&#x3067;1&#x6642;&#x9593;&#x304F;&#x3089;&#x3044;&#x3001;&#x9E7F;&#x5150;&#x5CF6;&#x4E2D;&#x592E;&#x99C5;&#x304B;&#x3089;&#x57CE;&#x5C71;&#x30DB;&#x30C6;&#x30EB;&#x9E7F;&#x5150;&#x5CF6;&#x307E;&#x3067;30&#x5206;&#x7A0B;&#x304B;&#x304B;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x4F1A;&#x5834;&#x306F;&#x5C71;&#x306E;&#x4E0A;&#x306B;&#x3042;&#x308A;&#x79FB;&#x52D5;&#x304C;&#x5927;&#x5909;&#x3067;&#x3057;&#x305F;&#x304C;&#x3001;&#x666F;&#x89B3;&#x304C;&#x826F;&#x304F;&#x3001;&#x9AD8;&#x7D1A;&#x611F;&#x6EA2;&#x308C;&#x308B;&#x30DB;&#x30C6;&#x30EB;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<h2 id="&#x53E3;&#x982D;&#x767A;&#x8868;"><a href="#&#x53E3;&#x982D;&#x767A;&#x8868;" class="headerlink" title="&#x53E3;&#x982D;&#x767A;&#x8868;"></a>&#x53E3;&#x982D;&#x767A;&#x8868;</h2><p>SAIG&#x306E;&#x8C9E;&#x5149;&#x4E5D;&#x6708;&#x304C;AI&#x5FDC;&#x7528;-&#x7523;&#x696D;&#x5FDC;&#x7528;(3)&#x306B;&#x3066;&#x3001;&#x300C;<a href="https://confit.atlas.jp/guide/event/jsai2018/subject/2M2-04/detail?lang=ja" target="_blank" rel="noopener">&#x534A;&#x6559;&#x5E2B;&#x6709;&#x308A;&#x30B0;&#x30E9;&#x30D5;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x7528;&#x3044;&#x305F;CRUD&#x95A2;&#x4FC2;&#x306B;&#x57FA;&#x3065;&#x304F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x79FB;&#x884C;&#x5358;&#x4F4D;&#x306E;&#x6700;&#x9069;&#x5316;</a>&#x300D;&#x3068;&#x984C;&#x3057;&#x3066;&#x767A;&#x8868;&#x3057;&#x3066;&#x307E;&#x3044;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<h2 id="&#x53E3;&#x982D;&#x767A;&#x8868;&#x306E;&#x5185;&#x5BB9;"><a href="#&#x53E3;&#x982D;&#x767A;&#x8868;&#x306E;&#x5185;&#x5BB9;" class="headerlink" title="&#x53E3;&#x982D;&#x767A;&#x8868;&#x306E;&#x5185;&#x5BB9;"></a>&#x53E3;&#x982D;&#x767A;&#x8868;&#x306E;&#x5185;&#x5BB9;</h2><p>&#x5927;&#x898F;&#x6A21;&#x306A;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x3001;&#x793E;&#x4F1A;&#x7684;&#x3042;&#x308B;&#x3044;&#x306F;&#x5DE5;&#x5B66;&#x7684;&#x89B3;&#x70B9;&#x3067;&#x65E7;&#x5F0F;&#x5316;&#x3057;&#x305F;&#x969B;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x6700;&#x65B0;&#x5316;&#x304C;&#x5FC5;&#x8981;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x9280;&#x884C;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x9280;&#x884C;&#x306E;&#x5408;&#x4F75;&#x306B;&#x3088;&#x308A;&#x6539;&#x4FEE;&#x304C;&#x5FC5;&#x8981;&#x3068;&#x306A;&#x308B;&#x3068;&#x3044;&#x3063;&#x305F;&#x4E8B;&#x4F8B;&#x304C;&#x4EE3;&#x8868;&#x7684;&#x3067;&#x3059;&#x3002;&#x65E7;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x7121;&#x8A08;&#x753B;&#x306B;&#x6539;&#x4FEE;&#x3057;&#x3066;&#x3044;&#x3066;&#x306F;&#x3001;&#x52B9;&#x7387;&#x3082;&#x60AA;&#x304F;&#x3001;&#x3080;&#x3057;&#x308D;&#x524D;&#x3088;&#x308A;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x3092;&#x60AA;&#x5316;&#x3059;&#x308B;&#x3053;&#x3068;&#x3055;&#x3048;&#x3042;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x3053;&#x3067;&#x3001;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x30B5;&#x30D6;&#x30BB;&#x30C3;&#x30C8;&#x3067;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x79FB;&#x884C;&#x3059;&#x3079;&#x304D;&#x304B;&#x3001;&#x3068;&#x3044;&#x3046;&#x300C;&#x79FB;&#x884C;&#x5358;&#x4F4D;&#x300D;&#x3092;&#x4EBA;&#x624B;&#x3067;&#x8A2D;&#x8A08;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x969B;&#x7528;&#x3044;&#x308B;&#x306E;&#x304C;CRUD&#x8868;&#x3067;&#x3059;&#x3002;CRUD&#x8868;&#x3068;&#x306F;&#x3001;&#x56F3;1&#x306E;&#x3088;&#x3046;&#x306B;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5185;&#x306E;&#x6A5F;&#x80FD;&#x3068;&#x30C6;&#x30FC;&#x30D6;&#x30EB;&#x306E;&#x53C2;&#x7167;&#x95A2;&#x4FC2;&#x3092;&#x8868;&#x3067;&#x8868;&#x3057;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;CRUD&#x8868;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x4F8B;&#x3048;&#x3070;&#x4E00;&#x3064;&#x306E;&#x30C6;&#x30FC;&#x30D6;&#x30EB;&#x3092;create&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3068;&#x3001;&#x524A;&#x9664;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x306F;&#x3001;&#x540C;&#x3058;&#x79FB;&#x884C;&#x5358;&#x4F4D;&#x3068;&#x3059;&#x3079;&#x304D;&#x3001;&#x3068;&#x3044;&#x3063;&#x305F;&#x65B9;&#x91DD;&#x304C;&#x898B;&#x3044;&#x3060;&#x305B;&#x307E;&#x3059;&#x3002;</p>
<p><img src="/images/20180723/photo_20180723_02.png"><br>&#x56F3;1&#x3000;CRUD&#x8868;&#x306E;&#x4F8B;</p>
<p>&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3053;&#x306E;CRUD&#x8868;&#x304B;&#x3089;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x79FB;&#x884C;&#x5358;&#x4F4D;&#x3092;&#x63A8;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x8A66;&#x307F;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;CRUD&#x8868;&#x304C;&#x30B0;&#x30E9;&#x30D5;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x96A3;&#x63A5;&#x884C;&#x5217;&#x3068;&#x89E3;&#x91C8;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x306B;&#x7740;&#x76EE;&#x3057;&#x3001;&#x534A;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x5B66;&#x7FD2;&#x306B;&#x57FA;&#x3065;&#x304F;&#x30B0;&#x30E9;&#x30D5;&#x30CE;&#x30FC;&#x30C9;&#x306E;&#x5206;&#x985E;&#x6CD5;&#x3092;&#x7528;&#x3044;&#x307E;&#x3059;&#x3002;&#x5177;&#x4F53;&#x7684;&#x306B;&#x306F;<a href="https://papers.nips.cc/paper/6212-diffusion-convolutional-neural-networks" target="_blank" rel="noopener">Diffusion Convolutional Neural Network</a>&#x3092;&#x7528;&#x3044;&#x3001;&#x6A5F;&#x80FD;&#x3068;&#x30C6;&#x30FC;&#x30D6;&#x30EB;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x914D;&#x7F6E;&#x60C5;&#x5831;&#x3001;&#x3044;&#x308F;&#x3086;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x30D1;&#x30B9;&#x3092;&#x3001;CRUD&#x30B0;&#x30E9;&#x30D5;&#x3068;&#x7D71;&#x5408;&#x3057;&#x3066;&#x7528;&#x3044;&#x307E;&#x3059;&#x3002;&#x3055;&#x3089;&#x306B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x30D1;&#x30B9;&#x306E;&#x6728;&#x69CB;&#x9020;&#x306E;&#x7279;&#x6027;&#x3092;&#x6D3B;&#x304B;&#x3059;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;<a href="https://arxiv.org/pdf/1705.08039.pdf" target="_blank" rel="noopener">Poincar&#x113; Embeddings</a>&#x3092;&#x4F75;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x5F93;&#x6765;&#x6CD5;&#x306B;&#x6BD4;&#x3079;&#x3001;&#x4EBA;&#x624B;&#x306E;&#x79FB;&#x884C;&#x5358;&#x4F4D;&#x306B;&#x6700;&#x3082;&#x8FD1;&#x3044;&#x7D50;&#x679C;&#x3092;&#x5F97;&#x3066;&#x3044;&#x307E;&#x3059;(&#x56F3;2)&#x3002;</p>
<p><img src="/images/20180723/photo_20180723_03.png"></p>
<p>&#x56F3;2 CRUD&#x60C5;&#x5831;&#x3068;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x30D1;&#x30B9;&#x306E;&#x7D71;&#x5408;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x304A;&#x3088;&#x3073;&#x305D;&#x306E;&#x624B;&#x6CD5;&#x306E;&#x5B9F;&#x9A13;&#x7D50;&#x679C;</p>
<h2 id="&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;"><a href="#&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;" class="headerlink" title="&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;"></a>&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;</h2><p>&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;&#x3067;&#x306F;&#x3001;Future&#x306B;&#x304A;&#x3051;&#x308B;AI&#x6848;&#x4EF6;&#x306E;&#x5B9F;&#x7E3E;&#x3092;&#x5C55;&#x793A;&#x3044;&#x305F;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x591A;&#x304F;&#x306E;&#x5B66;&#x751F;&#x3055;&#x3093;&#x3001;&#x4F01;&#x696D;&#x306E;&#x65B9;&#x306B;&#x6765;&#x3066;&#x3044;&#x305F;&#x3060;&#x304D;&#x3001;&#x5927;&#x5909;&#x76DB;&#x308A;&#x4E0A;&#x304C;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;Future&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x6E05;&#x6DBC;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x3092;&#x914D;&#x3063;&#x3066;&#x3044;&#x305F;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;3&#x65E5;&#x3092;&#x901A;&#x3057;&#x3066;&#x6255;&#x5E95;&#x3059;&#x308B;&#x306A;&#x3069;&#x591A;&#x304F;&#x306E;&#x65B9;&#x306B;&#x6765;&#x3066;&#x3044;&#x305F;&#x3060;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><img src="/images/20180723/photo_20180723_04.jpeg" class="img-middle-size"></p>
<h2 id="&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;"><a href="#&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;" class="headerlink" title="&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;"></a>&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;</h2><p>&#x53E3;&#x982D;&#x767A;&#x8868;&#x3084;&#x30A4;&#x30F3;&#x30BF;&#x30E9;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x4E2D;&#x3067;&#x3082;&#x3001;&#x9762;&#x767D;&#x304B;&#x3063;&#x305F;&#x3068;&#x601D;&#x3046;&#x3082;&#x306E;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x305F;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;(&#x4EE5;&#x4E0B;&#x306E;&#x8981;&#x7D04;&#x306B;&#x306F;&#x3001;SAIG&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x3067;&#x3042;&#x308B;&#x8C9E;&#x5149;&#x3001;&#x85E4;&#x7530;&#x3001;&#x52DD;&#x6751;&#x306E;3&#x540D;&#x306B;&#x304A;&#x624B;&#x4F1D;&#x3044;&#x3044;&#x305F;&#x3060;&#x304D;&#x307E;&#x3057;&#x305F;&#xFF09;</p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/2C1-05/detail?lang=ja" target="_blank" rel="noopener">Word2Vec&#x306B;&#x304A;&#x3051;&#x308B;&#x51FA;&#x529B;&#x5074;&#x306E;&#x91CD;&#x307F;&#x306B;&#x6CE8;&#x76EE;&#x3057;&#x305F;&#x6587;&#x66F8;&#x5206;&#x985E;&#x624B;&#x6CD5;&#x306E;&#x691C;&#x8A0E;&#x3000;(&#x5185;&#x7530;&#x3089;)</a></li>
</ul>
<p>&#x8FD1;&#x5E74;&#x8A00;&#x8A9E;&#x51E6;&#x7406;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;word2vec&#x306E;&#x3088;&#x3046;&#x306A;&#x5206;&#x6563;&#x8868;&#x73FE;&#x304C;&#x6CE8;&#x76EE;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x5206;&#x6563;&#x8868;&#x73FE;&#x306F;&#x6587;&#x66F8;&#x306E;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x3084;&#x691C;&#x7D22;&#x30BF;&#x30B9;&#x30AF;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x5F37;&#x529B;&#x306B;&#x50CD;&#x304D;&#x307E;&#x3059;&#x3002;&#x4E00;&#x822C;&#x7684;&#x306A;word2vec&#x306B;&#x304A;&#x3051;&#x308B;&#x7372;&#x5F97;&#x624B;&#x6CD5;&#x306F;&#x3001;3&#x5C64;&#x306E;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x3092;&#x7528;&#x3044;&#x3066;&#x7B2C;1&#x5C64;&#x306E;&#x91CD;&#x307F;&#xFF08;W in)&#x3092;&#x5B66;&#x7FD2;&#x3055;&#x305B;&#x3066;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3067;&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x7B2C;2&#x5C64;&#x306E;&#x91CD;&#x307F;(w out)&#x3082;&#x5171;&#x8D77;&#x60C5;&#x5831;&#x91CF;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x304B;&#x3089;w in, w out&#x4E21;&#x65B9;&#x3092;&#x7528;&#x3044;&#x308B;&#x3079;&#x304D;&#x3060;&#x3068;&#x4E3B;&#x5F35;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;W in W out&#x306E;&#x4E21;&#x30D9;&#x30AF;&#x30C8;&#x30EB;&#x306E;&#x5E73;&#x5747;&#x3092;&#x3068;&#x3063;&#x3066;&#x5358;&#x8A9E;&#x30D9;&#x30AF;&#x30C8;&#x30EB;&#x3068;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x5206;&#x985E;&#x30BF;&#x30B9;&#x30AF;&#x306B;&#x304A;&#x3044;&#x3066;&#x5F93;&#x6765;&#x306E;w2v&#x3088;&#x308A;&#x3082;&#x7CBE;&#x5EA6;&#x304C;&#x4E0A;&#x304C;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/2J2-02/detail?lang=ja" target="_blank" rel="noopener">&#x4F4D;&#x7F6E;&#x60C5;&#x5831;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x3088;&#x308B;&#x7AF6;&#x5408;&#x5E97;&#x8217;&#x306E;&#x5229;&#x7528;&#x72B6;&#x6CC1;&#x306E;&#x591A;&#x69D8;&#x6027;&#x3092;&#x7528;&#x3044;&#x305F;&#x8CFC;&#x8CB7;&#x4E88;&#x6E2C;&#x624B;&#x6CD5;&#x306E;&#x63D0;&#x6848;&#x3000;&#xFF08;&#x65B0;&#x7F8E;&#x3089;&#xFF09;</a></li>
</ul>
<p>&#x5B9F;&#x5E97;&#x8217;&#x3067;&#x306E;&#x8CFC;&#x8CB7;&#x3092;&#x628A;&#x63E1;&#x3059;&#x308B;&#x624B;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x3001;&#x30A2;&#x30F3;&#x30B1;&#x30FC;&#x30C8;&#x3092;&#x7528;&#x3044;&#x305F;&#x5E02;&#x5834;&#x8ABF;&#x67FB;&#x3084;&#x3001;&#x5BB6;&#x8A08;&#x7C3F;&#x30A2;&#x30D7;&#x30EA;&#x306E;&#x30EC;&#x30B7;&#x30FC;&#x30C8;&#x30B9;&#x30AD;&#x30E3;&#x30F3;&#x7B49;&#x306E;&#x5229;&#x7528;&#x304C;&#x8A66;&#x307F;&#x3089;&#x308C;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x3053;&#x308C;&#x3089;&#x306F;&#x56DE;&#x7B54;&#x306E;&#x504F;&#x308A;&#x3084;&#x8ABF;&#x67FB;&#x5BFE;&#x8C61;&#x8005;&#x306E;&#x8CA0;&#x62C5;&#x3068;&#x3044;&#x3046;&#x8AB2;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x2460;&#x5927;&#x624B;&#x30B9;&#x30FC;&#x30D1;&#x30FC;&#x30DE;&#x30FC;&#x30B1;&#x30C3;&#x30C8;&#x30C1;&#x30A7;&#x30FC;&#x30F3;T&#x793E;&#x306E;ID-POS&#x30C7;&#x30FC;&#x30BF;&#x3001;&#x2461;T&#x793E;&#x5404;&#x5E97;&#x8217;&#x3001;&#x304A;&#x3088;&#x3073;&#x7AF6;&#x5408;&#x3068;&#x60F3;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x8FD1;&#x96A3;&#x306E;&#x8907;&#x6570;&#x5E97;&#x8217;&#x306B;&#x8A2D;&#x5B9A;&#x3057;&#x305F;&#x30B8;&#x30AA;&#x30D5;&#x30A7;&#x30F3;&#x30B9;&#xFF08;&#x203B;&#xFF09;&#x5185;&#x3078;&#x306E;&#x6D88;&#x8CBB;&#x8005;&#x306E;&#x51FA;&#x5165;&#x60C5;&#x5831;&#x3092;&#x30DE;&#x30C3;&#x30C1;&#x30F3;&#x30B0;&#x3055;&#x305B;&#x308B;&#x65B9;&#x6CD5;&#x3092;&#x63D0;&#x6848;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x203B;&#x5730;&#x57DF;&#x3092;&#x7279;&#x5B9A;&#x306E;&#x8DDD;&#x96E2;&#x3067;&#x533A;&#x5207;&#x3063;&#x305F;&#x4EEE;&#x60F3;&#x306E;&#x533A;&#x753B;&#x306E;&#x3053;&#x3068;&#x3002;&#x6D88;&#x8CBB;&#x8005;&#x304C;&#x7279;&#x5B9A;&#x306E;&#x8907;&#x6570;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5229;&#x7528;&#x3057;&#x305F;&#x969B;&#x306B;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C9;&#x3067;&#x53D6;&#x5F97;&#x3055;&#x308C;&#x308B;&#x4F4D;&#x7F6E;&#x60C5;&#x5831;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3067;&#x3042;&#x308B;&#x304C;&#x3001;GPS&#x306B;&#x57FA;&#x3065;&#x304F;&#x6B63;&#x78BA;&#x306A;&#x4F4D;&#x7F6E;&#x60C5;&#x5831;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x30B8;&#x30AA;&#x30D5;&#x30A7;&#x30F3;&#x30B9;&#x5185;&#x3078;&#x306E;&#x4FB5;&#x5165;&#x30FB;&#x9000;&#x51FA;&#x3092;&#x8A18;&#x9332;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x3092;&#x63A1;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/1E2-03/detail?lang=ja" target="_blank" rel="noopener">&#x6DF1;&#x5C64;&#x5B66;&#x7FD2;&#x3092;&#x7528;&#x3044;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x96E2;&#x8131;&#x4E88;&#x6E2C; (&#x5BAE;&#x5D0E;&#x3089;)</a></li>
</ul>
<p>&#x30E6;&#x30FC;&#x30B6;&#x96E2;&#x8131;&#x4E88;&#x6E2C;&#x306B;&#x95A2;&#x3059;&#x308B;&#x65E2;&#x5B58;&#x7814;&#x7A76;&#x3067;&#x306F;&#x30E6;&#x30FC;&#x30B6;&#x5C5E;&#x6027;&#x60C5;&#x5831;&#x3084;&#x884C;&#x52D5;&#x30C7;&#x30FC;&#x30BF;&#x306A;&#x3069;&#x306E;&#x7279;&#x5FB4;&#x91CF;&#x3092;&#x6A5F;&#x68B0;&#x5B66;&#x7FD2;&#x306E;&#x30E2;&#x30C7;&#x30EB;&#x306B;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x305B;&#x3001;&#x5C06;&#x6765;&#x306E;&#x4E00;&#x5B9A;&#x671F;&#x9593;&#x306B;&#x304A;&#x3051;&#x308B;&#x96E2;&#x8131;&#x3092;&#x4E88;&#x60F3;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308A;&#x3001;Random Forest&#x3084;SVM&#x306A;&#x3069;&#x69D8;&#x3005;&#x306A;&#x624B;&#x6CD5;&#x304C;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3067;&#x6DF1;&#x5C64;&#x5B66;&#x7FD2;&#x3092;&#x7528;&#x3044;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x96E2;&#x8131;&#x4E88;&#x6E2C;&#x306B;&#x95A2;&#x3059;&#x308B;&#x7814;&#x7A76;&#x306F;&#x591A;&#x304F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x672C;&#x7814;&#x7A76;&#x3067;&#x3001;&#x306F;&#x30E6;&#x30FC;&#x30B6;&#x306E;&#x96E2;&#x8131;&#x4E88;&#x6E2C;&#x30E2;&#x30C7;&#x30EB;&#x306B;&#x6642;&#x7CFB;&#x5217;&#x76F8;&#x95A2;&#x3092;&#x53D6;&#x308A;&#x8FBC;&#x3080;&#x305F;&#x3081;&#x306B;LSTM&#x3092;&#x63A1;&#x7528;&#x3057;&#x3001;&#x65E2;&#x5B58;&#x624B;&#x6CD5;&#x3067;&#x3042;&#x308B;Random Forest&#x3068;&#x6642;&#x7CFB;&#x5217;&#x6027;&#x3092;&#x8003;&#x616E;&#x3057;&#x306A;&#x3044;&#x4E2D;&#x9593;&#x5C64;&#x304C;4&#x5C64;&#x306E;MLP&#x3068;&#x306E;&#x6BD4;&#x8F03;&#x3057;&#x3001;&#x65E2;&#x5B58;&#x624B;&#x6CD5;&#x3088;&#x308A;&#x63D0;&#x6848;&#x624B;&#x6CD5;&#x304C;&#x7CBE;&#x5EA6;&#x304C;&#x9AD8;&#x3044;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/3A1-03/detail?lang=ja" target="_blank" rel="noopener">&#x4F4E;&#x89E3;&#x50CF;&#x5EA6;&#x306E;&#x6599;&#x7406;&#x753B;&#x50CF;&#x3092;&#x8D85;&#x89E3;&#x50CF;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;SRGAN&#x306E;&#x5FDC;&#x7528; (&#x6C38;&#x91CE;&#x3089;)</a></li>
</ul>
<p>Deep Learning&#x306B;&#x3088;&#x3063;&#x3066;&#x76EE;&#x899A;&#x307E;&#x3057;&#x3044;&#x767A;&#x5C55;&#x3092;&#x9042;&#x3052;&#x305F;&#x7814;&#x7A76;&#x5185;&#x5BB9;&#x306E;&#x4E00;&#x3064;&#x306B;&#x8D85;&#x89E3;&#x50CF;&#x304C;&#x6319;&#x3052;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x8D85;&#x89E3;&#x50CF;&#x306B;&#x95A2;&#x3057;&#x3066;&#x69D8;&#x3005;&#x306A;&#x30E2;&#x30C7;&#x30EB;&#x304C;&#x63D0;&#x6848;&#x3055;&#x308C;&#x308B;&#x4E2D;&#x3001;&#x4EBA;&#x9593;&#x306B;&#x3068;&#x3063;&#x3066;&#x306E;&#x898B;&#x305F;&#x76EE;&#x3092;&#x8A55;&#x4FA1;&#x3059;&#x308B;MOStesting&#x306B;&#x304A;&#x3044;&#x3066;&#x4ED6;&#x306E;&#x8D85;&#x89E3;&#x50CF;&#x624B;&#x6CD5;&#x3092;&#x51CC;&#x3050;&#x6027;&#x80FD;&#x3092;&#x767A;&#x63EE;&#x3057;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x304C;&#x3001;SRGAN[Leding 16]&#x3067;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;SRGAN&#x306F;&#x5143;&#x753B;&#x50CF;&#x306E;jpg&#x30CE;&#x30A4;&#x30BA;&#x3084;&#x64AE;&#x5F71;&#x306E;&#x969B;&#x306B;&#x751F;&#x3058;&#x305F;&#x30D6;&#x30EC;&#x3092;&#x4FEE;&#x5FA9;&#x3067;&#x304D;&#x306A;&#x3044;&#x554F;&#x984C;&#x3084;&#x64AE;&#x5F71;&#x5BFE;&#x8C61;&#x300C;&#x3089;&#x3057;&#x3044;&#x300D;&#x30C6;&#x30AF;&#x30B9;&#x30C1;&#x30E3;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x306A;&#x3044;&#x554F;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x6599;&#x7406;&#x753B;&#x50CF;&#x3092;&#x5BFE;&#x8C61;&#x306B;&#x3053;&#x308C;&#x3089;&#x306E;&#x554F;&#x984C;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3001;&#x89E3;&#x304D;&#x305F;&#x3044;&#x554F;&#x984C;&#x306B;&#x5FDC;&#x3058;&#x305F;&#x9069;&#x5207;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x30BB;&#x30C3;&#x30C8;&#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x3068;&#x3044;&#x3063;&#x305F;&#x57FA;&#x672C;&#x7684;&#x306A;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x306B;&#x57FA;&#x3065;&#x304D;&#x5B9A;&#x6027;&#x7684;&#x30FB;&#x5B9A;&#x91CF;&#x7684;&#x306A;&#x5B9F;&#x9A13;&#x3092;&#x5B9F;&#x65BD;&#x3057;&#x305F;&#x3002;SRGAN&#x306B;&#x5BFE;&#x3057;&#x30CE;&#x30A4;&#x30BA;&#x3092;&#x52A0;&#x3048;&#x305F;&#x4F4E;&#x89E3;&#x50CF;&#x5EA6;&#x753B;&#x50CF;&#x306E;&#x4F5C;&#x6210;&#x3084;&#x30C9;&#x30E1;&#x30A4;&#x30F3;&#x6BCE;&#x306B;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x5206;&#x5272;&#x3057;&#x3066;&#x30E2;&#x30C7;&#x30EB;&#x3092;&#x4F5C;&#x6210;&#x30FB;&#x6BD4;&#x8F03;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x6027;&#x80FD;&#x304C;&#x5411;&#x4E0A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/3E1-04/detail?lang=ja" target="_blank" rel="noopener">&#x5316;&#x5B66;&#x69CB;&#x9020;&#x5F0F;&#x306E;&#x305F;&#x3081;&#x306E;&#x30CF;&#x30A4;&#x30CF;&#x309A;&#x30FC;&#x30AF;&#x3099;&#x30E9;&#x30D5;&#x6587;&#x6CD5; (&#x68B6;&#x91CE;)</a></li>
</ul>
<p>&#x4EFB;&#x610F;&#x306E;&#x7279;&#x5FB4;&#x3092;&#x6301;&#x3064;&#x5316;&#x5B66;&#x5206;&#x5B50;&#x3092;&#x8A2D;&#x8A08;&#x3059;&#x308B;&#x969B;&#x3001;&#x8FD1;&#x5E74;SMILES&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x6587;&#x5B57;&#x5217;&#x8868;&#x73FE;&#x3092;&#x5143;&#x306B;&#x3001;VAE&#x3092;&#x7528;&#x3044;&#x308B;&#x624B;&#x6CD5;&#x304C;&#x63D0;&#x6848;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;(Gomez-Bombarelli 2018) &#x3057;&#x304B;&#x3057;SMILES&#x3068;VAE&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x305F;&#x6642;&#x306E;&#x6B20;&#x70B9;&#x3068;&#x3057;&#x3066;&#x3001;&#x51FA;&#x529B;&#x3055;&#x308C;&#x305F;&#x6587;&#x5B57;&#x5217;&#x304C;&#x5206;&#x5B50;&#x30B0;&#x30E9;&#x30D5;&#x306E;&#x8981;&#x4EF6;&#x3092;&#x6E80;&#x305F;&#x3055;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x8AB2;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x8457;&#x8005;&#x3089;&#x306F;&#x72EC;&#x81EA;&#x306B;&#x3001;&#x5E38;&#x306B;&#x539F;&#x5B50;&#x4FA1;&#x3092;&#x4FDD;&#x6301;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x6761;&#x4EF6;&#x3092;&#x62C5;&#x4FDD;&#x3059;&#x308B;&#x5206;&#x5B50;&#x30CF;&#x30A4;&#x30D1;&#x30FC;&#x30B0;&#x30E9;&#x30D5;&#x69CB;&#x9020;(HRG)&#x3092;&#x5B9A;&#x7FA9;&#x3057;&#x3001;&#x4ECA;&#x5F8C;VAE&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x308B;&#x3053;&#x3068;&#x3067;&#x5206;&#x5B50;&#x8A2D;&#x8A08;&#x304C;&#x5BB9;&#x6613;&#x306B;&#x306A;&#x308B;&#x3068;&#x4E3B;&#x5F35;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/3E1-01/detail?lang=ja" target="_blank" rel="noopener">BPE Sequence to Sequence &#x3092;&#x5229;&#x7528;&#x3057;&#x305F;&#x5358;&#x5909;&#x7570;&#x306B;&#x3088;&#x308B;&#x30BF;&#x30F3;&#x30D1;&#x30AF;&#x8CEA;&#x8010;&#x71B1;&#x6027;&#x5909;&#x5316;&#x4E88;&#x6E2C;&#x3000;&#xFF08;&#x6CB3;&#x91CE;&#x3089;&#xFF09;</a></li>
</ul>
<p>&#x5DE5;&#x696D;&#x7684;&#x306B;&#x6709;&#x7528;&#x306A;&#x30BF;&#x30F3;&#x30D1;&#x30AF;&#x8CEA;&#x306E;&#x8010;&#x71B1;&#x6027;&#x3092;&#x5411;&#x4E0A;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x3092;&#x76EE;&#x7684;&#x306B;&#x3001;&#x30BF;&#x30F3;&#x30D1;&#x30AF;&#x8CEA;&#x3092;&#x69CB;&#x6210;&#x3059;&#x308B;&#x6570;&#x767E;&#x306E;&#x30A2;&#x30DF;&#x30CE;&#x9178;&#x306E;&#x4E00;&#x3064;&#x3092;&#x5225;&#x306E;&#x30A2;&#x30DF;&#x30CE;&#x9178;&#xFF08;&#x5168;20&#x7A2E;&#x985E;&#xFF09;&#x306B;&#x7F6E;&#x63DB;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x3069;&#x306E;&#x30A2;&#x30DF;&#x30CE;&#x9178;&#x3092;&#x5909;&#x5316;&#x3055;&#x305B;&#x308B;&#x3068;&#x52B9;&#x679C;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;&#x4E88;&#x6E2C;&#x304C;&#x96E3;&#x3057;&#x3044;&#x3068;&#x3044;&#x3063;&#x305F;&#x8AB2;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x30A2;&#x30DF;&#x30CE;&#x9178;&#x914D;&#x5217;&#x5168;&#x4F53;&#x306B;&#x95A2;&#x3059;&#x308B;&#x60C5;&#x5831;&#x3092;&#x5341;&#x5206;&#x306B;&#x542B;&#x3080;&#x7279;&#x5FB4;&#x91CF;&#x3068;&#x3057;&#x3066;&#x3001;Byte Pair Encoding(BPE) Seq2Seq&#x30E2;&#x30C7;&#x30EB;&#x306B;&#x3001;&#x65E2;&#x77E5;&#x306E;&#x7279;&#x5FB4;&#x91CF;&#xFF08;&#x5B9F;&#x9A13;&#x6761;&#x4EF6;&#x3084;&#x30A2;&#x30DF;&#x30CE;&#x9178;&#x306E;&#x6027;&#x8CEA;&#x306A;&#x3069;&#xFF09;&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x305F;&#x3082;&#x306E;&#x3092;&#x63D0;&#x6848;&#x3057;&#x3001;&#x65E2;&#x5B58;&#x6CD5;&#x3088;&#x308A;&#x9AD8;&#x3044;&#x7CBE;&#x5EA6;&#x3067;&#x8010;&#x71B1;&#x6027;&#x5909;&#x5316;&#x3092;&#x4E88;&#x6E2C;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br><br></p>
<ul>
<li><a href="https://confit.atlas.jp/guide/event/jsai2018/subject/1P3-05/detail?lang=ja" target="_blank" rel="noopener">CAD&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x64CD;&#x4F5C;&#x30ED;&#x30B0;&#x5206;&#x6790;&#x306B;&#x3088;&#x308B;&#x64CD;&#x4F5C;&#x30B9;&#x30AD;&#x30EB;&#x306E;&#x62BD;&#x51FA; (&#x65B0;&#x5BE6;&#x3089;)</a></li>
</ul>
<p>CAD&#x306E;&#x624B;&#x9806;&#x64CD;&#x4F5C;&#x30ED;&#x30B0;&#x304B;&#x3089;&#x3001;&#x6C7A;&#x5B9A;&#x6728;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30D9;&#x30C6;&#x30E9;&#x30F3;&#x306E;&#x30B9;&#x30AD;&#x30EB;&#x3092;&#x691C;&#x77E5;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x5185;&#x5BB9;&#x3002;<br>JSAI&#x3067;&#x306F;&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x3001;&#x3042;&#x308B;&#x7A0B;&#x5EA6;&#x67AF;&#x308C;&#x305F;&#x6280;&#x8853;&#x3092;&#x7523;&#x696D;&#x5FDC;&#x7528;&#x3057;&#x3066;&#x3044;&#x304F;&#x3001;&#x3068;&#x3044;&#x3046;&#x767A;&#x8868;&#x304C;&#x591A;&#x304F;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x672C;&#x7814;&#x7A76;&#x306F;&#x7814;&#x7A76;&#x8AB2;&#x984C;&#x304C;&#x660E;&#x78BA;&#x304B;&#x3064;&#x3001;&#x6709;&#x76CA;&#x306A;&#x52B9;&#x679C;&#x304C;&#x5F97;&#x3089;&#x308C;&#x305F;&#x3001;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x304C;&#x3068;&#x3066;&#x3082;&#x5206;&#x304B;&#x308A;&#x3084;&#x3059;&#x304F;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;<br><br></p>
<h2 id="&#x304A;&#x308F;&#x308A;&#x306B;"><a href="#&#x304A;&#x308F;&#x308A;&#x306B;" class="headerlink" title="&#x304A;&#x308F;&#x308A;&#x306B;"></a>&#x304A;&#x308F;&#x308A;&#x306B;</h2><p>JSAI2018&#x3067;&#x306F;&#x3001;&#x591A;&#x304F;&#x306E;&#x53CE;&#x7A6B;&#x304C;&#x3042;&#x308A;&#x975E;&#x5E38;&#x306B;&#x6709;&#x76CA;&#x3060;&#x3063;&#x305F;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x77E5;&#x8B58;&#x3082;&#x3055;&#x308B;&#x3053;&#x3068;&#x306A;&#x304C;&#x3089;&#x3001;&#x512A;&#x79C0;&#x306A;&#x7814;&#x7A76;&#x8005;&#x30FB;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x306E;&#x65B9;&#x3068;&#x306E;&#x51FA;&#x4F1A;&#x3044;&#x3084;&#x4F01;&#x696D;&#x3055;&#x3093;&#x3068;&#x306E;&#x51FA;&#x4F1A;&#x3044;&#x3082;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;<br>&#x4ECA;&#x5F8C;&#x3082;&#x5B66;&#x4F1A;&#x3084;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306B;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x898B;&#x304B;&#x3051;&#x305F;&#x969B;&#x306B;&#x306F;&#x6C17;&#x8EFD;&#x306B;&#x304A;&#x58F0;&#x3092;&#x304B;&#x3051;&#x3066;&#x304F;&#x3060;&#x3055;&#x308C;&#x3070;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x4EE5;&#x4E0A;&#x5C0F;&#x6C60;&#x3067;&#x3057;&#x305F;&#x3002;</p>

      
    </div>
  </div>
    
  <!-- シェアボタン START -->
  <div class="social-area">
  <ul class="social-button">

      <!-- twitter -->
      <li class="sc-tw social-button-twitter">
          <a href="https://twitter.com/share" class="twitter-share-button" data-via="future_techblog" data-lang="ja" data-hashtags="future_architect">ツイート</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
      </li>
      
      <!-- Facebookいいね -->
      <li class="social-button-fb">
          <div id="fb-root"></div>
          <script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v2.8";
              fjs.parentNode.insertBefore(js, fjs);
            }(document, 'script', 'facebook-jssdk'));</script>
          <div class="fb-like" data-href="https://future-architect.github.io/articles/20180723/" data-layout="button_count" data-action="like" data-size="small" data-show-faces="true" data-share="true"></div>
      </li>

      <!-- はてなブックマーク -->
      <li class="social-button-hatebu"><a href="http://b.hatena.ne.jp/entry/https://future-architect.github.io/articles/20180723/" class="hatena-bookmark-button" data-hatena-bookmark-layout="standard-balloon" data-hatena-bookmark-lang="ja" title="このエントリーをはてなブックマークに追加"><img src="https://b.st-hatena.com/images/entry-button/button-only@2x.png" alt="このエントリーをはてなブックマークに追加" width="20" height="20" style="border: none;"></a><script type="text/javascript" src="https://b.st-hatena.com/js/bookmark_button.js" charset="utf-8" async="async"></script></li>

      <!-- pocket -->
      <li class="social-button-pocket"><a data-pocket-label="pocket" data-pocket-count="horizontal" class="pocket-btn" data-lang="en"></a>
          <script type="text/javascript">!function(d,i){if(!d.getElementById(i)){var j=d.createElement("script");j.id=i;j.src="https://widgets.getpocket.com/v1/j/btn.js?v=1";var w=d.getElementById(i);d.body.appendChild(j);}}(document,"pocket-btn-js");</script>
      </li>

  </ul>
  </div>
<!-- シェアボタン END -->


  
    
<nav id="article-nav">
  
    <a href="/articles/20180809/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          データベースマイグレーション ～OracleからPostgreSQLへ～　－第２回ー
        
      </div>
    </a>
  
  
    <a href="/articles/20180529/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">データベースマイグレーション ～OracleからPostgreSQLへ～　ー第１回ー</div>
    </a>
  
</nav>

  
  <br>
</article>

</div>
<div class="col-md-3 col-sm-3 blog-sidebar">
  <!-- CATEGORIES START -->
<h2 class="margin-top-30">Categories</h2>

<div class="widget-wrap">
  <div class="widget">
    <ul class="nav sidebar-categories margin-bottom-40">
      
	<li>
	  <a href="/categories/Culture/">Culture (21)</a>
	</li>
      
	<li>
	  <a href="/categories/IoT/">IoT (6)</a>
	</li>
      
	<li>
	  <a href="/categories/VR/">VR (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Security/">Security (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Design/">Design (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Programming/">Programming (8)</a>
	</li>
      
	<li>
	  <a href="/categories/Management/">Management (4)</a>
	</li>
      
	<li>
	  <a href="/categories/Infrastructure/">Infrastructure (12)</a>
	</li>
      
	<li>
	  <a href="/categories/DB/">DB (5)</a>
	</li>
      
	<li>
	  <a href="/categories/DataScience/">DataScience (14)</a>
	</li>
      
    </ul>
  </div>
</div>


<!-- CATEGORIES END -->

<!-- BEGIN FEATURED POSTS -->
<h2>Featured Posts</h2>
<div class="recent-news margin-bottom-10">
  
  
    
      
        <a href="https://future-architect.github.io/articles/20190625/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                Amazon Redshiftの仕様を調べてみた
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190620/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                RedmineからGoogle Hangouts Chat へ連携するプラグインを作成しました！
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190612/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                TypeScript教育用コンテンツ公開のお知らせ
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190610/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                ソースコードを綺麗にするためにまず心がけたい３点
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190604/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                OpenCensus(OpenTelemetry)とは
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
</div>
<!-- END FEATURED POSTS -->

<!-- START ADVENT CALENDAR -->
<div class="margin-bottom-20">
  <h2>Advent Calendar</h2>
  <div class="widget-wrap">
  <div class="widget">
    <ul class="nav">
      <li>
        <a href="http://qiita.com/advent-calendar/2018/future" target="_blank">2018年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2017/future" target="_blank">2017年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2016/future" target="_blank">2016年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2015/future" target="_blank">2015年</a>
      </li>
    </ul>
  </div>
</div>

</div>
<!-- END ADVENT CALENDAR -->


</div>
</div>

  </section>
</div>

    <!-- BEGIN PRE-FOOTER -->
    <div class="pre-footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN BOTTOM ABOUT BLOCK -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>About Us</h2>
            <p>経営とITをデザインする、フューチャーアーキテクトの技術ブログです。IoTやAI(MachineLearning)・Security・VR・Cloud・BigDataといった内容の記事を中心に、業務で利用する幅広い技術について紹介します。また、OSSへの貢献やカンファレンスなどへの登壇など、フューチャーへのエンジニア文化についてもドシドシ紹介していきますのでぜひウォッチ下さい！<br><br><a href="http://www.future.co.jp/">http://www.future.co.jp/</a></p>
          </div>
          <!-- END BOTTOM ABOUT BLOCK -->

          <!-- BEGIN BOTTOM CONTACTS -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>Contact</h2>
            <address class="margin-bottom-40">
              東京都品川区大崎1-2-2<br>
              アートヴィレッジ大崎セントラルタワー<br><br>
              Email: <a href="mailto:techblog@future.co.jp">techblog@future.co.jp</a><br>
            </address>
          </div>
          <!-- END BOTTOM CONTACTS -->

	
          <!-- BEGIN TWITTER BLOCK -->
    <div class="col-md-4 col-sm-6 pre-footer-col">

    <!-- Twitterフォローボタン -->
    <a href="https://twitter.com/future_techblog" class="twitter-follow-button" data-show-count="false" data-lang="ja">/future_techblogさんをフォロー</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>

	  <a data-tweet-limit="1" class="twitter-timeline" href="https://twitter.com/future_techblog" data-widget-id="732749663766372354">Tweets by @future_techblog</a>

	  <script>!function(d,s,id){var
	  js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+"://platform.twitter.com/widgets.js";fjs.parentNode.insertBefore(js,fjs);}}(document,"script","twitter-wjs");</script>

          </div>
          <!-- END TWITTER BLOCK -->
	
        </div>
      </div>
    </div>
    <!-- END PRE-FOOTER -->

    <!-- BEGIN FOOTER -->
    <div class="footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN COPYRIGHT -->
          <div class="col-md-6 col-sm-6 padding-top-10">
                  &copy; 2019 Future Tech Blog - フューチャーアーキテクト<br>
 <!-- <a href="javascript:;">Privacy Policy</a> | <a href="javascript:;">Terms of Service</a> -->
          </div>
          <!-- END COPYRIGHT -->
	  <!-- BEGIN SOCIAL -->
<div class="col-md-6 col-sm-6">
  <ul class="social-footer list-unstyled list-inline pull-right">
    
      
      <li><a href="https://github.com/future-architect"><i class="fa fa-github"></i></a></li>
      
  
      
      <li><a href="https://twitter.com/future_techblog"><i class="fa fa-twitter"></i></a></li>
      
  
      
      <li><a href="https://www.facebook.com/future.saiyo"><i class="fa fa-facebook"></i></a></li>
      
  
      
      <li>
        <a href="http://qiita.com/organizations/future">
            <i class="fa fa-pencil-square-o"></i>
        </a>
      </li>
      
  
      
      <li><a href="/atom.xml"><i class="fa fa-rss"></i></a></li>
      
  
  </ul>
</div>
<!-- END SOCIAL -->

        </div>
      </div>
    </div>
    <!-- END FOOTER -->

  <!-- BEGIN CORE PLUGINS (REQUIRED FOR ALL PAGES) -->
<!--[if lt IE 9]>
<script src="/metronic/assets/plugins/respond.min.js"></script>
<![endif]-->
<script src="/metronic/assets/plugins/jquery.min.js"></script>
<script src="/metronic/assets/plugins/jquery-migrate.min.js"></script>
<script src="/metronic/assets/plugins/bootstrap/js/bootstrap.min.js"></script>
<script src="/metronic/assets/corporate/scripts/back-to-top.js"></script>
<script src="/metronic/assets/corporate/scripts/layout.js"></script>
<script src="/js/script.js"></script>

<script type="text/javascript">
    jQuery(document).ready(function() {
        Layout.init();
        Layout.initTwitter();
        Layout.initFixHeaderWithPreHeader(); /* Switch On Header Fixing (only if you have pre-header) */
        Layout.initNavScrolling();
    });
</script>
<!-- END CORE PLUGINS -->
<!-- START INTEGRATIONS -->

<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74047147-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


<!-- END INTEGRATIONS --><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</body>
</html>
