<!DOCTYPE html>
<!--[if IE 8]> <html lang="ja" class="ie8 no-js"> <![endif]-->
<!--[if IE 9]> <html lang="ja" class="ie9 no-js"> <![endif]-->
<!--[if !IE]><!-->
<html lang="ja">
<!--<![endif]-->
<head><meta name="generator" content="Hexo 3.8.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>デブサミ2019に登壇しました | Future Tech Blog - フューチャーアーキテクト</title>

  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

  
  <meta name="description" content="2019/02/15&amp;#x306B;Developers Summit 2019&amp;#x306E;&amp;#x30E9;&amp;#x30F3;&amp;#x30C1;&amp;#x30BB;&amp;#x30C3;&amp;#x30B7;&amp;#x30E7;&amp;#x30F3;&amp;#x306B;&amp;#x3066;&amp;#x3001;Redmine&amp;#x3068;&amp;#x305D;&amp;#x306E;&amp;#x30D7;&amp;#x30E9;&amp;#x30B0;&amp;#x30A4;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="デブサミ2019に登壇しました">
<meta property="og:url" content="https://future-architect.github.io/articles/20190607/index.html">
<meta property="og:site_name" content="Future Tech Blog - フューチャーアーキテクト">
<meta property="og:description" content="2019/02/15&amp;#x306B;Developers Summit 2019&amp;#x306E;&amp;#x30E9;&amp;#x30F3;&amp;#x30C1;&amp;#x30BB;&amp;#x30C3;&amp;#x30B7;&amp;#x30E7;&amp;#x30F3;&amp;#x306B;&amp;#x3066;&amp;#x3001;Redmine&amp;#x3068;&amp;#x305D;&amp;#x306E;&amp;#x30D7;&amp;#x30E9;&amp;#x30B0;&amp;#x30A4;&amp;">
<meta property="og:locale" content="ja">
<meta property="og:image" content="https://future-architect.github.io/images/20190607/1.jpg">
<meta property="og:updated_time" content="2019-06-06T16:27:55.912Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="デブサミ2019に登壇しました">
<meta name="twitter:description" content="2019/02/15&amp;#x306B;Developers Summit 2019&amp;#x306E;&amp;#x30E9;&amp;#x30F3;&amp;#x30C1;&amp;#x30BB;&amp;#x30C3;&amp;#x30B7;&amp;#x30E7;&amp;#x30F3;&amp;#x306B;&amp;#x3066;&amp;#x3001;Redmine&amp;#x3068;&amp;#x305D;&amp;#x306E;&amp;#x30D7;&amp;#x30E9;&amp;#x30B0;&amp;#x30A4;&amp;">
<meta name="twitter:image" content="https://future-architect.github.io/images/20190607/1.jpg">
  
    <link rel="alternative" href="/atom.xml" title="Future Tech Blog - フューチャーアーキテクト" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  

  <meta content="デブサミ2019に登壇しました | Future Tech Blog - フューチャーアーキテクト" name="description">
  <meta content="デブサミ2019に登壇しました,Future Tech Blog - フューチャーアーキテクト,フューチャーアーキテクト,Future Architect,フューチャー,Future,Tech Blog,技術ブログ,技術,ブログ" name="keywords">
  <meta content="Future Architect Consultant" name="author">

  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700|Audiowide|PT+Sans+Narrow|Source+Sans+Pro:200,300,400,600,700,900&amp;subset=all" rel="stylesheet" type="text/css">

  <!-- Global styles START -->
  <link rel="stylesheet" href="/metronic/assets/plugins/font-awesome/css/font-awesome.min.css">
  <link rel="stylesheet" href="/metronic/assets/plugins/bootstrap/css/bootstrap.min.css">
  <!-- Global styles END -->

  <!-- Theme styles START -->
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style-responsive.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/themes/custom.css">
  <link rel="stylesheet" href="/css/theme-styles.css">
  <!-- Theme styles END --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>
</html>
<body class="corporate">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- BEGIN HEADER -->
<div class="header">
	<div class="header-overlay">
		<!--<a class="site-logo" href="/" id="logo">Future Tech Blog - フューチャーアーキテクト</a>-->
		<div class="header-menu">
			<a class="site-logo" href="/">
				<img src="/metronic/assets/corporate/img/site_logo.png" alt="logo" class="logo-img">
			</a>
			<a href="javascript:void(0);" class="mobi-toggler"><i class="fa fa-bars"></i></a>
			<!-- BEGIN NAVIGATION -->
			<div class="header-navigation pull-right font-transform-inherit">
				<ul>
					
					<li class>
						<a href="/"><i class="fa fa-home"></i>Home</a>
					</li>
					
					<li class>
						<a href="/articles/"><i class="fa fa-newspaper-o"></i>Blog</a>
					</li>
					
					<li class>
						<a href="https://github.com/future-architect"><i class="fa fa-github"></i>GitHub</a>
					</li>
					
					<li class>
						<a href="http://qiita.com/organizations/future"><i class="fa fa-users"></i>Qiita</a>
					</li>
					
					<!-- BEGIN TOP SEARCH -->
					<li class="menu-search">
						<span class="sep"></span>
						<i class="fa fa-search search-btn"></i>
						<div class="search-box">
							<form action="#" class="googleSearch" onsubmit="googleSearch();">
								<div class="input-group">
									<input type="text" placeholder="Search" class="form-control">
									<span class="input-group-btn">
										<button class="btn btn-primary" type="submit">Search</button>
									</span>
								</div>
							</form>
						</div>
					</li>
					<!-- END TOP SEARCH -->
				</ul>
			</div>
		</div>
		<!-- END NAVIGATION -->
		<div class="header-title">Tech Blog</div>
        <div class="header-title-sub">フューチャーアーキテクト開発者ブログ</div>
	</div>
</div>
<!-- Header END -->

  <div class="container">
  <ul class="breadcrumb">
    <li><a href="/">Home</a></li>
    <li><a href="/articles/">Blog</a></li>
    <li class="active">Post</li>
  </ul>
  <section id="main">
    
    <h2 itemprop="name">
      <a class="article-title" href="/articles/20190607/">デブサミ2019に登壇しました</a>
    </h2>


    <div class="row">
<div class="col-md-9 col-sm-9 blog-posts">
<article id="post-20190606-devsumi" class="article article-type-post blog-item" itemscope itemprop="blogPost">
  <div class="article-meta">
  </div>
  <div class="article-inner">
    
    <header class="article-header">
      <ul class="blog-info">
	<li><i class="fa fa-user"></i> 稲垣哲也</li>
	<li><i class="fa fa-calendar"></i>
	  <time datetime="2019-06-07T00:00:00.000Z" itemprop="datePublished">2019/06/07</time>

	</li>

    <li class="hidden-xs"><i class="fa fa-tags"></i>
	  

	</li>
      </ul>
      
  <div class="article-category">
    
    Category: 
    
    Categories:
    <a class="article-category-link" href="/categories/Management/">Management</a>
  </div>
  <br>


    </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>2019/02/15&#x306B;<a href="https://event.shoeisha.jp/devsumi/20190214" target="_blank" rel="noopener">Developers Summit 2019</a>&#x306E;&#x30E9;&#x30F3;&#x30C1;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3066;&#x3001;Redmine&#x3068;&#x305D;&#x306E;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x3067;&#x3042;&#x308B;<a href="https://lychee-redmine.jp/" target="_blank" rel="noopener">Lychee</a>&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x4E8B;&#x4F8B;&#x3068;&#x3057;&#x3066;&#x767B;&#x58C7;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x767B;&#x58C7;&#x5185;&#x5BB9;&#x306F;&#x3001;<a href="https://event.shoeisha.jp/devsumi/20190214/session/1978/" target="_blank" rel="noopener">&#x3010;&#x5C0E;&#x5165;&#x4E8B;&#x4F8B;&#x3011;Lychee Redmine&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x304C;&#x8A9E;&#x308B;&#xFF01;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x4E88;&#x9632;&#x3068;&#x3057;&#x3066;&#x306E;&#x4F7F;&#x3044;&#x65B9;</a>&#x3067;&#x3059;&#x3002;</p>
<p>&#x3053;&#x3053;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;&#x306E;&#x80CC;&#x666F;&#x3068;&#x3001;&#x5F53;&#x65E5;&#x306E;&#x72B6;&#x6CC1;&#x306B;&#x3064;&#x3044;&#x3066;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h1 id="Redmine&#x3068;&#x306F;"><a href="#Redmine&#x3068;&#x306F;" class="headerlink" title="Redmine&#x3068;&#x306F;"></a>Redmine&#x3068;&#x306F;</h1><p>Redmine&#x3068;&#x306F;OSS&#x306E;&#x3044;&#x308F;&#x3086;&#x308B;&#x30BF;&#x30B9;&#x30AF;&#x7BA1;&#x7406;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;<br>&#x30EF;&#x30FC;&#x30AF;&#x30D5;&#x30ED;&#x30FC;&#x3084;&#x7BA1;&#x7406;&#x9805;&#x76EE;&#x306A;&#x3069;&#x3092;&#x81EA;&#x7531;&#x306B;&#x30AB;&#x30B9;&#x30BF;&#x30DE;&#x30A4;&#x30BA;&#x3057;&#x3066;&#x5229;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;<br>Ruby On Rails&#x3067;&#x69CB;&#x7BC9;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x305F;&#x304F;&#x3055;&#x3093;&#x306E;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x3066;&#x30E6;&#x30FC;&#x30B6;&#x81EA;&#x8EAB;&#x306E;&#x624B;&#x3067;&#x6A5F;&#x80FD;&#x62E1;&#x5F35;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<p>&#x5F0A;&#x793E;&#x3067;&#x306F;&#x793E;&#x5185;&#x306E;&#x6A19;&#x6E96;&#x7684;&#x306A;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x7BA1;&#x7406;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x3057;&#x3066;&#x5E83;&#x304F;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<h1 id="Lychee&#x3068;&#x306F;"><a href="#Lychee&#x3068;&#x306F;" class="headerlink" title="Lychee&#x3068;&#x306F;"></a>Lychee&#x3068;&#x306F;</h1><p>Lychee&#x306F;&#x30A2;&#x30B8;&#x30E3;&#x30A4;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x3055;&#x3093;&#x304C;&#x958B;&#x767A;&#x3055;&#x308C;&#x305F;Redmine&#x306E;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x306E;&#x4E00;&#x7A2E;&#x3067;&#x3059;&#x3002;<br><a href="https://lychee-redmine.jp/" target="_blank" rel="noopener">https://lychee-redmine.jp/</a></p>
<p>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x7BA1;&#x7406;&#x306B;&#x4FBF;&#x5229;&#x306A;&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x591A;&#x304F;&#x3001;&#x91CD;&#x5B9D;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x7B46;&#x8005;&#x306B;&#x3064;&#x3044;&#x3066;"><a href="#&#x7B46;&#x8005;&#x306B;&#x3064;&#x3044;&#x3066;" class="headerlink" title="&#x7B46;&#x8005;&#x306B;&#x3064;&#x3044;&#x3066;"></a>&#x7B46;&#x8005;&#x306B;&#x3064;&#x3044;&#x3066;</h1><p>&#x65B0;&#x5352;&#x3067;&#x30D5;&#x30E5;&#x30FC;&#x30C1;&#x30E3;&#x30FC;&#x306B;&#x5165;&#x793E;&#x3057;&#x3001;&#x6211;&#x306A;&#x304C;&#x3089;&#x305E;&#x3063;&#x3068;&#x3057;&#x307E;&#x3059;&#x304C;&#x52E4;&#x7D9A;20&#x5E74;&#x4EE5;&#x4E0A;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>Windows95&#x304C;&#x51FA;&#x305F;3&#x5E74;&#x5F8C;&#x306B;&#x5165;&#x793E;&#x3057;&#x3001;&#x5F53;&#x6642;&#x306F;&#x793E;&#x54E1;&#x6570;&#x304C;100&#x4EBA;&#x304F;&#x3089;&#x3044;&#x306E;&#x3067;&#x3057;&#x305F;&#xFF08;&#x203B;2018&#x5E74;12&#x6708;&#x672B;&#x3060;&#x3068;&#x9023;&#x7D50;&#x3067;1984&#x540D;&#xFF09;&#x3002;</p>
<p>&#x300C;&#x3044;&#x308F;&#x3086;&#x308B;&#x540D;&#x306E;&#x77E5;&#x308C;&#x305F;&#x5927;&#x5B66;&#x3068;&#x5927;&#x5B66;&#x9662;&#x307E;&#x3067;&#x51FA;&#x305F;&#x306E;&#x306B;&#x3001;&#x672A;&#x4E0A;&#x5834;&#x306E;&#x4F1A;&#x793E;&#x306B;&#x5165;&#x308B;&#x306A;&#x3093;&#x3066;&#xFF01;&#x300D;&#x3068;&#x3044;&#x3063;&#x305F;&#x5F53;&#x6642;&#x306E;&#x4E16;&#x9593;&#x306E;&#x5E38;&#x8B58;&#x3084;&#x3001;&#x89AA;&#x306E;&#x6D99;&#x306B;&#x6297;&#x3044;&#x3001;&#x793E;&#x4F1A;&#x4EBA;&#x751F;&#x6D3B;&#x3092;&#x30B9;&#x30BF;&#x30FC;&#x30C8;&#x3055;&#x305B;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>Future&#x306F;&#x96E3;&#x6613;&#x5EA6;&#x306E;&#x9AD8;&#x3044;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x624B;&#x639B;&#x3051;&#x308B;&#x308F;&#x308A;&#x306B;&#x3001;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x306F;&#x5C11;&#x306A;&#x3044;&#x65B9;&#x3060;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3057;&#x304B;&#x3057;&#x3001;&#x79C1;&#x306F;&#x307B;&#x307C;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x4E2D;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x30A2;&#x30B5;&#x30A4;&#x30F3;&#x3055;&#x308C;&#x7D9A;&#x3051;&#x3001;&#x304B;&#x306A;&#x308A;&#x53B3;&#x3057;&#x304F;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x306E;&#x54C1;&#x8CEA;&#x306B;&#x3064;&#x3044;&#x3066;&#x8003;&#x3048;&#x629C;&#x304D;&#x306A;&#x304C;&#x3089;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x30DE;&#x30CD;&#x30B8;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x7D4C;&#x9A13;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x305D;&#x3053;&#x304C;&#x8A55;&#x4FA1;&#x3055;&#x308C;&#x305F;&#x306E;&#x304B;&#x3001;2013&#x5E74;&#x304B;&#x3089;&#x793E;&#x5185;&#x306E;&#x54C1;&#x8CEA;&#x7BA1;&#x7406;&#x306E;&#x5BA4;&#x9577;&#x306B;&#x4EFB;&#x547D;&#x3055;&#x308C;&#x3001;&#x5168;&#x793E;&#x306E;&#x54C1;&#x8CEA;&#x57FA;&#x6E96;&#x306E;&#x7B56;&#x5B9A;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x72B6;&#x6CC1;&#x306E;&#x53EF;&#x8996;&#x5316;&#x3001;&#x5206;&#x6790;&#x306A;&#x3069;&#x591A;&#x304F;&#x306E;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3092;&#x884C;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x82E6;&#x3057;&#x3044;&#x6642;&#x3082;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x4EBA;&#x751F;&#x306F;&#x82E6;&#x5473;&#x3082;&#x542B;&#x3081;&#x3066;&#x5473;&#x308F;&#x3046;&#x3068;&#x8C4A;&#x304B;&#x306B;&#x306A;&#x308B;&#x3082;&#x306E;&#x3060;&#x306A;&#x30FC;&#x3068;&#x6700;&#x8FD1;&#x306F;&#x8003;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x305D;&#x3093;&#x306A;&#x6298;&#x3001;2018&#x5E74;10&#x6708;&#x306B;&#x306A;&#x305C;&#x304B;&#x4EBA;&#x4E8B;&#x306E;&#x8CAC;&#x4EFB;&#x8005;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;<br>&#x54C1;&#x8CEA;&#x7BA1;&#x7406;&#x5BA4;&#x9577;&#x304B;&#x3089;&#x306F;&#x96E2;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x306E;&#x3067;&#x3001;&#x73FE;&#x5728;&#x517C;&#x52D9;&#x3067;&#x3059;&#x3002;</p>
<p>&#x54C1;&#x8CEA;&#x7BA1;&#x7406;&#x5BA4;&#x3067;&#x306F;Rails&#x3067;&#x30A2;&#x30B8;&#x30E3;&#x30A4;&#x30EB;&#x958B;&#x767A;&#x3057;&#x3001;&#x305D;&#x306E;&#x524D;&#x306F;&#x30DF;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x30AF;&#x30EA;&#x30C6;&#x30A3;&#x30AB;&#x30EB;&#x306A;&#x57FA;&#x5E79;&#x7CFB;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x958B;&#x767A;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x4EBA;&#x4E8B;&#x3068;&#x517C;&#x52D9;&#x3068;&#x3082;&#x306A;&#x308B;&#x3068;&#x305D;&#x308C;&#x306F;&#x306A;&#x304B;&#x306A;&#x304B;&#x51FA;&#x6765;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<p>&#x3057;&#x305F;&#x304C;&#x3063;&#x3066;&#x3001;&#x4ED6;&#x306E;&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x767B;&#x58C7;&#x8005;&#x306B;&#x6BD4;&#x3079;&#x308B;&#x3068;&#x79C1;&#x306F;&#x304B;&#x306A;&#x308A;&#x7570;&#x8272;&#x306A;&#x80CC;&#x666F;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x308B;&#x3057;&#x3001;&#x7D14;&#x7C8B;&#x306A;IT&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x30EA;&#x30F3;&#x30B0;&#x306E;&#x529B;&#x3067;&#x6BD4;&#x8F03;&#x3059;&#x308B;&#x3068;&#x5F7C;&#x3089;&#x306E;&#x65B9;&#x304C;&#x4E0A;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<p>&#x5165;&#x793E;&#x5F53;&#x6642;&#x306B;&#x8003;&#x3048;&#x3066;&#x3044;&#x305F;&#x30AD;&#x30E3;&#x30EA;&#x30A2;&#x3068;&#x306F;&#x9060;&#x3044;&#x306E;&#x304B;&#x8FD1;&#x3044;&#x306E;&#x304B;&#x3001;&#x4ECA;&#x3072;&#x3068;&#x3064;&#x5206;&#x304B;&#x3089;&#x306A;&#x3044;&#x6240;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;&#x4EBA;&#x9593;&#x4E07;&#x4E8B;&#x585E;&#x7FC1;&#x304C;&#x99AC;&#x3060;&#x3068;&#x8003;&#x3048;&#x308C;&#x3070;&#x3001;&#x3082;&#x306F;&#x3084;&#x4F55;&#x3067;&#x3082;&#x3042;&#x308A;&#x3067;&#x3059;&#x306D;&#x3002;</p>
<h2 id="&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x767B;&#x58C7;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;"><a href="#&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x767B;&#x58C7;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;" class="headerlink" title="&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x767B;&#x58C7;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;"></a>&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x767B;&#x58C7;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;</h2><p>Redmine&#x306B;Lychee&#x3092;&#x304B;&#x3051;&#x5408;&#x308F;&#x305B;&#x3066;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x306F;&#x3001;&#x300C;&#x5358;&#x306B;&#x4FBF;&#x5229;&#x3060;&#x304B;&#x3089;&#x300D;&#x3068;&#x3044;&#x3046;&#x7406;&#x7531;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x54C1;&#x8CEA;&#x7BA1;&#x7406;&#x306E;&#x4E00;&#x74B0;&#x3068;&#x3057;&#x3066;&#x5FC5;&#x8981;&#x306A;&#x6A5F;&#x80FD;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x305D;&#x308C;&#x306A;&#x308A;&#x306E;&#x3053;&#x3060;&#x308F;&#x308A;&#x3084;&#x30B3;&#x30C4;&#x3082;&#x3042;&#x3063;&#x305F;&#x3053;&#x3068;&#x3082;&#x3042;&#x308A;&#x3001;&#x4E8B;&#x4F8B;&#x7D39;&#x4ECB;&#x81EA;&#x4F53;&#x306F;&#x554F;&#x984C;&#x306A;&#x304B;&#x3063;&#x305F;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x679C;&#x305F;&#x3057;&#x3066;&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x306B;&#x3075;&#x3055;&#x308F;&#x3057;&#x3044;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;&#x306A;&#x306E;&#x304B;&#xFF1F;&#xFF1F;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x975E;&#x5E38;&#x306B;&#x5FC3;&#x914D;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<p>&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x3001;&#x5982;&#x4F55;&#x306B;&#x81EA;&#x7531;&#x306B;&#x5927;&#x7A7A;&#x3092;&#x98DB;&#x3073;&#x307E;&#x308F;&#x308C;&#x308B;&#x304B;&#xFF1F;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3092;&#x8FFD;&#x53CA;&#x3057;&#x3066;&#x3044;&#x308B;&#x4EBA;&#x7A2E;&#x306B;&#x9055;&#x3044;&#x306A;&#x3044;&#x3002;</p>
<p>&#x5927;&#x7A7A;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x5236;&#x7D04;&#x306E;&#x306A;&#x3044;&#x4E16;&#x754C;&#x3060;&#x3068;&#x601D;&#x3046;&#x306E;&#x3067;&#x3001;&#x79C1;&#x306E;&#x3088;&#x3046;&#x306A;&#x300C;&#x54C1;&#x8CEA;&#x7BA1;&#x7406;&#x300D;&#x306A;&#x3093;&#x3066;&#x3082;&#x306E;&#x306F;&#x300C;&#x5236;&#x7D04;&#x4E07;&#x6B73;&#x300D;&#x306B;&#x8133;&#x5185;&#x5909;&#x63DB;&#x3055;&#x308C;&#x3066;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#x306A;&#x30FC;&#x3068;&#x601D;&#x3046;&#x308F;&#x3051;&#x3067;&#x3059;&#x3002;</p>
<p>&#x305F;&#x3060;&#x3057;&#x3001;&#x5F15;&#x304D;&#x53D7;&#x3051;&#x305F;&#x4EE5;&#x4E0A;&#x306F;&#x3084;&#x308A;&#x304D;&#x308B;&#x306E;&#x304C;&#x30D3;&#x30B8;&#x30CD;&#x30B9;&#x30D1;&#x30FC;&#x30BD;&#x30F3;&#x306E;&#x77DC;&#x6301;&#x3002;</p>
<p>&#x4FA1;&#x5024;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x76F8;&#x624B;&#x306B;&#x3088;&#x3063;&#x3066;&#x5909;&#x308F;&#x308B;&#x306E;&#x3067;&#x3001;&#x5B8C;&#x5168;&#x30A2;&#x30A6;&#x30A7;&#x30A4;&#x3067;&#x3042;&#x3063;&#x3066;&#x3082;&#x3001;&#x559C;&#x3093;&#x3067;&#x3082;&#x3089;&#x3048;&#x308B;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;&#x3092;&#x63D0;&#x4F9B;&#x305B;&#x306D;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x30FB;&#x30FB;&#x3002;</p>
<p>&#x4F1A;&#x5834;&#x3082;50&#x4EBA;&#x304F;&#x3089;&#x3044;&#x306A;&#x306E;&#x304B;&#x306A;&#xFF1F;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x305F;&#x3089;200&#x4EBA;&#x304F;&#x3089;&#x3044;&#x306F;&#x5165;&#x308B;&#x304B;&#x306A;&#x308A;&#x3054;&#x7ACB;&#x6D3E;&#x306A;&#x90E8;&#x5C4B;&#x306B;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x3058;&#x308F;&#x3058;&#x308F;&#x3068;&#x8FEB;&#x308B;&#x5F8C;&#x6094;&#x3068;&#x30D7;&#x30EC;&#x30C3;&#x30B7;&#x30E3;&#x30FC;&#x306E;&#x4E2D;&#x3067;&#x5F53;&#x65E5;&#x3092;&#x8FCE;&#x3048;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<h1 id="&#x767A;&#x8868;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;"><a href="#&#x767A;&#x8868;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;" class="headerlink" title="&#x767A;&#x8868;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;"></a>&#x767A;&#x8868;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;</h1><p>&#x5358;&#x306A;&#x308B;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x3092;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x3082;&#x9762;&#x767D;&#x304F;&#x3082;&#x306A;&#x3044;&#x3057;&#x3001;&#x5F79;&#x306B;&#x7ACB;&#x305F;&#x306A;&#x3044;&#x3068;&#x8003;&#x3048;&#x3001;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x306E;&#x4E88;&#x9632;&#x306B;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3092;&#x7D5E;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x306A;&#x305C;&#x306A;&#x3089;&#x3001;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3067;&#x3042;&#x308C;&#x3070;&#x30C1;&#x30E3;&#x30EC;&#x30F3;&#x30B8;&#x3057;&#x3066;&#x308B;&#x306B;&#x9055;&#x3044;&#x306A;&#x3044;<br>&#x2193;<br>&#x30C1;&#x30E3;&#x30EC;&#x30F3;&#x30B8;&#x3057;&#x3066;&#x308B;&#x3068;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x306B;&#x4F1A;&#x3046;&#x78BA;&#x7387;&#x306F;&#x9AD8;&#x3044;&#x306B;&#x9055;&#x3044;&#x306A;&#x3044;<br>&#x2193;<br>&#x307F;&#x3093;&#x306A;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x306F;&#x5ACC;&#x3060;&#x308D;&#x3046;&#x306A;&#x30FC;<br>&#x2193;<br>&#x3058;&#x3083;&#x3042;&#x4E88;&#x9632;&#x51FA;&#x6765;&#x305F;&#x3089;&#x307F;&#x3093;&#x306A;&#x5E78;&#x305B;&#x3060;&#x308D;&#x3046;&#x306A;&#x30FC;&#x3002;&#x305D;&#x3046;&#x3060;&#x305D;&#x3046;&#x3060;&#x30FC;&#x3002;</p>
<p>&#x2026;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3001;&#x300C;Lychee Redmine&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x304C;&#x8A9E;&#x308B;&#xFF01;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x4E88;&#x9632;&#x3068;&#x3057;&#x3066;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x300D;&#x3068;&#x3044;&#x3046;&#x3001;&#x4ECA;&#x898B;&#x308B;&#x3068;&#x5927;&#x3057;&#x3066;&#x30AD;&#x30E3;&#x30C3;&#x30C1;&#x2015;&#x3067;&#x3082;&#x306A;&#x3044;&#x666E;&#x901A;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3067;&#x51FA;&#x9663;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<h1 id="&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;"><a href="#&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;" class="headerlink" title="&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;"></a>&#x5F53;&#x65E5;&#x306E;&#x69D8;&#x5B50;</h1><p>&#x30C7;&#x30D6;&#x30B5;&#x30DF;&#x3060;&#x3051;&#x3042;&#x3063;&#x3066;&#x3001;&#x6765;&#x5834;&#x8005;&#x306E;&#x5927;&#x534A;&#x306F;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3067;&#x3059;&#x3002;&#x30D5;&#x30EA;&#x30FC;&#x30C0;&#x30E0;&#x611F;&#x6F02;&#x3046;&#x53C2;&#x52A0;&#x8005;&#x304C;&#x591A;&#x304F;&#x3001;&#x4F1A;&#x5834;&#x306B;&#x5165;&#x3063;&#x305F;&#x77AC;&#x9593;&#x304B;&#x3089;&#x30A2;&#x30A6;&#x30A7;&#x30A4;&#x3092;&#x6E80;&#x55AB;&#x3002;&#x3046;&#x3080;&#x3002;&#x4E88;&#x60F3;&#x901A;&#x308A;&#x3002;</p>
<p>&#x767B;&#x58C7;&#x8005;&#x306F;&#x5C02;&#x7528;&#x306E;&#x63A7;&#x5BA4;&#x304C;&#x7528;&#x610F;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x9003;&#x3052;&#x8FBC;&#x3080;&#x3088;&#x3046;&#x306B;&#x63A7;&#x5BA4;&#x306B;&#x305F;&#x3069;&#x308A;&#x7740;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3057;&#x304B;&#x3057;&#x3001;&#x63A7;&#x5BA4;&#x306B;&#x3044;&#x3089;&#x3063;&#x3057;&#x3083;&#x3063;&#x305F;&#x4ED6;&#x306E;&#x767B;&#x58C7;&#x8005;&#x306E;&#x65B9;&#x3005;&#x306F;&#x3001;&#x30D5;&#x30EA;&#x30FC;&#x30C0;&#x30E0;&#x306B;&#x4E00;&#x5C64;&#x306E;&#x5E74;&#x5B63;&#x304C;&#x52A0;&#x308F;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x5B9F;&#x306B;&#x5802;&#x3005;&#x305F;&#x308B;&#x98A8;&#x8C8C;&#x3002;&#x5727;&#x5012;&#x3055;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;&#x3080;&#x3080;&#x3002;&#x4E88;&#x60F3;&#x5916;&#x3002;</p>
<p>&#x3053;&#x3053;&#x3067;&#x306F;&#x6C17;&#x6301;&#x3061;&#x304C;&#x843D;&#x3061;&#x7740;&#x304B;&#x306A;&#x3044;&#x306A;&#x30FC;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3001;&#x591A;&#x5C11;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x611F;&#x3092;&#x611F;&#x3058;&#x308B;&#x5C0F;&#x3076;&#x308A;&#x306A;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x63A7;&#x5BA4;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x79C1;&#x306E;&#x524D;&#x306B;&#x8A71;&#x3059;&#x306F;&#x305A;&#x306E;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x793E;&#x9577;&#x304C;&#x306A;&#x304B;&#x306A;&#x304B;&#x6765;&#x5834;&#x3057;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x30CF;&#x30D7;&#x30CB;&#x30F3;&#x30B0;&#x3082;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x30B3;&#x30FC;&#x30D2;&#x30FC;&#x3092;&#x7121;&#x99C4;&#x306B;&#x304A;&#x304B;&#x308F;&#x308A;&#x3057;&#x306A;&#x304C;&#x3089;&#x524D;&#x65E5;&#x307E;&#x3067;&#x63A8;&#x6572;&#x3057;&#x3066;&#x3044;&#x305F;&#x8CC7;&#x6599;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001;&#x767B;&#x58C7;&#x306E;&#x6642;&#x9593;&#x3092;&#x5F85;&#x3061;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x767A;&#x8868;&#x3057;&#x307E;&#x3057;&#x305F;"><a href="#&#x767A;&#x8868;&#x3057;&#x307E;&#x3057;&#x305F;" class="headerlink" title="&#x767A;&#x8868;&#x3057;&#x307E;&#x3057;&#x305F;"></a>&#x767A;&#x8868;&#x3057;&#x307E;&#x3057;&#x305F;</h1><p><img src="/images/20190607/1.jpg" class="img-small-size"></p>
<p>&#x6765;&#x3066;&#x3044;&#x305F;&#x3060;&#x3044;&#x305F;&#x4EBA;&#x306B;&#x3001;&#x4F55;&#x304B;&#x3057;&#x3089;&#x4FA1;&#x5024;&#x3042;&#x308B;&#x3082;&#x306E;&#x3092;&#x6301;&#x3063;&#x3066;&#x5E30;&#x3063;&#x3066;&#x3082;&#x3046;&#x3053;&#x3068;&#x3092;&#x30DF;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x8A2D;&#x5B9A;&#x3057;&#x767B;&#x58C7;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x304C;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306A;&#x3060;&#x3051;&#x306B;&#x3001;&#x3054;&#x6765;&#x5834;&#x306E;&#x65B9;&#x3005;&#x306E;&#x5E74;&#x9F62;&#x5C64;&#x306F;&#x5C11;&#x3057;&#x9AD8;&#x304B;&#x3063;&#x305F;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x3001;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3068;&#x3044;&#x3046;&#x3088;&#x308A;&#x306F;&#x7BA1;&#x7406;&#x8005;&#x306E;&#x4EBA;&#x304C;&#x591A;&#x304B;&#x3063;&#x305F;&#x3088;&#x3046;&#x306A;&#x5370;&#x8C61;&#x3092;&#x53D7;&#x3051;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><iframe src="//www.slideshare.net/slideshow/embed_code/key/KjD1yfZ505Rfzn" width="595" height="485" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" style="border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;" allowfullscreen> </iframe> <div style="margin-bottom:5px"> <strong> <a href="//www.slideshare.net/agileware_jp/4-136539333" title="&#x3010;&#x5C0E;&#x5165;&#x4E8B;&#x4F8B;&#x3011;Lychee Redmine&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x8A9E;&#x308B;&#xFF01;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x4E88;&#x9632;&#x3068;&#x3057;&#x3066;&#x306E;&#x4F7F;&#x3044;&#x65B9;" target="_blank">&#x3010;&#x5C0E;&#x5165;&#x4E8B;&#x4F8B;&#x3011;Lychee Redmine&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x8A9E;&#x308B;&#xFF01;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x4E88;&#x9632;&#x3068;&#x3057;&#x3066;&#x306E;&#x4F7F;&#x3044;&#x65B9;</a> </strong> from <strong><a href="https://www.slideshare.net/agileware_jp" target="_blank">agileware_jp</a></strong> </div></p>
<p><br></p>
<p>&#x5F53;&#x65E5;&#x306E;&#x767A;&#x8868;&#x306E;&#x69D8;&#x5B50;&#x3082;CodeZine&#x69D8;&#x3088;&#x308A;&#x8A18;&#x4E8B;&#x306B;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x307E;&#x3059;&#x3002;<br><a href="https://codezine.jp/article/detail/11427" target="_blank" rel="noopener">https://codezine.jp/article/detail/11427</a></p>
<p>&#x6975;&#x529B;&#x5E73;&#x6613;&#x306A;&#x8A00;&#x8449;&#x3068;&#x3001;&#x30A8;&#x30D4;&#x30BD;&#x30FC;&#x30C9;&#x3092;&#x7E54;&#x308A;&#x4EA4;&#x305C;&#x3066;&#x8A71;&#x3059;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x306E;&#x3067;&#x3001;&#x96C6;&#x4E2D;&#x3057;&#x3066;&#x805E;&#x3044;&#x3066;&#x304F;&#x308C;&#x3066;&#x3044;&#x305F;&#x3088;&#x3046;&#x306B;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5F8C;&#x3067;&#x30C4;&#x30A4;&#x30C3;&#x30BF;&#x30FC;&#x3092;&#x898B;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x6642;&#x9593;&#x304C;&#x8DB3;&#x308A;&#x306A;&#x304F;&#x3066;&#x7701;&#x7565;&#x3057;&#x305F;&#x90E8;&#x5206;&#x306B;&#x3064;&#x3044;&#x3066;&#x3082;&#x3063;&#x3068;&#x805E;&#x304D;&#x305F;&#x3044;&#x3001;&#x3068;&#x3044;&#x3046;&#x3088;&#x3046;&#x306A;&#x58F0;&#x3082;&#x4E0A;&#x304C;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x6982;&#x306D;&#x826F;&#x304B;&#x3063;&#x305F;&#x306E;&#x304B;&#x306A;&#xFF1F;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x58F0;&#x3092;&#x8912;&#x3081;&#x3089;&#x308C;&#x305F;&#x306E;&#x306F;&#x3046;&#x308C;&#x3057;&#x304B;&#x3063;&#x305F;&#x304B;&#x306A;&#xFF3E;&#xFF3E;</p>
<h1 id="&#x611F;&#x60F3;"><a href="#&#x611F;&#x60F3;" class="headerlink" title="&#x611F;&#x60F3;"></a>&#x611F;&#x60F3;</h1><p>&#x4ECA;&#x56DE;&#x3001;&#x30CB;&#x30FC;&#x30BA;&#x306B;&#x3042;&#x3063;&#x3066;&#x3044;&#x305F;&#x306E;&#x304B;&#x3069;&#x3046;&#x304B;&#x304C;&#x6B63;&#x76F4;&#x306A;&#x3068;&#x3053;&#x308D;&#x4E00;&#x756A;&#x306E;&#x4E0D;&#x5B89;&#x3067;&#x3057;&#x305F;&#x3002;<br>&#x3057;&#x304B;&#x3057;&#x3001;&#x3053;&#x3046;&#x3044;&#x3063;&#x305F;&#x5834;&#x306B;&#x51FA;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x81EA;&#x5206;&#x306E;&#x982D;&#x304C;&#x6574;&#x7406;&#x3055;&#x308C;&#x307E;&#x3059;&#x3057;&#x3001;&#x5BA2;&#x89B3;&#x7684;&#x306B;&#x632F;&#x308A;&#x8FD4;&#x308B;&#x3053;&#x3068;&#x304C;&#x51FA;&#x6765;&#x308B;&#x306B;&#x306F;&#x3001;&#x3068;&#x3066;&#x3082;&#x3044;&#x3044;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3060;&#x3063;&#x305F;&#x306A;&#x3068;&#x6539;&#x3081;&#x3066;&#x601D;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x305D;&#x308C;&#x3068;&#x540C;&#x6642;&#x306B;&#x3001;&#x672C;&#x6765;&#x306F;&#x3082;&#x3063;&#x3068;&#x3053;&#x3046;&#x3057;&#x305F;&#x3044;&#x304C;&#x3001;&#x3067;&#x304D;&#x3066;&#x3044;&#x306A;&#x3044;&#x3053;&#x3068;&#x3082;&#x307E;&#x305F;&#x6D6E;&#x304D;&#x5F6B;&#x308A;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5225;&#x306E;&#x65B9;&#x306E;&#x767A;&#x8868;&#x306E;&#x4E2D;&#x3067;&#x3001;&#x300C;&#x7D44;&#x7E54;&#x3092;&#x5909;&#x3048;&#x308B;&#x306B;&#x306F;&#x30EB;&#x30FC;&#x30EB;&#x3068;&#x8A2D;&#x5099;&#x3068;&#x98A8;&#x571F;&#x306E;&#xFF13;&#x3064;&#x304C;&#x5927;&#x4E8B;&#x300D;&#x3001;&#x3068;&#x3044;&#x3063;&#x305F;&#x3053;&#x3068;&#x3092;&#x767A;&#x8A00;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x5FC3;&#x306B;&#x6DF1;&#x304F;&#x7A81;&#x304D;&#x523A;&#x3055;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x98A8;&#x571F;&#x3092;&#x5909;&#x3048;&#x308B;&#x306E;&#x304C;&#x4E00;&#x756A;&#x96E3;&#x6613;&#x5EA6;&#x304C;&#x9AD8;&#x3044;&#x3057;&#x3001;&#x6642;&#x9593;&#x304C;&#x304B;&#x304B;&#x308A;&#x307E;&#x3059;&#x3088;&#x306D;&#x3002;</p>
<p>&#x4ECA;&#x56DE;&#x306E;&#x79C1;&#x304C;&#x767B;&#x58C7;&#x3057;&#x305F;&#x5185;&#x5BB9;&#x3082;&#x3001;&#x30EB;&#x30FC;&#x30EB;&#x3068;&#x8A2D;&#x5099;&#x306B;&#x9650;&#x3063;&#x305F;&#x8A71;&#x3067;&#x3057;&#x305F;&#x306E;&#x3067;&#x3001;&#x6B21;&#x56DE;&#x306F;&#x98A8;&#x571F;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3082;&#x8A71;&#x305B;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>

      
    </div>
  </div>
    
  <!-- シェアボタン START -->
  <div class="social-area">
  <ul class="social-button">

      <!-- twitter -->
      <li class="sc-tw social-button-twitter">
          <a href="https://twitter.com/share" class="twitter-share-button" data-via="future_techblog" data-lang="ja" data-hashtags="future_architect">ツイート</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
      </li>
      
      <!-- Facebookいいね -->
      <li class="social-button-fb">
          <div id="fb-root"></div>
          <script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v2.8";
              fjs.parentNode.insertBefore(js, fjs);
            }(document, 'script', 'facebook-jssdk'));</script>
          <div class="fb-like" data-href="https://future-architect.github.io/articles/20190607/" data-layout="button_count" data-action="like" data-size="small" data-show-faces="true" data-share="true"></div>
      </li>

      <!-- はてなブックマーク -->
      <li class="social-button-hatebu"><a href="http://b.hatena.ne.jp/entry/https://future-architect.github.io/articles/20190607/" class="hatena-bookmark-button" data-hatena-bookmark-layout="standard-balloon" data-hatena-bookmark-lang="ja" title="このエントリーをはてなブックマークに追加"><img src="https://b.st-hatena.com/images/entry-button/button-only@2x.png" alt="このエントリーをはてなブックマークに追加" width="20" height="20" style="border: none;"></a><script type="text/javascript" src="https://b.st-hatena.com/js/bookmark_button.js" charset="utf-8" async="async"></script></li>

      <!-- pocket -->
      <li class="social-button-pocket"><a data-pocket-label="pocket" data-pocket-count="horizontal" class="pocket-btn" data-lang="en"></a>
          <script type="text/javascript">!function(d,i){if(!d.getElementById(i)){var j=d.createElement("script");j.id=i;j.src="https://widgets.getpocket.com/v1/j/btn.js?v=1";var w=d.getElementById(i);d.body.appendChild(j);}}(document,"pocket-btn-js");</script>
      </li>

  </ul>
  </div>
<!-- シェアボタン END -->


  
    
<nav id="article-nav">
  
    <a href="/articles/20190610/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          ソースコードを綺麗にするためにまず心がけたい３点
        
      </div>
    </a>
  
  
    <a href="/articles/20190604/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">OpenCensus(OpenTelemetry)とは</div>
    </a>
  
</nav>

  
  <br>
</article>

</div>
<div class="col-md-3 col-sm-3 blog-sidebar">
  <!-- CATEGORIES START -->
<h2 class="margin-top-30">Categories</h2>

<div class="widget-wrap">
  <div class="widget">
    <ul class="nav sidebar-categories margin-bottom-40">
      
	<li>
	  <a href="/categories/Culture/">Culture (21)</a>
	</li>
      
	<li>
	  <a href="/categories/IoT/">IoT (6)</a>
	</li>
      
	<li>
	  <a href="/categories/VR/">VR (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Security/">Security (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Programming/">Programming (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Design/">Design (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Management/">Management (4)</a>
	</li>
      
	<li>
	  <a href="/categories/Infrastructure/">Infrastructure (11)</a>
	</li>
      
	<li>
	  <a href="/categories/DB/">DB (5)</a>
	</li>
      
	<li>
	  <a href="/categories/DataScience/">DataScience (14)</a>
	</li>
      
    </ul>
  </div>
</div>


<!-- CATEGORIES END -->

<!-- BEGIN FEATURED POSTS -->
<h2>Featured Posts</h2>
<div class="recent-news margin-bottom-10">
  
  
    
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190612/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                TypeScript教育用コンテンツ公開のお知らせ
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190610/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                ソースコードを綺麗にするためにまず心がけたい３点
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190604/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                OpenCensus(OpenTelemetry)とは
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190513/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                第1回PG Battle参戦記
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190422/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                LT Free Style Battle（VS リクルートテクノロジーズ）を開催しました
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
	
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
</div>
<!-- END FEATURED POSTS -->

<!-- START ADVENT CALENDAR -->
<div class="margin-bottom-20">
  <h2>Advent Calendar</h2>
  <div class="widget-wrap">
  <div class="widget">
    <ul class="nav">
      <li>
        <a href="http://qiita.com/advent-calendar/2018/future" target="_blank">2018年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2017/future" target="_blank">2017年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2016/future" target="_blank">2016年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2015/future" target="_blank">2015年</a>
      </li>
    </ul>
  </div>
</div>

</div>
<!-- END ADVENT CALENDAR -->


</div>
</div>

  </section>
</div>

    <!-- BEGIN PRE-FOOTER -->
    <div class="pre-footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN BOTTOM ABOUT BLOCK -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>About Us</h2>
            <p>経営とITをデザインする、フューチャーアーキテクトの技術ブログです。IoTやAI(MachineLearning)・Security・VR・Cloud・BigDataといった内容の記事を中心に、業務で利用する幅広い技術について紹介します。また、OSSへの貢献やカンファレンスなどへの登壇など、フューチャーへのエンジニア文化についてもドシドシ紹介していきますのでぜひウォッチ下さい！<br><br><a href="http://www.future.co.jp/">http://www.future.co.jp/</a></p>
          </div>
          <!-- END BOTTOM ABOUT BLOCK -->

          <!-- BEGIN BOTTOM CONTACTS -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>Contact</h2>
            <address class="margin-bottom-40">
              東京都品川区大崎1-2-2<br>
              アートヴィレッジ大崎セントラルタワー<br><br>
              Email: <a href="mailto:techblog@future.co.jp">techblog@future.co.jp</a><br>
            </address>
          </div>
          <!-- END BOTTOM CONTACTS -->

	
          <!-- BEGIN TWITTER BLOCK -->
    <div class="col-md-4 col-sm-6 pre-footer-col">

    <!-- Twitterフォローボタン -->
    <a href="https://twitter.com/future_techblog" class="twitter-follow-button" data-show-count="false" data-lang="ja">/future_techblogさんをフォロー</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>

	  <a data-tweet-limit="1" class="twitter-timeline" href="https://twitter.com/future_techblog" data-widget-id="732749663766372354">Tweets by @future_techblog</a>

	  <script>!function(d,s,id){var
	  js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+"://platform.twitter.com/widgets.js";fjs.parentNode.insertBefore(js,fjs);}}(document,"script","twitter-wjs");</script>

          </div>
          <!-- END TWITTER BLOCK -->
	
        </div>
      </div>
    </div>
    <!-- END PRE-FOOTER -->

    <!-- BEGIN FOOTER -->
    <div class="footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN COPYRIGHT -->
          <div class="col-md-6 col-sm-6 padding-top-10">
                  &copy; 2019 Future Tech Blog - フューチャーアーキテクト<br>
 <!-- <a href="javascript:;">Privacy Policy</a> | <a href="javascript:;">Terms of Service</a> -->
          </div>
          <!-- END COPYRIGHT -->
	  <!-- BEGIN SOCIAL -->
<div class="col-md-6 col-sm-6">
  <ul class="social-footer list-unstyled list-inline pull-right">
    
      
      <li><a href="https://github.com/future-architect"><i class="fa fa-github"></i></a></li>
      
  
      
      <li><a href="https://twitter.com/future_techblog"><i class="fa fa-twitter"></i></a></li>
      
  
      
      <li><a href="https://www.facebook.com/future.saiyo"><i class="fa fa-facebook"></i></a></li>
      
  
      
      <li>
        <a href="http://qiita.com/organizations/future">
            <i class="fa fa-pencil-square-o"></i>
        </a>
      </li>
      
  
      
      <li><a href="/atom.xml"><i class="fa fa-rss"></i></a></li>
      
  
  </ul>
</div>
<!-- END SOCIAL -->

        </div>
      </div>
    </div>
    <!-- END FOOTER -->

  <!-- BEGIN CORE PLUGINS (REQUIRED FOR ALL PAGES) -->
<!--[if lt IE 9]>
<script src="/metronic/assets/plugins/respond.min.js"></script>
<![endif]-->
<script src="/metronic/assets/plugins/jquery.min.js"></script>
<script src="/metronic/assets/plugins/jquery-migrate.min.js"></script>
<script src="/metronic/assets/plugins/bootstrap/js/bootstrap.min.js"></script>
<script src="/metronic/assets/corporate/scripts/back-to-top.js"></script>
<script src="/metronic/assets/corporate/scripts/layout.js"></script>
<script src="/js/script.js"></script>

<script type="text/javascript">
    jQuery(document).ready(function() {
        Layout.init();
        Layout.initTwitter();
        Layout.initFixHeaderWithPreHeader(); /* Switch On Header Fixing (only if you have pre-header) */
        Layout.initNavScrolling();
    });
</script>
<!-- END CORE PLUGINS -->
<!-- START INTEGRATIONS -->

<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74047147-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


<!-- END INTEGRATIONS --><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</body>
</html>
