<!DOCTYPE html>
<!--[if IE 8]> <html lang="ja" class="ie8 no-js"> <![endif]-->
<!--[if IE 9]> <html lang="ja" class="ie9 no-js"> <![endif]-->
<!--[if !IE]><!-->
<html lang="ja">
<!--<![endif]-->
<head><meta name="generator" content="Hexo 3.9.0">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <title>人工知能学会（JSAI2019） 参加報告 | Future Tech Blog - フューチャーアーキテクト</title>

  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

  
  <meta name="description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#xFF01;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x6C34;&amp;#x672C;&amp;#x3068;&amp;#x660E;&amp;#x5B98;&amp;#x3067;&amp;#x3059;">
<meta name="keywords" content="MachineLearning">
<meta property="og:type" content="article">
<meta property="og:title" content="人工知能学会（JSAI2019） 参加報告">
<meta property="og:url" content="https://future-architect.github.io/articles/20190627/index.html">
<meta property="og:site_name" content="Future Tech Blog - フューチャーアーキテクト">
<meta property="og:description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#xFF01;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x6C34;&amp;#x672C;&amp;#x3068;&amp;#x660E;&amp;#x5B98;&amp;#x3067;&amp;#x3059;">
<meta property="og:locale" content="ja">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/1.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/2.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/3.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/4.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/5.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/6.jpg">
<meta property="og:image" content="https://future-architect.github.io/images/20190627/7.jpg">
<meta property="og:updated_time" content="2019-06-27T01:08:22.014Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人工知能学会（JSAI2019） 参加報告">
<meta name="twitter:description" content="&amp;#x306F;&amp;#x3058;&amp;#x3081;&amp;#x306B;&amp;#x307F;&amp;#x306A;&amp;#x3055;&amp;#x3093;&amp;#x3053;&amp;#x3093;&amp;#x306B;&amp;#x3061;&amp;#x306F;&amp;#xFF01;SAIG(Strategic AI Group)&amp;#x306E;&amp;#x6C34;&amp;#x672C;&amp;#x3068;&amp;#x660E;&amp;#x5B98;&amp;#x3067;&amp;#x3059;">
<meta name="twitter:image" content="https://future-architect.github.io/images/20190627/1.jpg">
  
    <link rel="alternative" href="/atom.xml" title="Future Tech Blog - フューチャーアーキテクト" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.ico">
  

  <meta content="人工知能学会（JSAI2019） 参加報告 | Future Tech Blog - フューチャーアーキテクト" name="description">
  <meta content="人工知能学会（JSAI2019） 参加報告,Future Tech Blog - フューチャーアーキテクト,フューチャーアーキテクト,Future Architect,フューチャー,Future,Tech Blog,技術ブログ,技術,ブログ" name="keywords">
  <meta content="Future Architect Consultant" name="author">

  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700|Audiowide|PT+Sans+Narrow|Source+Sans+Pro:200,300,400,600,700,900&amp;subset=all" rel="stylesheet" type="text/css">

  <!-- Global styles START -->
  <link rel="stylesheet" href="/metronic/assets/plugins/font-awesome/css/font-awesome.min.css">
  <link rel="stylesheet" href="/metronic/assets/plugins/bootstrap/css/bootstrap.min.css">
  <!-- Global styles END -->

  <!-- Theme styles START -->
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/style-responsive.css">
  <link rel="stylesheet" href="/metronic/assets/corporate/css/themes/custom.css">
  <link rel="stylesheet" href="/css/theme-styles.css">
  <!-- Theme styles END --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>
</html>
<body class="corporate">
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- BEGIN HEADER -->
<div class="header">
	<div class="header-overlay">
		<!--<a class="site-logo" href="/" id="logo">Future Tech Blog - フューチャーアーキテクト</a>-->
		<div class="header-menu">
			<a class="site-logo" href="/">
				<img src="/metronic/assets/corporate/img/site_logo.png" alt="logo" class="logo-img">
			</a>
			<a href="javascript:void(0);" class="mobi-toggler"><i class="fa fa-bars"></i></a>
			<!-- BEGIN NAVIGATION -->
			<div class="header-navigation pull-right font-transform-inherit">
				<ul>
					
					<li class="">
						<a href="/"><i class="fa fa-home"></i>Home</a>
					</li>
					
					<li class="">
						<a href="/articles/"><i class="fa fa-newspaper-o"></i>Blog</a>
					</li>
					
					<li class="">
						<a href="https://github.com/future-architect"><i class="fa fa-github"></i>GitHub</a>
					</li>
					
					<li class="">
						<a href="http://qiita.com/organizations/future"><i class="fa fa-users"></i>Qiita</a>
					</li>
					
					<!-- BEGIN TOP SEARCH -->
					<li class="menu-search">
						<span class="sep"></span>
						<i class="fa fa-search search-btn"></i>
						<div class="search-box">
							<form action="#" class="googleSearch" onsubmit="googleSearch();">
								<div class="input-group">
									<input type="text" placeholder="Search" class="form-control">
									<span class="input-group-btn">
										<button class="btn btn-primary" type="submit">Search</button>
									</span>
								</div>
							</form>
						</div>
					</li>
					<!-- END TOP SEARCH -->
				</ul>
			</div>
		</div>
		<!-- END NAVIGATION -->
		<div class="header-title">Tech Blog</div>
        <div class="header-title-sub">フューチャーアーキテクト開発者ブログ</div>
	</div>
</div>
<!-- Header END -->

  <div class="container">
  <ul class="breadcrumb">
    <li><a href="/">Home</a></li>
    <li><a href="/articles/">Blog</a></li>
    <li class="active">Post</li>
  </ul>
  <section id="main">
    
    <h2 itemprop="name">
      <a class="article-title" href="/articles/20190627/">人工知能学会（JSAI2019） 参加報告</a>
    </h2>


    <div class="row">
<div class="col-md-9 col-sm-9 blog-posts">
<article id="post-20190627-JSAI2019" class="article article-type-post blog-item" itemscope itemprop="blogPost">
  <div class="article-meta">
  </div>
  <div class="article-inner">
    
    <header class="article-header">
      <ul class="blog-info">
	<li><i class="fa fa-user"></i> 水本と明官</li>
	<li><i class="fa fa-calendar"></i>
	  <time datetime="2019-06-26T23:13:03.000Z" itemprop="datePublished">2019/06/27</time>

	</li>

    <li class="hidden-xs"><i class="fa fa-tags"></i>
	  
  
    <a href="/tags/MachineLearning/" title="MachineLearning">MachineLearning</a>
  


	</li>
      </ul>
      
  <div class="article-category">
    
    Category: 
    
    Categories:
    <a class="article-category-link" href="/categories/DataScience/">DataScience</a>
  </div>
  <br>


    </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="&#x306F;&#x3058;&#x3081;&#x306B;"><a href="#&#x306F;&#x3058;&#x3081;&#x306B;" class="headerlink" title="&#x306F;&#x3058;&#x3081;&#x306B;"></a>&#x306F;&#x3058;&#x3081;&#x306B;</h1><p>&#x307F;&#x306A;&#x3055;&#x3093;&#x3053;&#x3093;&#x306B;&#x3061;&#x306F;&#xFF01;SAIG(Strategic AI Group)&#x306E;&#x6C34;&#x672C;&#x3068;&#x660E;&#x5B98;&#x3067;&#x3059;&#xFF01;<br>2019&#x5E74;6&#x6708;4&#x65E5;(&#x706B;)&#x301C;6&#x6708;7&#x65E5;(&#x91D1;)&#x306B;&#x958B;&#x50AC;&#x3055;&#x308C;&#x305F;<a href="https://www.ai-gakkai.or.jp/jsai2019/" target="_blank" rel="noopener">&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#xFF08;JSAI2019)</a>&#x306B;SAIG&#x3067;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x306E;&#x3067;&#x5831;&#x544A;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x30D5;&#x30E5;&#x30FC;&#x30C1;&#x30E3;&#x30FC;&#x306F;2017&#x5E74;&#x304B;&#x3089;JSAI&#x306E;&#x30D7;&#x30E9;&#x30C1;&#x30CA;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x3068;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x4ECA;&#x5E74;&#x3082;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x30D6;&#x30FC;&#x30B9;&#x306E;&#x51FA;&#x5C55;&#x3001;&#x30A4;&#x30F3;&#x30C0;&#x30B9;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306E;&#x767A;&#x8868;&#x3092;&#x884C;&#x306A;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x307E;&#x305F;&#x3001;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x30D6;&#x30FC;&#x30B9;&#x51FA;&#x5C55;&#x306E;&#x5408;&#x9593;&#x3092;&#x7E2B;&#x3063;&#x3066;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;&#x3082;&#x884C;&#x306A;&#x3063;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;<br><img src="/images/20190627/1.jpg" width="60%"></p>
<p>&#x4ECA;&#x5E74;&#x306E;JSAI&#x306F;&#x65B0;&#x6F5F;&#x770C;&#x306E;&#x6731;&#x9DFA;&#x30E1;&#x30C3;&#x30BB;&#x3067;&#x958B;&#x50AC;&#x3055;&#x308C;&#x307E;&#x3057;&#x305F;&#x3002;&#x6771;&#x4EAC;&#x304B;&#x3089;&#x3060;&#x3068;&#x65B0;&#x6F5F;&#x99C5;&#x307E;&#x3067;2&#x6642;&#x9593;&#x7A0B;&#x5EA6;&#x3001;&#x65B0;&#x6F5F;&#x99C5;&#x304B;&#x3089;&#x6731;&#x9DFA;&#x30E1;&#x30C3;&#x30BB;&#x307E;&#x3067;20&#x5206;&#x307B;&#x3069;&#x306E;&#x6BD4;&#x8F03;&#x7684;&#x53C2;&#x52A0;&#x3057;&#x3084;&#x3059;&#x3044;&#x7ACB;&#x5730;&#x3067;&#x3057;&#x305F;&#x3002;&#x3042;&#x308A;&#x304D;&#x305F;&#x308A;&#x3067;&#x3059;&#x304C;&#x3001;&#x304A;&#x3044;&#x3057;&#x3044;&#x65E5;&#x672C;&#x9152;&#x3068;&#x304A;&#x7C73;&#x304C;&#x5370;&#x8C61;&#x7684;&#x3067;&#x3057;&#x305F;&#xFF08;&#x4E0B;&#x306E;&#x5199;&#x771F;&#x306F;&#x53C2;&#x52A0;&#x8005;&#x4EA4;&#x6D41;&#x4F1A;&#x3067;&#x51FA;&#x305F;&#x65E5;&#x672C;&#x9152;&#x306E;<strong>&#x307B;&#x3093;&#x306E;</strong>&#x4E00;&#x90E8;&#xFF09;&#x3002;<br><img src="/images/20190627/2.jpg" width="60%"></p>
<h1 id="&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x3068;&#x306F;"><a href="#&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x3068;&#x306F;" class="headerlink" title="&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x3068;&#x306F;"></a>&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x3068;&#x306F;</h1><p>&#x4ECA;&#x5E74;&#x3067;33&#x56DE;&#x76EE;&#x306E;&#x958B;&#x50AC;&#x3067;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD; (AI)&#x306E;&#x7814;&#x7A76;&#x767A;&#x8868;&#x3092;&#x884C;&#x3046;&#x5B66;&#x4F1A;&#x3067;&#x3001;&#x6A5F;&#x68B0;&#x5B66;&#x7FD2;&#x304B;&#x3089;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x306E;&#x5FDC;&#x7528;&#x306E;&#x8A71;&#x307E;&#x3067;&#x5E45;&#x5E83;&#x304F;&#x767A;&#x8868;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4E00;&#x822C;&#x53E3;&#x982D;&#x767A;&#x8868;&#x3001;&#x30A4;&#x30F3;&#x30BF;&#x30E9;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#xFF08;&#x30DD;&#x30B9;&#x30BF;&#x30FC;&#x767A;&#x8868;&#xFF09;&#x3001;&#x30C6;&#x30FC;&#x30DE;&#x306B;&#x6CBF;&#x3063;&#x305F;&#x767A;&#x8868;&#x3092;&#x884C;&#x3046;&#x30AA;&#x30FC;&#x30AC;&#x30CA;&#x30A4;&#x30BA;&#x30C9;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3084;&#x4F01;&#x753B;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3001;&#x4F01;&#x696D;&#x306E;&#x65B9;&#x304C;&#x4E8B;&#x4F8B;&#x7D39;&#x4ECB;&#x306A;&#x3069;&#x3092;&#x884C;&#x3046;&#x30A4;&#x30F3;&#x30C0;&#x30B9;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306A;&#x3069;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3067;&#x767A;&#x8868;&#x4F1A;&#x5834;&#x3082;15&#x4F1A;&#x5834;&#x7A0B;&#x5EA6;&#x3042;&#x308A;&#x3001;&#x3069;&#x306E;&#x767A;&#x8868;&#x3092;&#x805E;&#x304D;&#x306B;&#x884C;&#x304F;&#x304B;&#x6C7A;&#x3081;&#x308B;&#x306E;&#x3082;&#x5927;&#x5909;&#x306A;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x6570;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;SAIG&#x306E;&#x8C9E;&#x5149;/&#x6C34;&#x672C;&#x306F;&#x3053;&#x306E;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x306E;&#x904B;&#x55B6;&#x59D4;&#x54E1;&#x3082;&#x3084;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x5B66;&#x4F1A;&#x4E2D;&#x306B;&#x305D;&#x3061;&#x3089;&#x306E;&#x4ED5;&#x4E8B;&#x3082;&#x884C;&#x3063;&#x3066;&#x304A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x5B66;&#x4F1A;&#x5168;&#x56FD;&#x5927;&#x4F1A;&#x306F;&#x3053;&#x3053;&#x6570;&#x5E74;&#x3067;&#x3055;&#x3089;&#x306B;&#x898F;&#x6A21;&#x304C;&#x62E1;&#x5927;&#x3057;&#x3066;&#x304D;&#x3066;&#x304A;&#x308A;&#x3001;2017&#x5E74;&#x306B;&#x306F;2,561&#x4EBA;&#x3067;&#x3042;&#x3063;&#x305F;&#x6765;&#x5834;&#x8005;&#x6570;&#x306F;&#x3001;2018&#x5E74;&#x306B;&#x306F;2,611&#x4EBA;&#x3001;&#x4ECA;&#x56DE;&#x306E;2019&#x5E74;&#x306B;&#x306F;2,897&#x4EBA;&#x3068;&#x9806;&#x8ABF;&#x306B;&#x5897;&#x52A0;&#x3057;&#x3066;&#x304A;&#x308A;&#x767A;&#x8868;&#x7533;&#x3057;&#x8FBC;&#x307F;&#x4EF6;&#x6570;&#x3082;750&#x4EF6;&#x7A0B;&#x3042;&#x3063;&#x305F;&#x305D;&#x3046;&#x3067;&#x3059;&#x3002;&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x6570;&#x3082;&#x3001;2017&#x5E74;&#x304B;&#x3089;55&#x793E;&#x3001;68&#x793E;&#x3001;90&#x793E;&#x3068;&#x5897;&#x52A0;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x307E;&#x305F;&#x3001;&#x5B66;&#x4F1A;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;&#x91CF;&#x304B;&#x3089;&#x8CEA;&#x3078;&#x306E;&#x8EE2;&#x63DB;&#x3092;&#x76EE;&#x6307;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x67FB;&#x8AAD;&#x4ED8;&#x304D;&#x306E;&#x56FD;&#x969B;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x958B;&#x50AC;&#x3059;&#x308B;&#x306A;&#x3069;&#x3001;&#x65B0;&#x3057;&#x3044;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x306B;&#x7A4D;&#x6975;&#x7684;&#x306A;&#x69D8;&#x5B50;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<h1 id="&#x30D6;&#x30FC;&#x30B9;&#x306E;&#x7D39;&#x4ECB;"><a href="#&#x30D6;&#x30FC;&#x30B9;&#x306E;&#x7D39;&#x4ECB;" class="headerlink" title="&#x30D6;&#x30FC;&#x30B9;&#x306E;&#x7D39;&#x4ECB;"></a>&#x30D6;&#x30FC;&#x30B9;&#x306E;&#x7D39;&#x4ECB;</h1><p>&#x4F01;&#x696D;&#x30D6;&#x30FC;&#x30B9;&#x3067;&#x306F;&#x3001;Future&#x3067;&#x306E;AI&#x6848;&#x4EF6;&#x5B9F;&#x7E3E;&#x3092;&#x5C55;&#x793A;&#x3057;&#x3001;&#x5B66;&#x751F;&#x3055;&#x3093;&#x3084;&#x4F01;&#x696D;&#x306E;&#x65B9;&#x3068;&#x306E;&#x8B70;&#x8AD6;&#x304C;&#x5927;&#x5909;&#x76DB;&#x308A;&#x4E0A;&#x304C;&#x308A;&#x307E;&#x3057;&#x305F;&#xFF01;<br>&#x30CE;&#x30D9;&#x30EB;&#x30C6;&#x30A3;&#x3068;&#x3057;&#x3066;&#x914D;&#x5E03;&#x3057;&#x305F;Future&#x30AA;&#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x6B6F;&#x30D6;&#x30E9;&#x30B7;&#x3082;&#x5927;&#x597D;&#x8A55;&#x3067;&#x3057;&#x305F;&#x3002;<br><img src="/images/20190627/3.jpg" width="60%"></p>
<h1 id="&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;"><a href="#&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;" class="headerlink" title="&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;"></a>&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x8074;&#x8B1B;</h1><p>&#x30B9;&#x30DD;&#x30F3;&#x30B5;&#x30FC;&#x30D6;&#x30FC;&#x30B9;&#x51FA;&#x5C55;&#x306E;&#x5408;&#x9593;&#x3092;&#x7E2B;&#x3063;&#x3066;&#x8074;&#x8B1B;&#x3057;&#x305F;&#x53E3;&#x982D;&#x767A;&#x8868;&#x3001;&#x30A4;&#x30F3;&#x30BF;&#x30E9;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#xFF08;&#x30DD;&#x30B9;&#x30BF;&#x30FC;&#x767A;&#x8868;&#xFF09;&#x304B;&#x3089;&#x72EC;&#x65AD;&#x3068;&#x504F;&#x898B;&#x3067;&#x304A;&#x3082;&#x3057;&#x308D;&#x3044;&#x3068;&#x601D;&#x3063;&#x305F;&#x3082;&#x306E;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/3Rin2-40/public/pdf?type=in" target="_blank" rel="noopener">[3Rin2-40] &#x6F5C;&#x5728;&#x7684;&#x306A;&#x65C5;&#x884C;&#x8005;&#x3078;&#x306E;&#x5BBF;&#x6CCA;&#x65BD;&#x8A2D;&#x306E;&#x63D0;&#x6848;&#xAD;&#xAD;&#xFF08;&#x4E38;&#x5C71;&#x3089;&#xFF09;</a><br>&#x3053;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x5BBF;&#x6CCA;&#x65BD;&#x8A2D;&#x306E;&#x63D0;&#x6848;&#x306E;&#x305F;&#x3081;&#x306B;&#x30E6;&#x30FC;&#x30B6;&#x306E;&#x8DEF;&#x7DDA;&#x691C;&#x7D22;&#x306E;&#x5C65;&#x6B74;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;&#x5177;&#x4F53;&#x7684;&#x306B;&#x306F;&#x8DEF;&#x7DDA;&#x691C;&#x7D22;&#x3067;100km&#x4EE5;&#x4E0A;&#x306E;&#x79FB;&#x52D5;&#x304C;&#x3042;&#x308B;&#x691C;&#x7D22;&#x3092;&#x884C;&#x306A;&#x3063;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x30DB;&#x30C6;&#x30EB;&#x3082;&#x60C5;&#x5831;&#x3092;&#x30E1;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x3068;&#x8A00;&#x3063;&#x305F;&#x672C;&#x5F53;&#x306B;&#x5358;&#x7D14;&#x306A;&#x65B9;&#x6CD5;&#x3067;&#x3059;&#x3002;&#x691C;&#x8A3C;&#x3067;&#x306F;&#x3001;&#x79FB;&#x52D5;&#x8DDD;&#x96E2;&#x304C;&#x9577;&#x304F;&#x3001;&#x304B;&#x3064;&#x8DEF;&#x7DDA;&#x691C;&#x7D22;&#x306E;&#x6307;&#x5B9A;&#x65E5;&#x6642;&#x304C;&#x9060;&#x3044;&#x307B;&#x3069;&#x30E1;&#x30FC;&#x30EB;&#x306B;&#x3088;&#x3063;&#x3066;&#x30DB;&#x30C6;&#x30EB;&#x306E;&#x4E88;&#x7D04;&#x3092;&#x3059;&#x308B;&#x30E6;&#x30FC;&#x30B6;&#x304C;&#x591A;&#x304F;&#x306A;&#x308B;&#x3068;&#x3044;&#x3063;&#x305F;&#x7D50;&#x679C;&#x304C;&#x5F97;&#x3089;&#x308C;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x4E00;&#x898B;&#x5F53;&#x305F;&#x308A;&#x524D;&#x306E;&#x3088;&#x3046;&#x3067;&#x3059;&#x304C;&#x3001;&#x69D8;&#x3005;&#x306A;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x4E00;&#x793E;&#x3067;&#x6271;&#x3063;&#x3066;&#x3044;&#x308B;&#x5F37;&#x307F;&#x3068;&#x3082;&#x8A00;&#x3048;&#x5927;&#x5909;&#x8208;&#x5473;&#x6DF1;&#x304B;&#x3063;&#x305F;&#x3067;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;&#x5FDC;&#x7528;&#x7684;&#x306B;&#x306F;&#x30DB;&#x30C6;&#x30EB;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x30EC;&#x30B9;&#x30C8;&#x30E9;&#x30F3;&#x306E;&#x63D0;&#x6848;&#x306A;&#x3069;&#x3068;&#x3082;&#x76F8;&#x4E92;&#x306B;&#x60C5;&#x5831;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x305D;&#x3046;&#x306A;&#x305F;&#x3081;&#x4ECA;&#x5F8C;&#x306B;&#x671F;&#x5F85;&#x3057;&#x305F;&#x3044;&#x767A;&#x8868;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/2H4-E-2-03/public/pdf?type=in" target="_blank" rel="noopener">[2H4-E-2-03] &#x6F5C;&#x5728;&#x7684;&#x306A;&#x8AC7;&#x8A71;&#x69CB;&#x9020;&#x3092;&#x6349;&#x3048;&#x305F;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x6587;&#x66F8;&#x306E;&#x6559;&#x5E2B;&#x306A;&#x3057;&#x30D8;&#x30C3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x751F;&#x6210;&#xFF08;&#x78EF;&#x6CBC;&#x3089;&#xFF09;</a><br>&#x4ECA;&#x5E74;&#x306E;JSAI&#x304B;&#x3089;&#x59CB;&#x307E;&#x3063;&#x305F;&#x56FD;&#x969B;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x767A;&#x8868;&#x3055;&#x308C;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x306E;&#x30D8;&#x30C3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x751F;&#x6210;&#x304C;&#x4E3B;&#x6D41;&#x3067;&#x3059;&#x304C;&#x3001;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x3067;&#x3084;&#x308B;&#x306B;&#x306F;&#x30C7;&#x30FC;&#x30BF;&#x91CF;&#x3082;&#x5FC5;&#x8981;&#x3067;&#x304B;&#x3064;&#x30C9;&#x30E1;&#x30A4;&#x30F3;&#x3082;&#x63C3;&#x3048;&#x306A;&#x3044;&#x3068;&#x96E3;&#x3057;&#x3044;&#x3068;&#x3044;&#x3063;&#x305F;&#x554F;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x554F;&#x984C;&#x3092;&#x89E3;&#x6C7A;&#x3059;&#x308B;&#x624B;&#x6BB5;&#x3068;&#x3057;&#x3066;&#x3053;&#x306E;&#x8AD6;&#x6587;&#x3067;&#x306F;&#x30D8;&#x30C3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x751F;&#x6210;&#x3092;&#x6559;&#x5E2B;&#x306A;&#x3057;&#x3067;&#x884C;&#x3046;&#x624B;&#x6CD5;&#x3092;&#x63D0;&#x6848;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x8AC7;&#x8A71;&#x69CB;&#x9020;&#x3092;&#x8003;&#x3048;&#x305F;&#x6642;&#x306B;&#x3001;&#x5B50;&#x306E;&#x6587;&#x306F;&#x89AA;&#x306E;&#x6587;&#x306B;&#x95A2;&#x3059;&#x308B;&#x8FFD;&#x52A0;&#x60C5;&#x5831;&#x304C;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x3001;&#x30EB;&#x30FC;&#x30C8;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x826F;&#x3044;&#x30B5;&#x30DE;&#x30EA;&#x30FC;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3068;&#x3044;&#x3046;&#x4EEE;&#x5B9A;&#x3092;&#x304A;&#x3044;&#x305F;&#x624B;&#x6CD5;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3064;&#x307E;&#x308A;&#x3001;&#x5B50;&#x306E;&#x6587;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x89AA;&#x306E;&#x6587;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x5B66;&#x7FD2;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x8981;&#x7D04;&#x306B;&#x306A;&#x308B;&#x6587;&#x3092;&#x751F;&#x6210;&#x3057;&#x3088;&#x3046;&#x3068;&#x3044;&#x3046;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x5B9F;&#x9A13;&#x306E;&#x7D50;&#x679C;&#x3001;&#x5168;&#x4F53;&#x306E;&#x6027;&#x80FD;&#x3067;&#x306F;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x624B;&#x6CD5;&#x306B;&#x53CA;&#x3070;&#x306A;&#x3044;&#x7D50;&#x679C;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B;&#x6587;&#x304C;&#x591A;&#x3044;&#x5834;&#x5408;&#x306F;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x624B;&#x6CD5;&#x3068;&#x540C;&#x3058;&#x7A0B;&#x5EA6;&#x3082;&#x3057;&#x304F;&#x306F;&#x4E0A;&#x56DE;&#x308B;&#x6027;&#x80FD;&#x3068;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x5927;&#x5909;&#x8208;&#x5473;&#x6DF1;&#x3044;&#x7D50;&#x679C;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x5B9F;&#x969B;&#x306E;&#x51FA;&#x529B;&#x4F8B;&#x3092;&#x898B;&#x308B;&#x3068;&#x3001;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x5B66;&#x7FD2;&#x3067;&#x306F;&#x540D;&#x8A5E;&#x53E5;&#x306E;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x6559;&#x5E2B;&#x306A;&#x3057;&#x306E;&#x65B9;&#x3067;&#x306F;&#x3061;&#x3083;&#x3093;&#x3068;&#x3057;&#x305F;&#x6587;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x304C;&#x7279;&#x5FB4;&#x7684;&#x3067;&#x3059;(&#x30D8;&#x30C3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3068;&#x3057;&#x3066;&#x6587;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x304B;&#x306F;&#x308F;&#x304B;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;)&#x3002;&#x30E2;&#x30C1;&#x30D9;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3042;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;&#x30C9;&#x30E1;&#x30A4;&#x30F3;&#x306E;&#x9055;&#x3046;&#x30C7;&#x30FC;&#x30BF;&#x3067;&#x5B66;&#x7FD2;&#x3057;&#x305F;&#x5834;&#x5408;&#x306E;&#x6559;&#x5E2B;&#x3042;&#x308A;&#x306E;&#x7D50;&#x679C;&#x3068;&#x6BD4;&#x8F03;&#x3057;&#x305F;&#x3089;&#x3069;&#x3046;&#x306A;&#x306E;&#x304B;&#x3068;&#x3044;&#x3046;&#x306E;&#x3082;&#x6C17;&#x306B;&#x306A;&#x308B;&#x3068;&#x3053;&#x308D;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x7814;&#x7A76;&#x306F;&#x81EA;&#x7136;&#x8A00;&#x8A9E;&#x51E6;&#x7406;&#x306E;&#x30C8;&#x30C3;&#x30D7;&#x56FD;&#x969B;&#x4F1A;&#x8B70;&#x3067;&#x3082;&#x3042;&#x308B;ACL&#x306B;&#x63A1;&#x629E;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x306E;&#x3067;&#x3001;&#x305D;&#x3061;&#x3089;&#x3082;&#x8981;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3067;&#x3059;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/2L5-J-9-02/public/pdf?type=in" target="_blank" rel="noopener">[2L5-J-9-02] &#x7269;&#x8A9E;&#x4E16;&#x754C;&#x9593;&#x306E;&#x3064;&#x306A;&#x304C;&#x308A;&#x304C;&#x4E00;&#x90E8;&#x660E;&#x793A;&#x3055;&#x308C;&#x305F;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x30BB;&#x30C3;&#x30C8;&#x306E;&#x69CB;&#x7BC9;&#xFF08;&#x677E;&#x5409;&#x3089;&#xFF09;</a><br>&#x7269;&#x8A9E;&#x6587;&#x7AE0;&#x306E;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x306B;&#x30B7;&#x30DF;&#x30E5;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x3092;&#x4F7F;&#x3046;&#x3068;&#x3044;&#x3063;&#x305F;&#x304A;&#x3082;&#x3057;&#x308D;&#x3044;&#x7814;&#x7A76;&#x3067;&#x3059;&#x3002;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x81EA;&#x4F53;&#x306F;&#x8457;&#x8005;&#x3089;&#x306E;&#x5148;&#x884C;&#x7814;&#x7A76;<sup id="fnref:1"><a href="#fn:1" rel="footnote">1</a></sup>&#x3067;&#x63D0;&#x6848;&#x3055;&#x308C;&#x305F;&#x3082;&#x306E;&#x3067;&#x3001;&#x3053;&#x306E;&#x7814;&#x7A76;&#x306F;&#x305D;&#x306E;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30C7;&#x30FC;&#x30BF;&#xFF08;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x30BB;&#x30C3;&#x30C8;&#xFF09;&#x3092;&#x62E1;&#x5F35;&#x3057;&#x305F;&#x8A71;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x30B7;&#x30DF;&#x30E5;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x8FF7;&#x8DEF;&#x63A2;&#x7D22;&#x3067;&#x3042;&#x3063;&#x305F;&#x308A;&#x3001;&#x30C1;&#x30A7;&#x30B9;&#x3067;&#x3042;&#x3063;&#x305F;&#x308A;&#x3092;&#x30B7;&#x30DF;&#x30E5;&#x30EC;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x305D;&#x306E;&#x72B6;&#x614B;&#x9077;&#x79FB;&#x306B;&#x57FA;&#x3065;&#x304D;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x306B;&#x3042;&#x308B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x4E8B;&#x8C61;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x6587;&#x3092;&#x751F;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;&#x300C;&#x30C1;&#x30A7;&#x30B9;&#x3067;&#x76F8;&#x624B;&#x306E;&#x30B3;&#x30DE;&#x3092;&#x53D6;&#x308B;&#x300D;&#x69D8;&#x5B50;&#x3092;&#x300C;&#x90E8;&#x5C4B;&#x306E;&#x7269;&#x3092;&#x7247;&#x4ED8;&#x3051;&#x308B;&#x300D;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306B;&#x5199;&#x50CF;&#x3059;&#x308B;&#x3068;&#x3044;&#x3063;&#x305F;&#x5177;&#x5408;&#x3067;&#x3059;&#x3002;&#x90E8;&#x5C4B;&#x306E;&#x7247;&#x4ED8;&#x3051;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x30C1;&#x30A7;&#x30B9;&#x3084;&#x8FF7;&#x8DEF;&#x63A2;&#x7D22;&#x3092;&#x69D8;&#x3005;&#x306A;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3044;&#x308D;&#x3044;&#x308D;&#x306A;&#x7269;&#x8A9E;&#x3092;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x53EF;&#x80FD;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;&#x30C1;&#x30A7;&#x30B9;&#x3084;&#x8FF7;&#x8DEF;&#x63A2;&#x7D22;&#x306A;&#x3069;&#x3092;&#x7D44;&#x307F;&#x308F;&#x305B;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x3001;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x81EA;&#x4F53;&#x306F;&#x7C21;&#x5358;&#x3067;&#x3059;&#x304C;&#x3001;&#x3088;&#x308A;&#x8907;&#x96D1;&#x306A;&#x7269;&#x8A9E;&#x3082;&#x751F;&#x6210;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x7269;&#x8A9E;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x6838;&#x3068;&#x306A;&#x308B;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x30BB;&#x30C3;&#x30C8;&#x306E;&#x69CB;&#x7BC9;&#x3092;&#x3057;&#x3001;&#x30C1;&#x30A7;&#x30B9;&#x3068;&#x8FF7;&#x8DEF;&#x63A2;&#x7D22;&#x306B;&#x3088;&#x308B;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x3092;&#x305D;&#x308C;&#x305E;&#x308C;100&#x500B;&#x305A;&#x3064;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x307E;&#x305F;&#x3001;&#x7269;&#x8A9E;&#x4E16;&#x754C;&#x306E;&#x547C;&#x3073;&#x51FA;&#x3057;&#x3092;&#x884C;&#x3046;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x3082;&#x5B9F;&#x969B;&#x306B;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/2L5-J-9-03/public/pdf?type=in" target="_blank" rel="noopener">[2L5-J-9-03] &#x6A5F;&#x68B0;&#x7FFB;&#x8A33;&#x306B;&#x304A;&#x3051;&#x308B;&#x8A33;&#x8A9E;&#x4E00;&#x8CAB;&#x6027;&#x8A55;&#x4FA1;&#x7528;&#x30C7;&#x30FC;&#x30BF;&#x30BB;&#x30C3;&#x30C8;&#x306E;&#x69CB;&#x7BC9;&#xFF08;&#x963F;&#x90E8;&#x3089;&#xFF09;</a><br>NMT&#x306E;&#x767B;&#x5834;&#x306B;&#x3088;&#x3063;&#x3066;&#x6D41;&#x66A2;&#x306A;&#x7FFB;&#x8A33;&#x3092;&#x751F;&#x6210;&#x53EF;&#x80FD;&#x306B;&#x306A;&#x3063;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x3053;&#x308C;&#x307E;&#x3067;&#x306E;&#x6A5F;&#x68B0;&#x7FFB;&#x8A33;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x4E00;&#x6587;&#x5358;&#x4F4D;&#x3067;&#x306E;&#x7FFB;&#x8A33;&#x3092;&#x5BFE;&#x8C61;&#x306B;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x6587;&#x7AE0;&#x5358;&#x4F4D;&#x3067;&#x306E;&#x7FFB;&#x8A33;&#x3092;&#x8003;&#x3048;&#x305F;&#x5834;&#x5408;&#x306B;&#x3001;&#x6587;&#x8108;&#x306B;&#x5FDC;&#x3058;&#x305F;&#x8A33;&#x8A9E;&#x9078;&#x629E;&#x3001;&#x4EE3;&#x540D;&#x8A5E;&#x88DC;&#x5B8C;&#x3001;&#x8A33;&#x8A9E;&#x306E;&#x4E00;&#x8CAB;&#x6027;&#x3068;&#x3044;&#x3063;&#x305F;&#x89B3;&#x70B9;&#x304B;&#x3089;&#x898B;&#x308B;&#x3068;&#x6A5F;&#x68B0;&#x7FFB;&#x8A33;&#x306B;&#x306F;&#x8AB2;&#x984C;&#x304C;&#x6B8B;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x6700;&#x8FD1;&#x306B;&#x306A;&#x308A;&#x6587;&#x8108;&#x3092;&#x4F7F;&#x3063;&#x305F;&#x6A5F;&#x68B0;&#x7FFB;&#x8A33;&#x306E;&#x7814;&#x7A76;&#x306F;&#x884C;&#x306A;&#x308F;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x304D;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x8A33;&#x8A9E;&#x306E;&#x4E00;&#x8CAB;&#x6027;&#x3068;&#x3044;&#x3063;&#x305F;&#x89B3;&#x70B9;&#x3067;&#x53D6;&#x308A;&#x7D44;&#x3093;&#x3067;&#x3044;&#x308B;&#x7814;&#x7A76;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3067;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x4E00;&#x8CAB;&#x6027;&#x3092;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30BB;&#x30C3;&#x30C8;&#x3084;&#x9069;&#x5207;&#x306A;&#x8A55;&#x4FA1;&#x6307;&#x6A19;&#x304C;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x6A5F;&#x68B0;&#x7FFB;&#x8A33;&#x306B;&#x3088;&#x308B;&#x8A33;&#x8A9E;&#x4E00;&#x8CAB;&#x6027;&#x3092;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x65E5;&#x82F1;/&#x82F1;&#x65E5;&#x7FFB;&#x8A33;&#x30C7;&#x30FC;&#x30BF;&#x30BB;&#x30C3;&#x30C8;&#x4F5C;&#x6210;&#x306B;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x307E;&#x3057;&#x305F;&#x3002;&#x307E;&#x305F;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x5B9F;&#x9A13;&#x3082;&#x884C;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x5236;&#x7D04;&#x4ED8;&#x304D;&#x30C7;&#x30B3;&#x30FC;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3067;&#x8A33;&#x8A9E;&#x306E;&#x4E00;&#x8CAB;&#x6027;&#x306E;&#x6B63;&#x89E3;&#x7387;&#x304C;&#x9AD8;&#x304F;&#x306A;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/3N4-J-10-03/public/pdf?type=in" target="_blank" rel="noopener">[3N4-J-10-03] &#x6DF1;&#x5C64;&#x5B66;&#x7FD2;&#x3092;&#x7528;&#x3044;&#x305F;&#x4E0D;&#x52D5;&#x7523;&#x9593;&#x53D6;&#x308A;&#x56F3;&#x306E;&#x30B0;&#x30E9;&#x30D5;&#x5316;&#x3068;&#x7269;&#x4EF6;&#x691C;&#x7D22;&#x3078;&#x306E;&#x5FDC;&#x7528;&#xFF08;&#x5C71;&#x7530;&#x3089;&#xFF09;</a><br>&#x4E0D;&#x52D5;&#x7523;&#x306E;&#x9593;&#x53D6;&#x308A;&#x56F3;&#x3067;&#x985E;&#x4F3C;&#x3057;&#x305F;&#x3082;&#x306E;&#x3092;&#x691C;&#x7D22;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x30B0;&#x30E9;&#x30D5;&#x69CB;&#x9020;&#x3092;&#x5229;&#x7528;&#x3057;&#x305F;&#x7814;&#x7A76;&#x3067;&#x3059;&#x3002;&#x5148;&#x884C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x90E8;&#x5C4B;&#x306E;&#x7269;&#x7406;&#x7684;&#x8FD1;&#x3055;&#x3092;&#x7528;&#x3044;&#x3066;&#x30B0;&#x30E9;&#x30D5;&#x3092;&#x69CB;&#x7BC9;&#x3057;&#x3066;&#x3044;&#x305F;&#x305F;&#x3081;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x884C;&#x304D;&#x6765;&#x3067;&#x304D;&#x306A;&#x3044;&#x90E8;&#x5C4B;&#x540C;&#x58EB;&#x306B;&#x3082;&#x30A8;&#x30C3;&#x30B8;&#x304C;&#x5F35;&#x3089;&#x308C;&#x308B;&#x3068;&#x3044;&#x3046;&#x554F;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x3053;&#x3067;&#x3053;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x30C9;&#x30A2;&#x306E;&#x4F4D;&#x7F6E;&#x306E;&#x60C5;&#x5831;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3067;&#x5148;&#x884C;&#x7814;&#x7A76;&#x306E;&#x554F;&#x984C;&#x3092;&#x89E3;&#x6C7A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x5177;&#x4F53;&#x7684;&#x306B;&#x306F;&#x3001;&#x307E;&#x305A;&#x30C9;&#x30A2;&#x306E;&#x4F4D;&#x7F6E;&#x3092;&#x30EB;&#x30FC;&#x30EB;&#x30D9;&#x30FC;&#x30B9;&#x3067;&#x540C;&#x5B9A;&#x3057;&#x3001;&#x30C9;&#x30A2;&#x3067;&#x7E4B;&#x304C;&#x3063;&#x3066;&#x3044;&#x308B;&#x90E8;&#x5C4B;&#xFF08;&#x30CE;&#x30FC;&#x30C9;&#xFF09;&#x9593;&#x306B;&#x30A8;&#x30C3;&#x30B8;&#x3092;&#x5F35;&#x308B;&#x3068;&#x3053;&#x308D;&#x3092;&#x9650;&#x5B9A;&#x3057;&#x30B0;&#x30E9;&#x30D5;&#x3092;&#x751F;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x624B;&#x6CD5;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x5B9F;&#x969B;&#x306E;&#x7269;&#x4EF6;&#x691C;&#x7D22;&#x306B;&#x5FDC;&#x7528;&#x3057;&#x305F;&#x4F8B;&#x306E;&#x6210;&#x529F;&#x3057;&#x305F;&#x3082;&#x306E;&#x306F;&#x4EBA;&#x304C;&#x898B;&#x3066;&#x3082;&#x4F3C;&#x3066;&#x3044;&#x308B;&#x3068;&#x601D;&#x3048;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308A;&#x304A;&#x3082;&#x3057;&#x308D;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/2Q3-J-2-04/public/pdf?type=in" target="_blank" rel="noopener">[2Q3-J-2-04] &#x7279;&#x5FB4;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x7528;&#x3044;&#x305F;&#x6A5F;&#x68B0;&#x5B66;&#x7FD2;&#x306E;&#x8AAC;&#x660E;&#x624B;&#x6CD5;&#xFF08;&#x6D45;&#x91CE;&#x3089;&#xFF09;</a><br>LIME&#x306F;&#x500B;&#x3005;&#x306E;&#x7279;&#x5FB4;&#x306E;&#x91CD;&#x8981;&#x6027;&#x3092;&#x6E2C;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x91CD;&#x8981;&#x306A;&#x7279;&#x5FB4;&#x306E;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x3092;&#x7279;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x4E88;&#x6E2C;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x305F;&#x7279;&#x5FB4;&#x306E;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x306B;&#x7740;&#x76EE;&#x3057;&#x305F;MP-LIME&#xFF08;Minimal-Patterns-LIME&#xFF09;&#x3092;&#x63D0;&#x6848;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x6975;&#x5C0F;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x306E;&#x63A2;&#x7D22;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;&#x7279;&#x5FB4;&#x306E;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x7279;&#x5FB4;&#xFF08;A,B,C&#xFF09;&#x306B;&#x5BFE;&#x3057;&#x3066;&#xFF08;A,B),(B,C),(A,C)&#x3068;&#x7279;&#x5FB4;&#x6570;&#x3092;&#x6E1B;&#x3089;&#x3057;&#x305F;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x4F5C;&#x308A;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x7279;&#x5FB4;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3063;&#x305F;&#x5206;&#x985E;&#x7D50;&#x679C;&#x3068;&#x5143;&#x306E;&#x5206;&#x985E;&#x7D50;&#x679C;&#x304C;&#x5909;&#x308F;&#x308B;&#x307E;&#x3067;&#x63A2;&#x7D22;&#x3057;&#x307E;&#x3059;&#x3002;&#x7279;&#x5FB4;&#x6570;&#x3092;&#x6E1B;&#x3089;&#x3057;&#x3066;&#x3044;&#x304D;&#x3001;&#x7570;&#x306A;&#x308B;&#x5206;&#x985E;&#x7D50;&#x679C;&#x306B;&#x306A;&#x3063;&#x305F;&#x4E00;&#x3064;&#x524D;&#x306E;&#x7279;&#x5FB4;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x6975;&#x5C0F;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3068;&#x3057;&#x3001;&#x3053;&#x306E;&#x6975;&#x5C0F;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;MP-LIME&#x306B;&#x304A;&#x3051;&#x308B;&#x5224;&#x65AD;&#x6839;&#x62E0;&#x3068;&#x3057;&#x307E;&#x3059;&#x3002;&#x7D50;&#x679C;&#x306F;&#x3001;recall&#x306F;&#x82E5;&#x5E72;&#x4E0B;&#x304C;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;Precision&#x304C;&#x304B;&#x306A;&#x308A;&#x5411;&#x4E0A;&#x3057;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x4E88;&#x6E2C;&#x306B;&#x7528;&#x3044;&#x3089;&#x308C;&#x305F;&#x7279;&#x5FB4;&#x306E;&#x5272;&#x5408;&#x3082;&#x591A;&#x304F;&#x306A;&#x308B;&#x3068;&#x3044;&#x3046;&#x7D50;&#x679C;&#x3067;&#x3057;&#x305F;&#x3002;LIME&#x306B;&#x3088;&#x308A;&#x5224;&#x65AD;&#x6839;&#x62E0;&#x3068;&#x3057;&#x3066;&#x51FA;&#x529B;&#x3055;&#x308C;&#x305F;&#x753B;&#x50CF;&#x3092;&#x518D;&#x5EA6;CNN&#x306B;&#x304B;&#x3051;&#x308B;&#x3068;&#x3001;&#x3082;&#x3068;&#x306E;&#x5206;&#x985E;&#x7D50;&#x679C;&#x306B;&#x306A;&#x3089;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x554F;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;MP-LIME&#x3060;&#x3068;&#x305D;&#x308C;&#x3082;&#x89E3;&#x6D88;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x5224;&#x65AD;&#x6839;&#x62E0;&#x7279;&#x5B9A;&#x624B;&#x6CD5;&#x306F;&#x304B;&#x306A;&#x308A;&#x591A;&#x304F;&#x306E;&#x65B9;&#x3005;&#x304B;&#x3089;&#x6CE8;&#x76EE;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x6211;&#x3005;&#x3082;&#x30C1;&#x30E3;&#x30EC;&#x30F3;&#x30B8;&#x3057;&#x3066;&#x3044;&#x308B;&#x5206;&#x91CE;&#x3060;&#x3063;&#x305F;&#x305F;&#x3081;&#x975E;&#x5E38;&#x306B;&#x8208;&#x5473;&#x6DF1;&#x3044;&#x767A;&#x8868;&#x3067;&#x3057;&#x305F;&#x3002;&#x3000;<br><img src="/images/20190627/4.jpg" style="border:solid 1px #000000" class="img-middle-size"></p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/1P2-J-13-05/public/pdf?type=in" target="_blank" rel="noopener">[1P2-J-13-05] &#x65B0;&#x805E;&#x8A18;&#x4E8B;&#x304B;&#x3089;&#x306E;&#x56E0;&#x679C;&#x95A2;&#x4FC2;&#x3092;&#x8003;&#x616E;&#x3057;&#x305F;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x81EA;&#x52D5;&#x8981;&#x7D04;&#x6587;&#x751F;&#x6210;&#xFF08;&#x9AD8;&#x5DBA;&#x3089;&#xFF09;</a><br>&#x65B0;&#x805E;&#x8A18;&#x4E8B;&#x304B;&#x3089;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30DE;&#x30A4;&#x30CB;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x308B;&#x56E0;&#x679C;&#x95A2;&#x4FC2;&#x3092;&#x8003;&#x616E;&#x3057;&#x305F;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x8981;&#x7D04;&#x6587;&#x751F;&#x6210;&#x624B;&#x6CD5;&#x306E;&#x7814;&#x7A76;&#x3067;&#x3059;&#x3002;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3068;&#x306F;&#x3001;&#x8A3C;&#x5238;&#x5206;&#x6790;&#x306E;&#x5C02;&#x9580;&#x5BB6;&#x304C;&#x4F01;&#x696D;&#x306E;&#x7D4C;&#x55B6;&#x72B6;&#x614B;&#x3084;&#x53CE;&#x76CA;&#x529B;&#x306A;&#x3069;&#x3092;&#x5206;&#x6790;&#x30FB;&#x8ABF;&#x67FB;&#x3057;&#x3001;&#x307E;&#x3068;&#x3081;&#x305F;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x306F;&#x3001;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x306E;&#x4E88;&#x60F3;&#x3092;&#x793A;&#x3059;&#x6587;&#x3068;&#x305D;&#x306E;&#x6839;&#x62E0;&#x3092;&#x793A;&#x3059;&#x6587;&#x304C;&#x3042;&#x308A;&#x3001;&#x3053;&#x308C;&#x3089;&#x4E8C;&#x7A2E;&#x985E;&#x306E;&#x6587;&#x3068;&#x985E;&#x4F3C;&#x3059;&#x308B;&#x6587;&#x3092;&#x65B0;&#x805E;&#x8A18;&#x4E8B;&#x4E2D;&#x304B;&#x3089;&#x30DE;&#x30A4;&#x30CB;&#x30F3;&#x30B0;&#x3057;&#x307E;&#x3059;&#x3002;&#x985E;&#x4F3C;&#x5EA6;&#x306E;&#x7B97;&#x51FA;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x3001;LDA&#x3068;Skip-gram&#x306B;&#x3088;&#x308A;&#x5F97;&#x3089;&#x308C;&#x305F;2&#x7A2E;&#x985E;&#x306E;&#x5206;&#x6563;&#x8868;&#x73FE;&#x306E;&#x985E;&#x4F3C;&#x5EA6;&#x3068;&#x91D1;&#x878D;&#x6975;&#x6027;&#x8F9E;&#x66F8;&#x3092;&#x7528;&#x3044;&#x305F;&#x6975;&#x6027;&#x306E;&#x4E00;&#x81F4;&#x5EA6;&#x3092;&#x305D;&#x308C;&#x305E;&#x308C;&#x30B3;&#x30B5;&#x30A4;&#x30F3;&#x985E;&#x4F3C;&#x5EA6;&#x3092;&#x7528;&#x3044;&#x3066;&#x7B97;&#x51FA;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x8A55;&#x4FA1;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x3001;&#x6587;&#x7AE0;&#x5185;&#x3067;&#x56E0;&#x679C;&#x95A2;&#x4FC2;&#x3092;&#x62BD;&#x51FA;&#x3067;&#x304D;&#x305F;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x4EF6;&#x6570;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x30A2;&#x30CA;&#x30EA;&#x30B9;&#x30C8;&#x306E;&#x4E88;&#x60F3;&#x306E;&#x6839;&#x62E0;&#x60C5;&#x5831;&#x306E;&#x62BD;&#x51FA;&#x304C;&#x3067;&#x304D;&#x305F;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x4EF6;&#x6570;&#x306E;&#x5272;&#x5408;&#x3092;&#x7528;&#x3044;&#x3066;&#x304A;&#x308A;&#x3001;&#x3053;&#x306E;&#x5272;&#x5408;&#x304C;80%&#x3092;&#x8D85;&#x3048;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304B;&#x3089;&#x63D0;&#x6848;&#x624B;&#x6CD5;&#x304C;&#x6709;&#x7528;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;<br><img src="/images/20190627/5.jpg" style="border:solid 1px #000000" class="img-middle-size"></p>
<p><a href="https://confit.atlas.jp/guide/event-img/jsai2019/1H4-J-13-03/public/pdf?type=in" target="_blank" rel="noopener">[1H4-J-13-03] &#x9577;&#x671F;&#x77ED;&#x671F;&#x8A18;&#x61B6;&#x3068;&#x5FC3;&#x62CD;&#x5909;&#x52D5;&#x306B;&#x57FA;&#x3065;&#x304F;&#x7761;&#x7720;&#x6642;&#x7121;&#x547C;&#x5438;&#x75C7;&#x5019;&#x7FA4;&#x306E;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#xFF08;&#x5CA9;&#x5D0E;&#x3089;&#xFF09;</a><br>&#x7761;&#x7720;&#x6642;&#x7121;&#x547C;&#x5438;&#x75C7;&#x5019;&#x7FA4;(SAS)&#x306F;&#x3001;&#x7761;&#x7720;&#x4E2D;&#x306B;&#x547C;&#x5438;&#x306E;&#x505C;&#x6B62;&#x3042;&#x308B;&#x3044;&#x306F;&#x547C;&#x5438;&#x91CF;&#x306E;&#x6E1B;&#x5C11;&#x304C;&#x983B;&#x7E41;&#x306B;&#x8D77;&#x3053;&#x308B;&#x75BE;&#x60A3;&#x3067;&#x3042;&#x308A;&#x3001;&#x65E5;&#x4E2D;&#x306E;&#x7720;&#x6C17;&#x306A;&#x3069;&#x306E;&#x75C7;&#x72B6;&#x3092;&#x5F15;&#x304D;&#x8D77;&#x3053;&#x3059;&#x307B;&#x304B;&#x3001;&#x5FC3;&#x8840;&#x7BA1;&#x7CFB;&#x306E;&#x5408;&#x4F75;&#x75C7;&#x306E;&#x30EA;&#x30B9;&#x30AF;&#x3092;&#x9AD8;&#x3081;&#x307E;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3067;&#x81EA;&#x899A;&#x75C7;&#x72B6;&#x306B;&#x4E4F;&#x3057;&#x3044;&#x30B1;&#x30FC;&#x30B9;&#x3082;&#x5B58;&#x5728;&#x3059;&#x308B;&#x305F;&#x3081;&#x6CBB;&#x7642;&#x306B;&#x81F3;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x60A3;&#x8005;&#x304C;&#x591A;&#x3044;&#x3068;&#x8003;&#x3048;&#x3089;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;SAS&#x306E;&#x8A3A;&#x65AD;&#x306B;&#x306F;&#x7D42;&#x591C;&#x7761;&#x7720;&#x30DD;&#x30EA;&#x30B0;&#x30E9;&#x30D5;&#x691C;&#x67FB; (PSG) &#x304C;&#x7528;&#x3044;&#x3089;&#x308C;&#x307E;&#x3059;&#x304C;&#x3001;PSG&#x3092;&#x5B9F;&#x65BD;&#x3067;&#x304D;&#x308B;&#x65BD;&#x8A2D;&#x304C;&#x5C11;&#x306A;&#x3044;&#x3053;&#x3068;&#x3084;&#x9AD8;&#x984D;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x304C;&#x554F;&#x984C;&#x3067;&#x3057;&#x305F;&#x3002;&#x305D;&#x3053;&#x3067;&#x672C;&#x7814;&#x7A76;&#x3067;&#x306F;&#x3001;&#x5FC3;&#x62CD;&#x5909;&#x52D5;&#x89E3;&#x6790;&#x3068;LSTM&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x305F;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x624B;&#x6CD5;&#x3092;&#x63D0;&#x6848;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;SAS&#x60A3;&#x8005;&#x304A;&#x3088;&#x3073;&#x5065;&#x5E38;&#x8005;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x63D0;&#x6848;&#x6CD5;&#x3092;&#x9069;&#x7528;&#x3057;&#x305F;&#x3068;&#x3053;&#x308D;&#x3001;&#x611F;&#x5EA6;100%&#x3001;&#x7279;&#x7570;&#x5EA6;100%&#xFF08;&#x611F;&#x5EA6;&#xFF1A;SAS&#x306E;&#x4EBA;&#x306E;&#x306A;&#x304B;&#x3067;&#x3001;&#x967D;&#x6027;&#x3068;&#x5224;&#x65AD;&#x3055;&#x308C;&#x305F;&#x5272;&#x5408;&#x3001;&#x7279;&#x7570;&#x5EA6;&#xFF1A;SAS&#x3067;&#x306F;&#x306A;&#x3044;&#x4EBA;&#x306E;&#x306A;&#x304B;&#x3067;&#x3001;&#x9670;&#x6027;&#x3068;&#x5224;&#x65AD;&#x3055;&#x308C;&#x305F;&#x5272;&#x5408;&#xFF09;&#x3067;SAS&#x306E;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x304C;&#x660E;&#x3089;&#x304B;&#x3068;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x9069;&#x7528;&#x3055;&#x308C;&#x305F;&#x624B;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x306F;&#x65B0;&#x898F;&#x6027;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x533B;&#x5B66;&#x9818;&#x57DF;&#x3067;&#x306E;&#x6D3B;&#x7528;&#x306F;&#x65B0;&#x9BAE;&#x3067;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x304F;&#x9762;&#x767D;&#x3044;&#x767A;&#x8868;&#x3067;&#x3057;&#x305F;&#x3002;</p>
<p><a href="https://confit&#x3002;atlas&#x3002;jp/guide/event-img/jsai2019/1L3-J-11-01/public/pdf?type=in" target="_blank" rel="noopener">[1L3-J-11-01] HVGH: &#x9AD8;&#x6B21;&#x5143;&#x6642;&#x7CFB;&#x5217;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x6DF1;&#x5C64;&#x5727;&#x7E2E;&#x3068;&#x6559;&#x5E2B;&#x306A;&#x3057;&#x5206;&#x7BC0;&#x5316;&#xFF08;&#x9577;&#x91CE;&#x3089;&#xFF09;</a><br>&#x3053;&#x306E;&#x7814;&#x7A76;&#x3067;&#x306F;&#x6559;&#x5E2B;&#x306A;&#x3057;&#x3067;&#x9AD8;&#x6B21;&#x5143;&#x306E;&#x6642;&#x7CFB;&#x5217;&#x30C7;&#x30FC;&#x30BF;&#x304B;&#x3089;&#x7279;&#x5FB4;&#x62BD;&#x51FA;&#x3059;&#x308B;&#x3068;&#x540C;&#x6642;&#x306B;&#x3001;&#x5206;&#x7BC0;&#x30FB;&#x5206;&#x985E;&#x304C;&#x53EF;&#x80FD;&#x306A;Hierarchical Dirichlet Processes-Variational Autoencoder-Gaussian Process-Hidden Semi-Markov Model (HVGH)&#x3092;&#x63D0;&#x6848;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;HVGH&#x306F;&#x3001;HDP-GP-HSMM&#x306B;Variational Autoencoder&#xFF08;VAE&#xFF09;&#x3092;&#x5C0E;&#x5165;&#x3057;&#x305F;&#x30E2;&#x30C7;&#x30EB;&#x3067;&#x3042;&#x308A;&#x3001;VAE&#x306B;&#x3088;&#x308A;&#x9AD8;&#x6B21;&#x5143;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x4F4E;&#x6B21;&#x5143;&#x306E;&#x6F5C;&#x5728;&#x5909;&#x6570;&#x3078;&#x3068;&#x5727;&#x7E2E;&#x3057;&#x3001;&#x305D;&#x306E;&#x6F5C;&#x5728;&#x5909;&#x6570;&#x306E;&#x9077;&#x79FB;&#x3092;&#x30AC;&#x30A6;&#x30B9;&#x904E;&#x7A0B;&#x3092;&#x7528;&#x3044;&#x3066;&#x8868;&#x73FE;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x9AD8;&#x6B21;&#x5143;&#x306E;&#x8907;&#x96D1;&#x306A;&#x6642;&#x7CFB;&#x5217;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x5206;&#x7BC0;&#x5316;&#x3092;&#x53EF;&#x80FD;&#x3068;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x5B9F;&#x9A13;&#x3067;&#x306F;CMU Graphics Lab Motion Capture Database&#x306E;&#x30E2;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30AD;&#x30E3;&#x30D7;&#x30C1;&#x30E3;&#x30C7;&#x30FC;&#x30BF;&#xFF08;&#x30C1;&#x30AD;&#x30F3;&#x30C0;&#x30F3;&#x30B9;&#x3068;&#x4F53;&#x64CD;&#x52D5;&#x4F5C; 1&#xFF09;&#x3092;&#x5165;&#x529B;&#x3068;&#x3057;&#x3066;&#x5206;&#x7BC0;&#x5316;&#x3092;&#x884C;&#x3063;&#x305F;&#x7D50;&#x679C;&#x3001;&#x8907;&#x96D1;&#x306A;&#x52D5;&#x4F5C;&#x3082;&#x9AD8;&#x3044;&#x7CBE;&#x5EA6;&#x3067;&#x5206;&#x7BC0;&#x5316;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;<br><img src="/images/20190627/6.jpg" style="border:solid 1px #000000" class="img-middle-size"></p>
<h1 id="&#x304A;&#x308F;&#x308A;&#x306B;"><a href="#&#x304A;&#x308F;&#x308A;&#x306B;" class="headerlink" title="&#x304A;&#x308F;&#x308A;&#x306B;"></a>&#x304A;&#x308F;&#x308A;&#x306B;</h1><p>&#x3044;&#x304B;&#x304C;&#x3067;&#x3057;&#x305F;&#x3067;&#x3057;&#x3087;&#x304B;&#xFF1F;&#x1F466;<br>&#x4E8C;&#x4EBA;&#x3068;&#x3082;Future&#x306B;&#x5165;&#x3063;&#x3066;&#x521D;&#x3081;&#x3066;&#x306E;&#x5B66;&#x4F1A;&#x3067;&#x3057;&#x305F;&#x304C;&#x3001;&#x69D8;&#x3005;&#x306A;&#x7814;&#x7A76;&#x6210;&#x679C;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x826F;&#x3044;&#x523A;&#x6FC0;&#x3092;&#x53D7;&#x3051;&#x307E;&#x3057;&#x305F;&#x3002;<br>SAIG&#x3067;&#x306F;&#x3001;&#x9031;&#x306B;&#x4E00;&#x56DE;&#x3001;Future Study Group &#x3068;&#x3044;&#x3046;&#x52C9;&#x5F37;&#x4F1A;&#x3092;&#x958B;&#x50AC;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;JSAI2019&#x306E;&#x7814;&#x7A76;&#x767A;&#x8868;&#x3082;&#x5171;&#x6709;&#x3057;&#x3088;&#x3046;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#xFF01;</p>
<p>&#x73FE;&#x5728;SAIG&#x3067;&#x306F;&#x610F;&#x6B32;&#x3042;&#x308B;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x3092;&#x52DF;&#x96C6;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x4E0B;&#x8A18;URL&#x304B;&#x3089;&#x5FDC;&#x52DF;&#x3067;&#x304D;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x8208;&#x5473;&#x306E;&#x3042;&#x308B;&#x65B9;&#x306F;&#x662F;&#x975E;&#xFF01;<br><a href="https://progres12.jposting.net/pgfuture/u/job.phtml?job_code=365" target="_blank" rel="noopener">https://progres12.jposting.net/pgfuture/u/job.phtml?job_code=365</a><br><a href="https://progres12.jposting.net/pgfuture/u/job.phtml?job_code=363" target="_blank" rel="noopener">https://progres12.jposting.net/pgfuture/u/job.phtml?job_code=363</a></p>
<img src="/images/20190627/7.jpg" width="60%">

<p>&#x25B2;&#x4F1A;&#x5834;&#xFF08;&#x6731;&#x9DFA;&#x30E1;&#x30C3;&#x30BB;&#xFF09;&#x304B;&#x3089;&#x898B;&#x3048;&#x308B;&#x666F;&#x8272;</p>
<p>&#x4EE5;&#x4E0A;&#x3001;&#x6C34;&#x672C;&#x30FB;&#x660E;&#x5B98;&#x3067;&#x3057;&#x305F;&#xFF01;</p>
<div id="footnotes"><hr><div id="footnotelist"><ol style="list-style:none; padding-left: 0;"><li id="fn:1"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">1.</span><span style="display: inline-block; vertical-align: top;">&#x677E;&#x5409; &#x4FCA;, &#x5185;&#x6D77; &#x5F70;&#xFF1A;&#x30E1;&#x30BF;&#x30D5;&#x30A1;&#x30FC;&#x5199;&#x50CF;&#x306B;&#x57FA;&#x3065;&#x304F;&#x7269;&#x8A9E;&#x6587;&#x306E;&#x81EA;&#x52D5;&#x751F;&#x6210;, &#x8A00;&#x8A9E;&#x51E6;&#x7406;&#x5B66;&#x4F1A;&#x7B2C; 24 &#x56DE;&#x5E74;&#x6B21;&#x5927;&#x4F1A;&#x767A;&#x8868;&#x8AD6;&#x6587;&#x96C6;, pp. 1288&#x2013;1291 (2018)</span><a href="#fnref:1" rev="footnote"> &#x21A9;</a></li></ol></div></div>
      
    </div>
  </div>
    
  <!-- シェアボタン START -->
  <div class="social-area">
  <ul class="social-button">

      <!-- twitter -->
      <li class="sc-tw social-button-twitter">
          <a href="https://twitter.com/share" class="twitter-share-button" data-via="future_techblog" data-lang="ja" data-hashtags="future_architect">ツイート</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
      </li>
      
      <!-- Facebookいいね -->
      <li class="social-button-fb">
          <div id="fb-root"></div>
          <script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v2.8";
              fjs.parentNode.insertBefore(js, fjs);
            }(document, 'script', 'facebook-jssdk'));</script>
          <div class="fb-like" data-href="https://future-architect.github.io/articles/20190627/" data-layout="button_count" data-action="like" data-size="small" data-show-faces="true" data-share="true"></div>
      </li>

      <!-- はてなブックマーク -->
      <li class="social-button-hatebu"><a href="http://b.hatena.ne.jp/entry/https://future-architect.github.io/articles/20190627/" class="hatena-bookmark-button" data-hatena-bookmark-layout="standard-balloon" data-hatena-bookmark-lang="ja" title="このエントリーをはてなブックマークに追加"><img src="https://b.st-hatena.com/images/entry-button/button-only@2x.png" alt="このエントリーをはてなブックマークに追加" width="20" height="20" style="border: none;" /></a><script type="text/javascript" src="https://b.st-hatena.com/js/bookmark_button.js" charset="utf-8" async="async"></script></li>

      <!-- pocket -->
      <li class="social-button-pocket"><a data-pocket-label="pocket" data-pocket-count="horizontal" class="pocket-btn" data-lang="en"></a>
          <script type="text/javascript">!function(d,i){if(!d.getElementById(i)){var j=d.createElement("script");j.id=i;j.src="https://widgets.getpocket.com/v1/j/btn.js?v=1";var w=d.getElementById(i);d.body.appendChild(j);}}(document,"pocket-btn-js");</script>
      </li>

  </ul>
  </div>
<!-- シェアボタン END -->


  
    
<nav id="article-nav">
  
    <a href="/articles/20190702/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          AWS Datalake Hands-on(2019 May)メモ
        
      </div>
    </a>
  
  
    <a href="/articles/20190625/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Amazon Redshiftの仕様を調べてみた</div>
    </a>
  
</nav>

  
  <br>
</article>

</div>
<div class="col-md-3 col-sm-3 blog-sidebar">
  <!-- CATEGORIES START -->
<h2 class="margin-top-30">Categories</h2>

<div class="widget-wrap">
  <div class="widget">
    <ul class="nav sidebar-categories margin-bottom-40">
      
	<li>
	  <a href="/categories/Culture/">Culture (21)</a>
	</li>
      
	<li>
	  <a href="/categories/IoT/">IoT (6)</a>
	</li>
      
	<li>
	  <a href="/categories/VR/">VR (7)</a>
	</li>
      
	<li>
	  <a href="/categories/Security/">Security (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Programming/">Programming (8)</a>
	</li>
      
	<li>
	  <a href="/categories/Design/">Design (1)</a>
	</li>
      
	<li>
	  <a href="/categories/Management/">Management (5)</a>
	</li>
      
	<li>
	  <a href="/categories/DB/">DB (5)</a>
	</li>
      
	<li>
	  <a href="/categories/Infrastructure/">Infrastructure (13)</a>
	</li>
      
	<li>
	  <a href="/categories/DataScience/">DataScience (15)</a>
	</li>
      
    </ul>
  </div>
</div>


<!-- CATEGORIES END -->

<!-- BEGIN FEATURED POSTS -->
<h2>Featured Posts</h2>
<div class="recent-news margin-bottom-10">
  
  
    
      
        <a href="https://future-architect.github.io/articles/20190625/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                Amazon Redshiftの仕様を調べてみた
              </li>
            </div>
          </div>
        </a>
      
	
  
    
  
    
      
        <a href="https://future-architect.github.io/articles/20190513/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                第1回PG Battle参戦記
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190703/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                マネージャーがうれしいRedmineデータのグラフ表示方法を公開します！！（Metabase編） 
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190702/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                AWS Datalake Hands-on(2019 May)メモ
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
        <a href="https://future-architect.github.io/articles/20190627/">
          <div class="row margin-bottom-10">
            <div class="col-md-10">
              <li>
                人工知能学会（JSAI2019） 参加報告
              </li>
            </div>
          </div>
        </a>
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
  
    
      
	
  
    
  
    
      
	
  
    
      
	
  
    
      
	
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
    
  
</div>
<!-- END FEATURED POSTS -->

<!-- START ADVENT CALENDAR -->
<div class="margin-bottom-20">
  <h2>Advent Calendar</h2>
  <div class="widget-wrap">
  <div class="widget">
    <ul class="nav">
      <li>
        <a href="http://qiita.com/advent-calendar/2018/future" target="_blank">2018年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2017/future" target="_blank">2017年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2016/future" target="_blank">2016年</a>
      </li>
      <li>
        <a href="http://qiita.com/advent-calendar/2015/future" target="_blank">2015年</a>
      </li>
    </ul>
  </div>
</div>

</div>
<!-- END ADVENT CALENDAR -->


</div>
</div>

  </section>
</div>

    <!-- BEGIN PRE-FOOTER -->
    <div class="pre-footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN BOTTOM ABOUT BLOCK -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>About Us</h2>
            <p>経営とITをデザインする、フューチャーアーキテクトの技術ブログです。IoTやAI(MachineLearning)・Security・VR・Cloud・BigDataといった内容の記事を中心に、業務で利用する幅広い技術について紹介します。また、OSSへの貢献やカンファレンスなどへの登壇など、フューチャーへのエンジニア文化についてもドシドシ紹介していきますのでぜひウォッチ下さい！<br /><br /><a href="http://www.future.co.jp/">http://www.future.co.jp/</a></p>
          </div>
          <!-- END BOTTOM ABOUT BLOCK -->

          <!-- BEGIN BOTTOM CONTACTS -->
          <div class="col-md-4 col-sm-6 pre-footer-col">
            <h2>Contact</h2>
            <address class="margin-bottom-40">
              東京都品川区大崎1-2-2<br>
              アートヴィレッジ大崎セントラルタワー<br><br>
              Email: <a href="mailto:techblog@future.co.jp">techblog@future.co.jp</a><br>
            </address>
          </div>
          <!-- END BOTTOM CONTACTS -->

	
          <!-- BEGIN TWITTER BLOCK -->
    <div class="col-md-4 col-sm-6 pre-footer-col">

    <!-- Twitterフォローボタン -->
    <a href="https://twitter.com/future_techblog" class="twitter-follow-button" data-show-count="false" data-lang="ja">/future_techblogさんをフォロー</a> <script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>

	  <a data-tweet-limit="1" class="twitter-timeline"
	  href="https://twitter.com/future_techblog"
	  data-widget-id="732749663766372354">Tweets by @future_techblog</a>

	  <script>!function(d,s,id){var
	  js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+"://platform.twitter.com/widgets.js";fjs.parentNode.insertBefore(js,fjs);}}(document,"script","twitter-wjs");</script>

          </div>
          <!-- END TWITTER BLOCK -->
	
        </div>
      </div>
    </div>
    <!-- END PRE-FOOTER -->

    <!-- BEGIN FOOTER -->
    <div class="footer">
      <div class="container">
        <div class="row">
          <!-- BEGIN COPYRIGHT -->
          <div class="col-md-6 col-sm-6 padding-top-10">
                  &copy; 2019 Future Tech Blog - フューチャーアーキテクト<br>
 <!-- <a href="javascript:;">Privacy Policy</a> | <a href="javascript:;">Terms of Service</a> -->
          </div>
          <!-- END COPYRIGHT -->
	  <!-- BEGIN SOCIAL -->
<div class="col-md-6 col-sm-6">
  <ul class="social-footer list-unstyled list-inline pull-right">
    
      
      <li><a href="https://github.com/future-architect"><i class="fa fa-github"></i></a></li>
      
  
      
      <li><a href="https://twitter.com/future_techblog"><i class="fa fa-twitter"></i></a></li>
      
  
      
      <li><a href="https://www.facebook.com/future.saiyo"><i class="fa fa-facebook"></i></a></li>
      
  
      
      <li>
        <a href="http://qiita.com/organizations/future">
            <i class="fa fa-pencil-square-o"></i>
        </a>
      </li>
      
  
      
      <li><a href="/atom.xml"><i class="fa fa-rss"></i></a></li>
      
  
  </ul>
</div>
<!-- END SOCIAL -->

        </div>
      </div>
    </div>
    <!-- END FOOTER -->

  <!-- BEGIN CORE PLUGINS (REQUIRED FOR ALL PAGES) -->
<!--[if lt IE 9]>
<script src="/metronic/assets/plugins/respond.min.js"></script>
<![endif]-->
<script src="/metronic/assets/plugins/jquery.min.js"></script>
<script src="/metronic/assets/plugins/jquery-migrate.min.js"></script>
<script src="/metronic/assets/plugins/bootstrap/js/bootstrap.min.js"></script>
<script src="/metronic/assets/corporate/scripts/back-to-top.js"></script>
<script src="/metronic/assets/corporate/scripts/layout.js"></script>
<script src="/js/script.js"></script>

<script type="text/javascript">
    jQuery(document).ready(function() {
        Layout.init();
        Layout.initTwitter();
        Layout.initFixHeaderWithPreHeader(); /* Switch On Header Fixing (only if you have pre-header) */
        Layout.initNavScrolling();
    });
</script>
<!-- END CORE PLUGINS -->
<!-- START INTEGRATIONS -->

<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-74047147-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


<!-- END INTEGRATIONS --><!-- hexo-inject:begin --><!-- hexo-inject:end -->

</body>
</html>
